#ifndef KSTRUCTS_H
#define KSTRUCTS_H

// THESE ARE FOR T8112 (m2), kernel build specific (for some types), need regen for other device types

/*
 * Generated by kstructs
 * Types emitted: 1315/217006 types in source
 * Structs: 624, Unions: 19, Enums: 78, Typedefs: 594
 */
#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>

struct ks_CEAccelerationElement;
typedef struct ks_CEAccelerationElement ks_CEAccelerationElement;
struct ks_IOSKMapper;
typedef struct ks_IOSKMapper ks_IOSKMapper;
struct ks_IOSKRegion;
typedef struct ks_IOSKRegion ks_IOSKRegion;
struct ks___nx_stats_fsw;
typedef struct ks___nx_stats_fsw ks___nx_stats_fsw;
struct ks___user_channel_schema;
typedef struct ks___user_channel_schema ks___user_channel_schema;
struct ks_affinity_set;
typedef struct ks_affinity_set ks_affinity_set;
struct ks_arm_amx_saved_state;
typedef struct ks_arm_amx_saved_state ks_arm_amx_saved_state;
struct ks_arm_context;
typedef struct ks_arm_context ks_arm_context;
struct ks_arm_debug_aggregate_state;
typedef struct ks_arm_debug_aggregate_state ks_arm_debug_aggregate_state;
struct ks_arm_neon_saved_state;
typedef struct ks_arm_neon_saved_state ks_arm_neon_saved_state;
struct ks_arm_saved_state;
typedef struct ks_arm_saved_state ks_arm_saved_state;
struct ks_arm_state_hdr;
typedef struct ks_arm_state_hdr ks_arm_state_hdr;
struct ks_ch_info;
typedef struct ks_ch_info ks_ch_info;
struct ks_cpu_data;
typedef struct ks_cpu_data ks_cpu_data;
struct ks_flow_entry;

    ks_TURNSTILE_UPDATE_FLAGS_NONE = 0,
    ks_TURNSTILE_IMMEDIATE_UPDATE = 1,
    ks_TURNSTILE_DELAYED_UPDATE = 2,
    ks_TURNSTILE_INHERITOR_THREAD = 4,
    ks_TURNSTILE_INHERITOR_TURNSTILE = 8,
    ks_TURNSTILE_INHERITOR_NEEDS_PRI_UPDATE = 0x10,
    ks_TURNSTILE_NEEDS_PRI_UPDATE = 0x20,
    ks_TURNSTILE_INHERITOR_WORKQ = 0x40,
    ks_TURNSTILE_UPDATE_BOOST = 0x80,
};

enum {
    ks_NR_RX = 0,
    ks_NR_TX = 1,
    ks_NR_TXRX = 2,
    ks_NR_A = 2,
    ks_NR_F = 3,
    ks_NR_TXRXAF = 4,
    ks_NR_EV = 4,
    ks_NR_LBA = 5,
    ks_NR_ALL = 6,
};

enum {
    ks_UIO_USERSPACE = 0,
    ks_UIO_SYSSPACE = 2,
    ks_UIO_USERSPACE32 = 5,
    ks_UIO_USERSPACE64 = 8,
    ks_UIO_SYSSPACE32 = 11,
};

enum {
    ks_ULK_INVALID = 0,
    ks_ULK_UADDR = 1,
    ks_ULK_XPROC = 2,
};

enum {
    ks_VM_PAGE_NOT_ON_Q = 0,
    ks_VM_PAGE_IS_WIRED = 1,
    ks_VM_PAGE_USED_BY_COMPRESSOR = 2,
    ks_VM_PAGE_ON_FREE_Q = 3,
    ks_VM_PAGE_ON_FREE_LOCAL_Q = 4,
    ks_VM_PAGE_ON_THROTTLED_Q = 6,
    ks_VM_PAGE_ON_PAGEOUT_Q = 7,
    ks_VM_PAGE_ON_SPECULATIVE_Q = 8,
    ks_VM_PAGE_ON_ACTIVE_LOCAL_Q = 9,
    ks_VM_PAGE_ON_ACTIVE_Q = 10,
    ks_VM_PAGE_ON_INACTIVE_INTERNAL_Q = 11,
    ks_VM_PAGE_ON_INACTIVE_EXTERNAL_Q = 12,
    ks_VM_PAGE_ON_INACTIVE_CLEANED_Q = 13,
};

enum {
    ks_VM_PAGE_SPECIAL_Q_EMPTY = 0,
    ks_VM_PAGE_SPECIAL_Q_BG = 1,
    ks_VM_PAGE_SPECIAL_Q_DONATE = 2,
    ks_VM_PAGE_SPECIAL_Q_FG = 3,
};

enum {
    ks_VK_HASH_NONE = 0,
    ks_VK_HASH_SHA3_256 = 1,
    ks_VK_HASH_SHA3_384 = 2,
    ks_VK_HASH_SHA3_512 = 3,
};

enum {
    ks_VNON = 0,
    ks_VREG = 1,
    ks_VDIR = 2,
    ks_VBLK = 3,
    ks_VCHR = 4,
    ks_VLNK = 5,
    ks_VSOCK = 6,
    ks_VFIFO = 7,
    ks_VBAD = 8,
    ks_VSTR = 9,
    ks_VCPLX = 10,
};

enum {
    ks_WQT_INVALID = 0,
    ks_WQT_QUEUE = 1,
    ks_WQT_TURNSTILE = 2,
    ks_WQT_PORT = 3,
    ks_WQT_SELECT = 4,
    ks_WQT_PORT_SET = 5,
    ks_WQT_SELECT_SET = 6,
};

enum {
    ks_WI_CLASS_NONE = 0,
    ks_WI_CLASS_DISCRETIONARY = 1,
    ks_WI_CLASS_BEST_EFFORT = 2,
    ks_WI_CLASS_APPLICATION = 3,
    ks_WI_CLASS_SYSTEM = 4,
    ks_WI_CLASS_SYSTEM_CRITICAL = 5,
    ks_WI_CLASS_REALTIME = 6,
    ks_WI_CLASS_REALTIME_CRITICAL = 7,
    ks_WI_CLASS_APP_SUPPORT = 8,
    ks_WI_CLASS_COUNT = 9,
};

enum {
    ks_WQ_EXITING = 1,
    ks_WQ_PROC_SUSPENDED = 2,
    ks_WQ_DEATH_CALL_SCHEDULED = 4,
    ks_WQ_DELAYED_CALL_SCHEDULED = 0x10,
    ks_WQ_DELAYED_CALL_PENDED = 0x20,
    ks_WQ_IMMEDIATE_CALL_SCHEDULED = 0x40,
    ks_WQ_IMMEDIATE_CALL_PENDED = 0x80,
};

enum {
    ks_WORKQ_TR_FLAG_KEVENT = 1,
    ks_WORKQ_TR_FLAG_WORKLOOP = 2,
    ks_WORKQ_TR_FLAG_OVERCOMMIT = 4,
    ks_WORKQ_TR_FLAG_WL_PARAMS = 8,
    ks_WORKQ_TR_FLAG_WL_OUTSIDE_QOS = 0x10,
    ks_WORKQ_TR_FLAG_COOPERATIVE = 0x20,
    ks_WORKQ_TR_FLAG_PERMANENT_BIND = 0x40,
};

enum {
    ks_WORKQ_TR_STATE_IDLE = 0,
    ks_WORKQ_TR_STATE_NEW = 1,
    ks_WORKQ_TR_STATE_QUEUED = 2,
    ks_WORKQ_TR_STATE_CANCELED = 3,
    ks_WORKQ_TR_STATE_BINDING = 4,
    ks_WORKQ_TR_STATE_BOUND = 5,
};

/* refs: 1 */
struct ks_CEAccelerationContext {
    struct ks_CEAccelerationElement *index;
    unsigned long index_count;
};
_Static_assert(offsetof(struct ks_CEAccelerationContext, index) == 0x0, "ks_CEAccelerationContext.index offset");
_Static_assert(offsetof(struct ks_CEAccelerationContext, index_count) == 0x8, "ks_CEAccelerationContext.index_count offset");
_Static_assert(sizeof(struct ks_CEAccelerationContext) == 0x10, "ks_CEAccelerationContext size");

/* refs: 2 */
struct ks_ccder_read_blob {
    unsigned char *der;
    unsigned char *der_end;
};
_Static_assert(offsetof(struct ks_ccder_read_blob, der) == 0x0, "ks_ccder_read_blob.der offset");
_Static_assert(offsetof(struct ks_ccder_read_blob, der_end) == 0x8, "ks_ccder_read_blob.der_end offset");
_Static_assert(sizeof(struct ks_ccder_read_blob) == 0x10, "ks_ccder_read_blob size");

/* refs: 2 */
struct ks_der_vm_context {
    const struct ks_CERuntime *runtime;
    struct ks_CEAccelerationContext lookup;
    unsigned long dictionary_tag;
    _Bool sorted;
    _Bool valid;
    struct ks_ccder_read_blob ccstate;
};
_Static_assert(offsetof(struct ks_der_vm_context, runtime) == 0x0, "ks_der_vm_context.runtime offset");
_Static_assert(offsetof(struct ks_der_vm_context, lookup) == 0x8, "ks_der_vm_context.lookup offset");
_Static_assert(offsetof(struct ks_der_vm_context, dictionary_tag) == 0x18, "ks_der_vm_context.dictionary_tag offset");
_Static_assert(offsetof(struct ks_der_vm_context, sorted) == 0x20, "ks_der_vm_context.sorted offset");
_Static_assert(offsetof(struct ks_der_vm_context, valid) == 0x21, "ks_der_vm_context.valid offset");
_Static_assert(offsetof(struct ks_der_vm_context, ccstate) == 0x28, "ks_der_vm_context.ccstate offset");
_Static_assert(sizeof(struct ks_der_vm_context) == 0x38, "ks_der_vm_context size");

/* refs: 1 */
struct ks_CEQueryContext {
    struct ks_der_vm_context der_context;
    _Bool managed;
};
_Static_assert(offsetof(struct ks_CEQueryContext, der_context) == 0x0, "ks_CEQueryContext.der_context offset");
_Static_assert(offsetof(struct ks_CEQueryContext, managed) == 0x38, "ks_CEQueryContext.managed offset");
_Static_assert(sizeof(struct ks_CEQueryContext) == 0x40, "ks_CEQueryContext size");

/* refs: 4 */
struct ks_CERuntime {
    unsigned long long version;
    void **alloc;
    void *free;
    void *log;
    void *abort;
    _Bool *internalStatus;
    void **allocIndex;
    void *freeIndex;
};
_Static_assert(offsetof(struct ks_CERuntime, version) == 0x0, "ks_CERuntime.version offset");
_Static_assert(offsetof(struct ks_CERuntime, alloc) == 0x8, "ks_CERuntime.alloc offset");
_Static_assert(offsetof(struct ks_CERuntime, free) == 0x10, "ks_CERuntime.free offset");
_Static_assert(offsetof(struct ks_CERuntime, log) == 0x18, "ks_CERuntime.log offset");
_Static_assert(offsetof(struct ks_CERuntime, abort) == 0x20, "ks_CERuntime.abort offset");
_Static_assert(offsetof(struct ks_CERuntime, internalStatus) == 0x28, "ks_CERuntime.internalStatus offset");
_Static_assert(offsetof(struct ks_CERuntime, allocIndex) == 0x30, "ks_CERuntime.allocIndex offset");
_Static_assert(offsetof(struct ks_CERuntime, freeIndex) == 0x38, "ks_CERuntime.freeIndex offset");
_Static_assert(sizeof(struct ks_CERuntime) == 0x40, "ks_CERuntime size");

/* refs: 1 */
struct ks_IOSKArena {
};

/* refs: 2 */
struct ks_IOSKMemoryBufferSpec {
    int user_writable;
    int kernel_writable;
    int iodir_in;
    int iodir_out;
    int purgeable;
    int inhibitCache;
    int physcontig;
    int puredata;
    int threadSafe;
    int memtag;
};
_Static_assert(offsetof(struct ks_IOSKMemoryBufferSpec, user_writable) == 0x0, "ks_IOSKMemoryBufferSpec.user_writable offset");
_Static_assert(offsetof(struct ks_IOSKMemoryBufferSpec, kernel_writable) == 0x4, "ks_IOSKMemoryBufferSpec.kernel_writable offset");
_Static_assert(offsetof(struct ks_IOSKMemoryBufferSpec, iodir_in) == 0x8, "ks_IOSKMemoryBufferSpec.iodir_in offset");
_Static_assert(offsetof(struct ks_IOSKMemoryBufferSpec, iodir_out) == 0xC, "ks_IOSKMemoryBufferSpec.iodir_out offset");
_Static_assert(offsetof(struct ks_IOSKMemoryBufferSpec, purgeable) == 0x10, "ks_IOSKMemoryBufferSpec.purgeable offset");
_Static_assert(offsetof(struct ks_IOSKMemoryBufferSpec, inhibitCache) == 0x14, "ks_IOSKMemoryBufferSpec.inhibitCache offset");
_Static_assert(offsetof(struct ks_IOSKMemoryBufferSpec, physcontig) == 0x18, "ks_IOSKMemoryBufferSpec.physcontig offset");
_Static_assert(offsetof(struct ks_IOSKMemoryBufferSpec, puredata) == 0x1C, "ks_IOSKMemoryBufferSpec.puredata offset");
_Static_assert(offsetof(struct ks_IOSKMemoryBufferSpec, threadSafe) == 0x20, "ks_IOSKMemoryBufferSpec.threadSafe offset");
_Static_assert(offsetof(struct ks_IOSKMemoryBufferSpec, memtag) == 0x24, "ks_IOSKMemoryBufferSpec.memtag offset");
_Static_assert(sizeof(struct ks_IOSKMemoryBufferSpec) == 0x28, "ks_IOSKMemoryBufferSpec size");

/* refs: 2 */
struct ks_IOSKRegionSpec {
    int noRedirect;
};
_Static_assert(offsetof(struct ks_IOSKRegionSpec, noRedirect) == 0x0, "ks_IOSKRegionSpec.noRedirect offset");
_Static_assert(sizeof(struct ks_IOSKRegionSpec) == 0x4, "ks_IOSKRegionSpec size");

/* refs: 2 */
struct ks__CEContextInfo {
    unsigned char type;
    unsigned int version;
};
_Static_assert(offsetof(struct ks__CEContextInfo, type) == 0x0, "ks__CEContextInfo.type offset");
_Static_assert(offsetof(struct ks__CEContextInfo, version) == 0x4, "ks__CEContextInfo.version offset");
_Static_assert(sizeof(struct ks__CEContextInfo) == 0x8, "ks__CEContextInfo size");

/* refs: 7 */
struct ks__CEContext {
    struct ks__CEContextInfo info;
    struct ks_CEQueryContext legacyContext;
};
_Static_assert(offsetof(struct ks__CEContext, info) == 0x0, "ks__CEContext.info offset");
_Static_assert(offsetof(struct ks__CEContext, legacyContext) == 0x8, "ks__CEContext.legacyContext offset");
_Static_assert(sizeof(struct ks__CEContext) == 0x48, "ks__CEContext size");

/* refs: 2 */
struct ks__CMSValidation {
    unsigned char *cmsData;
    unsigned long cmsDataSize;
    unsigned char *cmsLeafCert;
    unsigned long cmsLeafCertSize;
    unsigned char *cmsContent;
    unsigned long cmsContentSize;
    unsigned int agilityHashType;
    unsigned char *agilityHash;
    unsigned long agilityHashSize;
    unsigned int digestType;
    unsigned long long policyFlags;
    _Bool cmsInitialized;
    _Bool cmsVerified;
    _Bool allowDebuggingRoots;
};
_Static_assert(offsetof(struct ks__CMSValidation, cmsData) == 0x0, "ks__CMSValidation.cmsData offset");
_Static_assert(offsetof(struct ks__CMSValidation, cmsDataSize) == 0x8, "ks__CMSValidation.cmsDataSize offset");
_Static_assert(offsetof(struct ks__CMSValidation, cmsLeafCert) == 0x10, "ks__CMSValidation.cmsLeafCert offset");
_Static_assert(offsetof(struct ks__CMSValidation, cmsLeafCertSize) == 0x18, "ks__CMSValidation.cmsLeafCertSize offset");
_Static_assert(offsetof(struct ks__CMSValidation, cmsContent) == 0x20, "ks__CMSValidation.cmsContent offset");
_Static_assert(offsetof(struct ks__CMSValidation, cmsContentSize) == 0x28, "ks__CMSValidation.cmsContentSize offset");
_Static_assert(offsetof(struct ks__CMSValidation, agilityHashType) == 0x30, "ks__CMSValidation.agilityHashType offset");
_Static_assert(offsetof(struct ks__CMSValidation, agilityHash) == 0x38, "ks__CMSValidation.agilityHash offset");
_Static_assert(offsetof(struct ks__CMSValidation, agilityHashSize) == 0x40, "ks__CMSValidation.agilityHashSize offset");
_Static_assert(offsetof(struct ks__CMSValidation, digestType) == 0x48, "ks__CMSValidation.digestType offset");
_Static_assert(offsetof(struct ks__CMSValidation, policyFlags) == 0x50, "ks__CMSValidation.policyFlags offset");
_Static_assert(offsetof(struct ks__CMSValidation, cmsInitialized) == 0x58, "ks__CMSValidation.cmsInitialized offset");
_Static_assert(offsetof(struct ks__CMSValidation, cmsVerified) == 0x59, "ks__CMSValidation.cmsVerified offset");
_Static_assert(offsetof(struct ks__CMSValidation, allowDebuggingRoots) == 0x5A, "ks__CMSValidation.allowDebuggingRoots offset");
_Static_assert(sizeof(struct ks__CMSValidation) == 0x60, "ks__CMSValidation size");

/* refs: 4 */
struct ks__CSBuffer {
    unsigned char *data;
    unsigned long dataSize;
};
_Static_assert(offsetof(struct ks__CSBuffer, data) == 0x0, "ks__CSBuffer.data offset");
_Static_assert(offsetof(struct ks__CSBuffer, dataSize) == 0x8, "ks__CSBuffer.dataSize offset");
_Static_assert(sizeof(struct ks__CSBuffer) == 0x10, "ks__CSBuffer size");

/* refs: 2 */
struct ks__CSCodeDirectory {
    unsigned int magic;
    unsigned int length;
    unsigned int version;
    unsigned int flags;
    unsigned int hashesOffset;
    unsigned int signingIdentifierOffset;
    unsigned int numSpecialSlots;
    unsigned int numCodeSlots;
    unsigned int codeLimit;
    unsigned char hashSize;
    unsigned char hashType;
    unsigned char platformIdentifier;
    unsigned char pageShift;
    unsigned int spare0;
};
_Static_assert(offsetof(struct ks__CSCodeDirectory, magic) == 0x0, "ks__CSCodeDirectory.magic offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, length) == 0x4, "ks__CSCodeDirectory.length offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, version) == 0x8, "ks__CSCodeDirectory.version offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, flags) == 0xC, "ks__CSCodeDirectory.flags offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, hashesOffset) == 0x10, "ks__CSCodeDirectory.hashesOffset offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, signingIdentifierOffset) == 0x14, "ks__CSCodeDirectory.signingIdentifierOffset offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, numSpecialSlots) == 0x18, "ks__CSCodeDirectory.numSpecialSlots offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, numCodeSlots) == 0x1C, "ks__CSCodeDirectory.numCodeSlots offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, codeLimit) == 0x20, "ks__CSCodeDirectory.codeLimit offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, hashSize) == 0x24, "ks__CSCodeDirectory.hashSize offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, hashType) == 0x25, "ks__CSCodeDirectory.hashType offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, platformIdentifier) == 0x26, "ks__CSCodeDirectory.platformIdentifier offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, pageShift) == 0x27, "ks__CSCodeDirectory.pageShift offset");
_Static_assert(offsetof(struct ks__CSCodeDirectory, spare0) == 0x28, "ks__CSCodeDirectory.spare0 offset");
_Static_assert(sizeof(struct ks__CSCodeDirectory) == 0x2C, "ks__CSCodeDirectory size");

/* refs: 2 */
struct ks__CSCodeDirectorySafe {
    struct ks__CSCodeDirectory *data;
    unsigned int dataSize;
};
_Static_assert(offsetof(struct ks__CSCodeDirectorySafe, data) == 0x0, "ks__CSCodeDirectorySafe.data offset");
_Static_assert(offsetof(struct ks__CSCodeDirectorySafe, dataSize) == 0x8, "ks__CSCodeDirectorySafe.dataSize offset");
_Static_assert(sizeof(struct ks__CSCodeDirectorySafe) == 0x10, "ks__CSCodeDirectorySafe size");

/* refs: 2 */
struct ks__CSConfigCallerSignature {
    struct ks__SignatureValidation **acquireSig;
    void *releaseSig;
};
_Static_assert(offsetof(struct ks__CSConfigCallerSignature, acquireSig) == 0x0, "ks__CSConfigCallerSignature.acquireSig offset");
_Static_assert(offsetof(struct ks__CSConfigCallerSignature, releaseSig) == 0x8, "ks__CSConfigCallerSignature.releaseSig offset");
_Static_assert(sizeof(struct ks__CSConfigCallerSignature) == 0x10, "ks__CSConfigCallerSignature size");

/* refs: 2 */
struct ks__CSConfigCompilationService {
    _Bool *matchCDHash;
};
_Static_assert(offsetof(struct ks__CSConfigCompilationService, matchCDHash) == 0x0, "ks__CSConfigCompilationService.matchCDHash offset");
_Static_assert(sizeof(struct ks__CSConfigCompilationService) == 0x8, "ks__CSConfigCompilationService size");

/* refs: 2 */
struct ks__CSConfigEnvironmentState {
    _Bool *developerMode;
    _Bool *demoMode;
    _Bool *lockdownMode;
    _Bool *researchMode;
    _Bool *extendedResearchMode;
};
_Static_assert(offsetof(struct ks__CSConfigEnvironmentState, developerMode) == 0x0, "ks__CSConfigEnvironmentState.developerMode offset");
_Static_assert(offsetof(struct ks__CSConfigEnvironmentState, demoMode) == 0x8, "ks__CSConfigEnvironmentState.demoMode offset");
_Static_assert(offsetof(struct ks__CSConfigEnvironmentState, lockdownMode) == 0x10, "ks__CSConfigEnvironmentState.lockdownMode offset");
_Static_assert(offsetof(struct ks__CSConfigEnvironmentState, researchMode) == 0x18, "ks__CSConfigEnvironmentState.researchMode offset");
_Static_assert(offsetof(struct ks__CSConfigEnvironmentState, extendedResearchMode) == 0x20, "ks__CSConfigEnvironmentState.extendedResearchMode offset");
_Static_assert(sizeof(struct ks__CSConfigEnvironmentState) == 0x28, "ks__CSConfigEnvironmentState size");

/* refs: 2 */
struct ks__CSConfigLocalSigning {
    struct ks__CSBuffer *getPublicKey;
    _Bool *matchAuthentication;
    struct ks__CEContext *allowedEntitlementsSet;
};
_Static_assert(offsetof(struct ks__CSConfigLocalSigning, getPublicKey) == 0x0, "ks__CSConfigLocalSigning.getPublicKey offset");
_Static_assert(offsetof(struct ks__CSConfigLocalSigning, matchAuthentication) == 0x8, "ks__CSConfigLocalSigning.matchAuthentication offset");
_Static_assert(offsetof(struct ks__CSConfigLocalSigning, allowedEntitlementsSet) == 0x10, "ks__CSConfigLocalSigning.allowedEntitlementsSet offset");
_Static_assert(sizeof(struct ks__CSConfigLocalSigning) == 0x18, "ks__CSConfigLocalSigning size");

/* refs: 2 */
struct ks__CSConfigProvisioningProfiles {
    char deviceUDID[0x30];
    _Bool *auxiliaryValidate;
};
_Static_assert(offsetof(struct ks__CSConfigProvisioningProfiles, deviceUDID) == 0x0, "ks__CSConfigProvisioningProfiles.deviceUDID offset");
_Static_assert(offsetof(struct ks__CSConfigProvisioningProfiles, auxiliaryValidate) == 0x30, "ks__CSConfigProvisioningProfiles.auxiliaryValidate offset");
_Static_assert(sizeof(struct ks__CSConfigProvisioningProfiles) == 0x38, "ks__CSConfigProvisioningProfiles size");

/* refs: 2 */
struct ks__CSConfigTrustCaches {
    struct ks__TCReturn *queryCDHash;
    struct ks__TCReturn *queryCDHashForREM;
    _Bool queryTokenSupported;
};
_Static_assert(offsetof(struct ks__CSConfigTrustCaches, queryCDHash) == 0x0, "ks__CSConfigTrustCaches.queryCDHash offset");
_Static_assert(offsetof(struct ks__CSConfigTrustCaches, queryCDHashForREM) == 0x8, "ks__CSConfigTrustCaches.queryCDHashForREM offset");
_Static_assert(offsetof(struct ks__CSConfigTrustCaches, queryTokenSupported) == 0x10, "ks__CSConfigTrustCaches.queryTokenSupported offset");
_Static_assert(sizeof(struct ks__CSConfigTrustCaches) == 0x18, "ks__CSConfigTrustCaches size");

/* refs: 3 */
struct ks__CSConfig {
    struct ks__CSConfigOSPolicy *systemPolicy;
    _Bool *platformCodeOnly;
    struct ks_CERuntime *entitlementsRuntime;
    struct ks__CSConfigTrustCaches trustCaches;
    struct ks__CSConfigProvisioningProfiles provisioningProfiles;
    struct ks__CSConfigLocalSigning localSigning;
    struct ks__CSConfigCompilationService compilationService;
    struct ks__CSConfigCallerSignature callerSignature;
    struct ks__CSConfigEnvironmentState environmentState;
    struct ks__CSMutableBuffer *getMutableBuffer;
    struct {
        _Bool skipTrustEvaluation;
        _Bool allowAnySignature;
        _Bool allowUnrestrictedLocalSigning;
        _Bool allowInternalCAs;
        _Bool enforceCoreTrust;
        _Bool relaxRestrictedModePerms;
        _Bool relaxProfileTrust;
    } exemptions;
};
_Static_assert(offsetof(struct ks__CSConfig, systemPolicy) == 0x0, "ks__CSConfig.systemPolicy offset");
_Static_assert(offsetof(struct ks__CSConfig, platformCodeOnly) == 0x8, "ks__CSConfig.platformCodeOnly offset");
_Static_assert(offsetof(struct ks__CSConfig, entitlementsRuntime) == 0x10, "ks__CSConfig.entitlementsRuntime offset");
_Static_assert(offsetof(struct ks__CSConfig, trustCaches) == 0x18, "ks__CSConfig.trustCaches offset");
_Static_assert(offsetof(struct ks__CSConfig, provisioningProfiles) == 0x30, "ks__CSConfig.provisioningProfiles offset");
_Static_assert(offsetof(struct ks__CSConfig, localSigning) == 0x68, "ks__CSConfig.localSigning offset");
_Static_assert(offsetof(struct ks__CSConfig, compilationService) == 0x80, "ks__CSConfig.compilationService offset");
_Static_assert(offsetof(struct ks__CSConfig, callerSignature) == 0x88, "ks__CSConfig.callerSignature offset");
_Static_assert(offsetof(struct ks__CSConfig, environmentState) == 0x98, "ks__CSConfig.environmentState offset");
_Static_assert(offsetof(struct ks__CSConfig, getMutableBuffer) == 0xC0, "ks__CSConfig.getMutableBuffer offset");
_Static_assert(offsetof(struct ks__CSConfig, exemptions) == 0xC8, "ks__CSConfig.exemptions offset");
_Static_assert(sizeof(struct ks__CSConfig) == 0xD0, "ks__CSConfig size");

/* refs: 2 */
struct ks__CSConfigFeatureSet {
    _Bool restrictedExecutionMode;
    _Bool OOPJit;
    _Bool localSigning;
    _Bool compilationService;
    _Bool appleInternalProfiles;
    _Bool developerMode;
    _Bool demoMode;
    _Bool JIT;
    _Bool executableCommPage;
};
_Static_assert(offsetof(struct ks__CSConfigFeatureSet, restrictedExecutionMode) == 0x0, "ks__CSConfigFeatureSet.restrictedExecutionMode offset");
_Static_assert(offsetof(struct ks__CSConfigFeatureSet, OOPJit) == 0x1, "ks__CSConfigFeatureSet.OOPJit offset");
_Static_assert(offsetof(struct ks__CSConfigFeatureSet, localSigning) == 0x2, "ks__CSConfigFeatureSet.localSigning offset");
_Static_assert(offsetof(struct ks__CSConfigFeatureSet, compilationService) == 0x3, "ks__CSConfigFeatureSet.compilationService offset");
_Static_assert(offsetof(struct ks__CSConfigFeatureSet, appleInternalProfiles) == 0x4, "ks__CSConfigFeatureSet.appleInternalProfiles offset");
_Static_assert(offsetof(struct ks__CSConfigFeatureSet, developerMode) == 0x5, "ks__CSConfigFeatureSet.developerMode offset");
_Static_assert(offsetof(struct ks__CSConfigFeatureSet, demoMode) == 0x6, "ks__CSConfigFeatureSet.demoMode offset");
_Static_assert(offsetof(struct ks__CSConfigFeatureSet, JIT) == 0x7, "ks__CSConfigFeatureSet.JIT offset");
_Static_assert(offsetof(struct ks__CSConfigFeatureSet, executableCommPage) == 0x8, "ks__CSConfigFeatureSet.executableCommPage offset");
_Static_assert(sizeof(struct ks__CSConfigFeatureSet) == 0x9, "ks__CSConfigFeatureSet size");

/* refs: 2 */
struct ks__CSConfigOSPolicy {
    unsigned int minimumCodeDirectoryVersion;
    unsigned char minimumHashTypeForPlatformCode;
    _Bool trustCacheCodeOnly;
    _Bool platformCodeOnly;
    unsigned long long platformCTFlags;
    unsigned long long appStoreCTFlags;
    unsigned long long profileValidatedCTFlags;
    unsigned long long appStoreQACTFlags;
    unsigned long long profileValidatedQACTFlags;
    unsigned long long platformQACTFlags;
    unsigned long long profileCTFlags;
    const char **developerLimit;
    struct ks__CSConfigFeatureSet featureSet;
    struct {
        const char *appContainerPath;
    } specialPaths;
};
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, minimumCodeDirectoryVersion) == 0x0, "ks__CSConfigOSPolicy.minimumCodeDirectoryVersion offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, minimumHashTypeForPlatformCode) == 0x4, "ks__CSConfigOSPolicy.minimumHashTypeForPlatformCode offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, trustCacheCodeOnly) == 0x5, "ks__CSConfigOSPolicy.trustCacheCodeOnly offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, platformCodeOnly) == 0x6, "ks__CSConfigOSPolicy.platformCodeOnly offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, platformCTFlags) == 0x8, "ks__CSConfigOSPolicy.platformCTFlags offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, appStoreCTFlags) == 0x10, "ks__CSConfigOSPolicy.appStoreCTFlags offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, profileValidatedCTFlags) == 0x18, "ks__CSConfigOSPolicy.profileValidatedCTFlags offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, appStoreQACTFlags) == 0x20, "ks__CSConfigOSPolicy.appStoreQACTFlags offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, profileValidatedQACTFlags) == 0x28, "ks__CSConfigOSPolicy.profileValidatedQACTFlags offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, platformQACTFlags) == 0x30, "ks__CSConfigOSPolicy.platformQACTFlags offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, profileCTFlags) == 0x38, "ks__CSConfigOSPolicy.profileCTFlags offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, developerLimit) == 0x40, "ks__CSConfigOSPolicy.developerLimit offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, featureSet) == 0x48, "ks__CSConfigOSPolicy.featureSet offset");
_Static_assert(offsetof(struct ks__CSConfigOSPolicy, specialPaths) == 0x58, "ks__CSConfigOSPolicy.specialPaths offset");
_Static_assert(sizeof(struct ks__CSConfigOSPolicy) == 0x60, "ks__CSConfigOSPolicy size");

/* refs: 2 */
struct ks__CSMutableBuffer {
    unsigned char *data;
    unsigned long dataSize;
};
_Static_assert(offsetof(struct ks__CSMutableBuffer, data) == 0x0, "ks__CSMutableBuffer.data offset");
_Static_assert(offsetof(struct ks__CSMutableBuffer, dataSize) == 0x8, "ks__CSMutableBuffer.dataSize offset");
_Static_assert(sizeof(struct ks__CSMutableBuffer) == 0x10, "ks__CSMutableBuffer size");

/* refs: 2 */
struct ks__CSProfileProperties {
    unsigned int developer : 1; /* bit offset 0 */
    unsigned int testFlight : 1; /* bit offset 1 */
    unsigned int universal : 1; /* bit offset 2 */
    unsigned int appleInternal : 1; /* bit offset 3 */
    unsigned int demoMode : 1; /* bit offset 4 */
    unsigned int appShack : 1; /* bit offset 5 */
    unsigned int internalBuild : 1; /* bit offset 6 */
    unsigned int noExecute : 1; /* bit offset 7 */
    unsigned int reserved : 23; /* bit offset 8 */
};
_Static_assert(sizeof(struct ks__CSProfileProperties) == 0x4, "ks__CSProfileProperties size");

/* refs: 2 */
struct ks__CSSuperBlobIndex {
    unsigned int type;
    unsigned int offset;
};
_Static_assert(offsetof(struct ks__CSSuperBlobIndex, type) == 0x0, "ks__CSSuperBlobIndex.type offset");
_Static_assert(offsetof(struct ks__CSSuperBlobIndex, offset) == 0x4, "ks__CSSuperBlobIndex.offset offset");
_Static_assert(sizeof(struct ks__CSSuperBlobIndex) == 0x8, "ks__CSSuperBlobIndex size");

/* refs: 2 */
struct ks__CSSuperBlob {
    unsigned int magic;
    unsigned int length;
    unsigned int count;
    struct ks__CSSuperBlobIndex index[0];
};
_Static_assert(offsetof(struct ks__CSSuperBlob, magic) == 0x0, "ks__CSSuperBlob.magic offset");
_Static_assert(offsetof(struct ks__CSSuperBlob, length) == 0x4, "ks__CSSuperBlob.length offset");
_Static_assert(offsetof(struct ks__CSSuperBlob, count) == 0x8, "ks__CSSuperBlob.count offset");
_Static_assert(offsetof(struct ks__CSSuperBlob, index) == 0xC, "ks__CSSuperBlob.index offset");
_Static_assert(sizeof(struct ks__CSSuperBlob) == 0xC, "ks__CSSuperBlob size");

/* refs: 2 */
struct ks__CSSuperBlobSafe {
    struct ks__CSSuperBlob *data;
    unsigned int dataSize;
};
_Static_assert(offsetof(struct ks__CSSuperBlobSafe, data) == 0x0, "ks__CSSuperBlobSafe.data offset");
_Static_assert(offsetof(struct ks__CSSuperBlobSafe, dataSize) == 0x8, "ks__CSSuperBlobSafe.dataSize offset");
_Static_assert(sizeof(struct ks__CSSuperBlobSafe) == 0x10, "ks__CSSuperBlobSafe size");

/* refs: 2 */
struct ks__ProfileValidation {
    struct ks__CSConfig *config;
    struct ks__CMSValidation profileCMS;
    struct ks__CEContext profileCtx;
    struct ks__CEContext entCtx;
    _Bool entInit;
    struct ks__CSProfileProperties properties __attribute__((aligned(4)));
    _Bool profileInitialized;
    _Bool profileVerified;
    _Bool profileTrusted;
};
_Static_assert(offsetof(struct ks__ProfileValidation, config) == 0x0, "ks__ProfileValidation.config offset");
_Static_assert(offsetof(struct ks__ProfileValidation, profileCMS) == 0x8, "ks__ProfileValidation.profileCMS offset");
_Static_assert(offsetof(struct ks__ProfileValidation, profileCtx) == 0x68, "ks__ProfileValidation.profileCtx offset");
_Static_assert(offsetof(struct ks__ProfileValidation, entCtx) == 0xB0, "ks__ProfileValidation.entCtx offset");
_Static_assert(offsetof(struct ks__ProfileValidation, entInit) == 0xF8, "ks__ProfileValidation.entInit offset");
_Static_assert(offsetof(struct ks__ProfileValidation, properties) == 0xFC, "ks__ProfileValidation.properties offset");
_Static_assert(offsetof(struct ks__ProfileValidation, profileInitialized) == 0x100, "ks__ProfileValidation.profileInitialized offset");
_Static_assert(offsetof(struct ks__ProfileValidation, profileVerified) == 0x101, "ks__ProfileValidation.profileVerified offset");
_Static_assert(offsetof(struct ks__ProfileValidation, profileTrusted) == 0x102, "ks__ProfileValidation.profileTrusted offset");
_Static_assert(sizeof(struct ks__ProfileValidation) == 0x108, "ks__ProfileValidation size");

/* refs: 3 */
struct ks__SignatureValidation {
    struct ks__CSConfig *config;
    struct ks__CSBuffer signatureBlob;
    struct ks__CSSuperBlobSafe superBlob;
    _Bool unusedBufferAllocated;
    _Bool signatureParsed;
    _Bool appContainerPath;
    struct ks__CSCodeDirectorySafe codeDirectory;
    unsigned char CDHash[0x14];
    struct ks__CEContext entCtx;
    _Bool entInit;
    unsigned char trustLevelInterim;
    unsigned char trustLevel;
    struct ks__ProfileValidation *profile;
    struct ks__CSBuffer leafCert;
};
_Static_assert(offsetof(struct ks__SignatureValidation, config) == 0x0, "ks__SignatureValidation.config offset");
_Static_assert(offsetof(struct ks__SignatureValidation, signatureBlob) == 0x8, "ks__SignatureValidation.signatureBlob offset");
_Static_assert(offsetof(struct ks__SignatureValidation, superBlob) == 0x18, "ks__SignatureValidation.superBlob offset");
_Static_assert(offsetof(struct ks__SignatureValidation, unusedBufferAllocated) == 0x28, "ks__SignatureValidation.unusedBufferAllocated offset");
_Static_assert(offsetof(struct ks__SignatureValidation, signatureParsed) == 0x29, "ks__SignatureValidation.signatureParsed offset");
_Static_assert(offsetof(struct ks__SignatureValidation, appContainerPath) == 0x2A, "ks__SignatureValidation.appContainerPath offset");
_Static_assert(offsetof(struct ks__SignatureValidation, codeDirectory) == 0x30, "ks__SignatureValidation.codeDirectory offset");
_Static_assert(offsetof(struct ks__SignatureValidation, CDHash) == 0x40, "ks__SignatureValidation.CDHash offset");
_Static_assert(offsetof(struct ks__SignatureValidation, entCtx) == 0x58, "ks__SignatureValidation.entCtx offset");
_Static_assert(offsetof(struct ks__SignatureValidation, entInit) == 0xA0, "ks__SignatureValidation.entInit offset");
_Static_assert(offsetof(struct ks__SignatureValidation, trustLevelInterim) == 0xA1, "ks__SignatureValidation.trustLevelInterim offset");
_Static_assert(offsetof(struct ks__SignatureValidation, trustLevel) == 0xA2, "ks__SignatureValidation.trustLevel offset");
_Static_assert(offsetof(struct ks__SignatureValidation, profile) == 0xA8, "ks__SignatureValidation.profile offset");
_Static_assert(offsetof(struct ks__SignatureValidation, leafCert) == 0xB0, "ks__SignatureValidation.leafCert offset");
_Static_assert(sizeof(struct ks__SignatureValidation) == 0xC0, "ks__SignatureValidation size");

/* refs: 3 */
struct ks__TCReturn {
    union {
        unsigned int rawValue;
        struct {
            unsigned char component;
            unsigned char error;
            unsigned short uniqueError;
        };
    };
};
_Static_assert(sizeof(struct ks__TCReturn) == 0x4, "ks__TCReturn size");

/* refs: 2 */
struct ks__TXMAddressSpaceID {
    unsigned short identifier;
    unsigned short type;
};
_Static_assert(offsetof(struct ks__TXMAddressSpaceID, identifier) == 0x0, "ks__TXMAddressSpaceID.identifier offset");
_Static_assert(offsetof(struct ks__TXMAddressSpaceID, type) == 0x2, "ks__TXMAddressSpaceID.type offset");
_Static_assert(sizeof(struct ks__TXMAddressSpaceID) == 0x4, "ks__TXMAddressSpaceID size");

/* refs: 2 */
struct ks__TXMCodeRegionRBTree {
    struct ks__TXMCodeRegion *rbh_root;
};
_Static_assert(offsetof(struct ks__TXMCodeRegionRBTree, rbh_root) == 0x0, "ks__TXMCodeRegionRBTree.rbh_root offset");
_Static_assert(sizeof(struct ks__TXMCodeRegionRBTree) == 0x8, "ks__TXMCodeRegionRBTree size");

/* refs: 2 */
struct ks__TXMTaggedPointer {
    union {
        unsigned __int128 raw;
        struct {
            unsigned long tag;
            unsigned long addr;
        };
    };
};
_Static_assert(sizeof(struct ks__TXMTaggedPointer) == 0x10, "ks__TXMTaggedPointer size");

/* refs: 4 */
struct ks__TXMSlabObject {
    struct ks__TXMTaggedPointer objectLink;
    unsigned char objectLock;
    _Bool objectActive;
} __attribute__((packed));
_Static_assert(offsetof(struct ks__TXMSlabObject, objectLink) == 0x0, "ks__TXMSlabObject.objectLink offset");
_Static_assert(offsetof(struct ks__TXMSlabObject, objectLock) == 0x10, "ks__TXMSlabObject.objectLock offset");
_Static_assert(offsetof(struct ks__TXMSlabObject, objectActive) == 0x11, "ks__TXMSlabObject.objectActive offset");
_Static_assert(sizeof(struct ks__TXMSlabObject) == 0x12, "ks__TXMSlabObject size");

/* refs: 3 */
struct ks__TXMAddressSpace {
    struct ks__TXMSlabObject slabObject;
    unsigned long long addrSpaceFlags;
    unsigned char remPerms;
    struct ks__TXMAddressSpaceID addrSpaceID;
    struct ks__TXMCodeRegionRBTree codeRegions;
    struct {
        _Atomic _Bool allowsInvalidCode;
        struct ks__TXMCodeRegion *sharedCacheRegionAllocation;
        struct ks__TXMCodeRegion *mainRegion;
        struct ks__TXMCodeRegion *sharedCacheRegion;
        struct ks__TXMCodeRegion *jitRegion;
    };
    struct {
        unsigned long baseAddr;
        unsigned long baseAddrEnd;
        unsigned int referenceCount;
    };
};
_Static_assert(offsetof(struct ks__TXMAddressSpace, slabObject) == 0x0, "ks__TXMAddressSpace.slabObject offset");
_Static_assert(offsetof(struct ks__TXMAddressSpace, addrSpaceFlags) == 0x18, "ks__TXMAddressSpace.addrSpaceFlags offset");
_Static_assert(offsetof(struct ks__TXMAddressSpace, remPerms) == 0x20, "ks__TXMAddressSpace.remPerms offset");
_Static_assert(offsetof(struct ks__TXMAddressSpace, addrSpaceID) == 0x22, "ks__TXMAddressSpace.addrSpaceID offset");
_Static_assert(offsetof(struct ks__TXMAddressSpace, codeRegions) == 0x28, "ks__TXMAddressSpace.codeRegions offset");
_Static_assert(sizeof(struct ks__TXMAddressSpace) == 0x70, "ks__TXMAddressSpace size");

/* refs: 9 */
struct ks__TXMCodeRegion {
    struct ks__TXMSlabObject slabObject;
    struct {
        unsigned char type : 7; /* bit offset 0 */
        unsigned char debugged : 1; /* bit offset 7 */
    } properties;
    union {
        struct {
            unsigned long offsetInFile;
            struct ks__TXMCodeSignature *codeSignature;
        } executable;
        struct {
            struct ks__TXMAddressSpace *nestedSpace;
        } sharedCache;
    };
    unsigned long addr;
    unsigned long addrEnd;
    struct {
        struct ks__TXMCodeRegion *rbe_left;
        struct ks__TXMCodeRegion *rbe_right;
        struct ks__TXMCodeRegion *rbe_parent;
    } RBLink;
};
_Static_assert(offsetof(struct ks__TXMCodeRegion, slabObject) == 0x0, "ks__TXMCodeRegion.slabObject offset");
_Static_assert(offsetof(struct ks__TXMCodeRegion, properties) == 0x12, "ks__TXMCodeRegion.properties offset");
_Static_assert(offsetof(struct ks__TXMCodeRegion, addr) == 0x28, "ks__TXMCodeRegion.addr offset");
_Static_assert(offsetof(struct ks__TXMCodeRegion, addrEnd) == 0x30, "ks__TXMCodeRegion.addrEnd offset");
_Static_assert(offsetof(struct ks__TXMCodeRegion, RBLink) == 0x38, "ks__TXMCodeRegion.RBLink offset");
_Static_assert(sizeof(struct ks__TXMCodeRegion) == 0x50, "ks__TXMCodeRegion size");

/* refs: 2 */
struct ks__TXMCodeSignature {
    struct ks__TXMSlabObject slabObject;
    unsigned char sptmType;
    unsigned int referenceCount;
    _Bool reconstituted;
    const void *kernelEntitlements;
    struct ks__SignatureValidation sig;
};
_Static_assert(offsetof(struct ks__TXMCodeSignature, slabObject) == 0x0, "ks__TXMCodeSignature.slabObject offset");
_Static_assert(offsetof(struct ks__TXMCodeSignature, sptmType) == 0x12, "ks__TXMCodeSignature.sptmType offset");
_Static_assert(offsetof(struct ks__TXMCodeSignature, referenceCount) == 0x14, "ks__TXMCodeSignature.referenceCount offset");
_Static_assert(offsetof(struct ks__TXMCodeSignature, reconstituted) == 0x18, "ks__TXMCodeSignature.reconstituted offset");
_Static_assert(offsetof(struct ks__TXMCodeSignature, kernelEntitlements) == 0x20, "ks__TXMCodeSignature.kernelEntitlements offset");
_Static_assert(offsetof(struct ks__TXMCodeSignature, sig) == 0x28, "ks__TXMCodeSignature.sig offset");
_Static_assert(sizeof(struct ks__TXMCodeSignature) == 0xE8, "ks__TXMCodeSignature size");

/* refs: 2 */
struct ks___CodeDirectory {
    unsigned int magic;
    unsigned int length;
    unsigned int version;
    unsigned int flags;
    unsigned int hashOffset;
    unsigned int identOffset;
    unsigned int nSpecialSlots;
    unsigned int nCodeSlots;
    unsigned int codeLimit;
    unsigned char hashSize;
    unsigned char hashType;
    unsigned char platform;
    unsigned char pageSize;
    unsigned int spare2;
    char end_earliest[0];
    unsigned int scatterOffset;
    char end_withScatter[0];
    unsigned int teamOffset;
    char end_withTeam[0];
    unsigned int spare3;
    unsigned long long codeLimit64;
    char end_withCodeLimit64[0];
    unsigned long long execSegBase;
    unsigned long long execSegLimit;
    unsigned long long execSegFlags;
    char end_withExecSeg[0];
    unsigned int runtime;
    unsigned int preEncryptOffset;
    char end_withPreEncryptOffset[0];
    unsigned char linkageHashType;
    unsigned char linkageApplicationType;
    unsigned short linkageApplicationSubType;
    unsigned int linkageOffset;
    unsigned int linkageSize;
    char end_withLinkage[0];
};
_Static_assert(offsetof(struct ks___CodeDirectory, magic) == 0x0, "ks___CodeDirectory.magic offset");
_Static_assert(offsetof(struct ks___CodeDirectory, length) == 0x4, "ks___CodeDirectory.length offset");
_Static_assert(offsetof(struct ks___CodeDirectory, version) == 0x8, "ks___CodeDirectory.version offset");
_Static_assert(offsetof(struct ks___CodeDirectory, flags) == 0xC, "ks___CodeDirectory.flags offset");
_Static_assert(offsetof(struct ks___CodeDirectory, hashOffset) == 0x10, "ks___CodeDirectory.hashOffset offset");
_Static_assert(offsetof(struct ks___CodeDirectory, identOffset) == 0x14, "ks___CodeDirectory.identOffset offset");
_Static_assert(offsetof(struct ks___CodeDirectory, nSpecialSlots) == 0x18, "ks___CodeDirectory.nSpecialSlots offset");
_Static_assert(offsetof(struct ks___CodeDirectory, nCodeSlots) == 0x1C, "ks___CodeDirectory.nCodeSlots offset");
_Static_assert(offsetof(struct ks___CodeDirectory, codeLimit) == 0x20, "ks___CodeDirectory.codeLimit offset");
_Static_assert(offsetof(struct ks___CodeDirectory, hashSize) == 0x24, "ks___CodeDirectory.hashSize offset");
_Static_assert(offsetof(struct ks___CodeDirectory, hashType) == 0x25, "ks___CodeDirectory.hashType offset");
_Static_assert(offsetof(struct ks___CodeDirectory, platform) == 0x26, "ks___CodeDirectory.platform offset");
_Static_assert(offsetof(struct ks___CodeDirectory, pageSize) == 0x27, "ks___CodeDirectory.pageSize offset");
_Static_assert(offsetof(struct ks___CodeDirectory, spare2) == 0x28, "ks___CodeDirectory.spare2 offset");
_Static_assert(offsetof(struct ks___CodeDirectory, end_earliest) == 0x2C, "ks___CodeDirectory.end_earliest offset");
_Static_assert(offsetof(struct ks___CodeDirectory, scatterOffset) == 0x2C, "ks___CodeDirectory.scatterOffset offset");
_Static_assert(offsetof(struct ks___CodeDirectory, end_withScatter) == 0x30, "ks___CodeDirectory.end_withScatter offset");
_Static_assert(offsetof(struct ks___CodeDirectory, teamOffset) == 0x30, "ks___CodeDirectory.teamOffset offset");
_Static_assert(offsetof(struct ks___CodeDirectory, end_withTeam) == 0x34, "ks___CodeDirectory.end_withTeam offset");
_Static_assert(offsetof(struct ks___CodeDirectory, spare3) == 0x34, "ks___CodeDirectory.spare3 offset");
_Static_assert(offsetof(struct ks___CodeDirectory, codeLimit64) == 0x38, "ks___CodeDirectory.codeLimit64 offset");
_Static_assert(offsetof(struct ks___CodeDirectory, end_withCodeLimit64) == 0x40, "ks___CodeDirectory.end_withCodeLimit64 offset");
_Static_assert(offsetof(struct ks___CodeDirectory, execSegBase) == 0x40, "ks___CodeDirectory.execSegBase offset");
_Static_assert(offsetof(struct ks___CodeDirectory, execSegLimit) == 0x48, "ks___CodeDirectory.execSegLimit offset");
_Static_assert(offsetof(struct ks___CodeDirectory, execSegFlags) == 0x50, "ks___CodeDirectory.execSegFlags offset");
_Static_assert(offsetof(struct ks___CodeDirectory, end_withExecSeg) == 0x58, "ks___CodeDirectory.end_withExecSeg offset");
_Static_assert(offsetof(struct ks___CodeDirectory, runtime) == 0x58, "ks___CodeDirectory.runtime offset");
_Static_assert(offsetof(struct ks___CodeDirectory, preEncryptOffset) == 0x5C, "ks___CodeDirectory.preEncryptOffset offset");
_Static_assert(offsetof(struct ks___CodeDirectory, end_withPreEncryptOffset) == 0x60, "ks___CodeDirectory.end_withPreEncryptOffset offset");
_Static_assert(offsetof(struct ks___CodeDirectory, linkageHashType) == 0x60, "ks___CodeDirectory.linkageHashType offset");
_Static_assert(offsetof(struct ks___CodeDirectory, linkageApplicationType) == 0x61, "ks___CodeDirectory.linkageApplicationType offset");
_Static_assert(offsetof(struct ks___CodeDirectory, linkageApplicationSubType) == 0x62, "ks___CodeDirectory.linkageApplicationSubType offset");
_Static_assert(offsetof(struct ks___CodeDirectory, linkageOffset) == 0x64, "ks___CodeDirectory.linkageOffset offset");
_Static_assert(offsetof(struct ks___CodeDirectory, linkageSize) == 0x68, "ks___CodeDirectory.linkageSize offset");
_Static_assert(offsetof(struct ks___CodeDirectory, end_withLinkage) == 0x6C, "ks___CodeDirectory.end_withLinkage offset");
_Static_assert(sizeof(struct ks___CodeDirectory) == 0x70, "ks___CodeDirectory size");

/* refs: 3 */
struct ks___SC_GenericBlob {
    unsigned int magic;
    unsigned int length;
    char data[];
};
_Static_assert(offsetof(struct ks___SC_GenericBlob, magic) == 0x0, "ks___SC_GenericBlob.magic offset");
_Static_assert(offsetof(struct ks___SC_GenericBlob, length) == 0x4, "ks___SC_GenericBlob.length offset");
_Static_assert(offsetof(struct ks___SC_GenericBlob, data) == 0x8, "ks___SC_GenericBlob.data offset");
_Static_assert(sizeof(struct ks___SC_GenericBlob) == 0x8, "ks___SC_GenericBlob size");

/* refs: 6 */
struct ks___bounds_safety__wide_ptr_bidi_indexable_4 {
    char *ptr;
    char *ub;
    char *lb;
} __attribute__((aligned(8)));
_Static_assert(offsetof(struct ks___bounds_safety__wide_ptr_bidi_indexable_4, ptr) == 0x0, "ks___bounds_safety__wide_ptr_bidi_indexable_4.ptr offset");
_Static_assert(offsetof(struct ks___bounds_safety__wide_ptr_bidi_indexable_4, ub) == 0x8, "ks___bounds_safety__wide_ptr_bidi_indexable_4.ub offset");
_Static_assert(offsetof(struct ks___bounds_safety__wide_ptr_bidi_indexable_4, lb) == 0x10, "ks___bounds_safety__wide_ptr_bidi_indexable_4.lb offset");
_Static_assert(sizeof(struct ks___bounds_safety__wide_ptr_bidi_indexable_4) == 0x18, "ks___bounds_safety__wide_ptr_bidi_indexable_4 size");

/* refs: 2 */
struct ks___buflet {
    unsigned long long __buflet_next;
    unsigned long long __baddr;
    unsigned int __bft_idx;
    unsigned int __bidx;
    unsigned int __nbft_idx;
    unsigned int __dlim;
    unsigned int __doff;
    unsigned int __dlen;
    unsigned short __flag;
} __attribute__((packed));
_Static_assert(offsetof(struct ks___buflet, __buflet_next) == 0x0, "ks___buflet.__buflet_next offset");
_Static_assert(offsetof(struct ks___buflet, __baddr) == 0x8, "ks___buflet.__baddr offset");
_Static_assert(offsetof(struct ks___buflet, __bft_idx) == 0x10, "ks___buflet.__bft_idx offset");
_Static_assert(offsetof(struct ks___buflet, __bidx) == 0x14, "ks___buflet.__bidx offset");
_Static_assert(offsetof(struct ks___buflet, __nbft_idx) == 0x18, "ks___buflet.__nbft_idx offset");
_Static_assert(offsetof(struct ks___buflet, __dlim) == 0x1C, "ks___buflet.__dlim offset");
_Static_assert(offsetof(struct ks___buflet, __doff) == 0x20, "ks___buflet.__doff offset");
_Static_assert(offsetof(struct ks___buflet, __dlen) == 0x24, "ks___buflet.__dlen offset");
_Static_assert(offsetof(struct ks___buflet, __flag) == 0x28, "ks___buflet.__flag offset");
_Static_assert(sizeof(struct ks___buflet) == 0x2A, "ks___buflet size");

/* refs: 1 */
struct ks___flow_classq {
    unsigned int _fcq_hash;
    unsigned int _fcq_flags;
};
_Static_assert(offsetof(struct ks___flow_classq, _fcq_hash) == 0x0, "ks___flow_classq._fcq_hash offset");
_Static_assert(offsetof(struct ks___flow_classq, _fcq_flags) == 0x4, "ks___flow_classq._fcq_flags offset");
_Static_assert(sizeof(struct ks___flow_classq) == 0x8, "ks___flow_classq size");

/* refs: 7 */
struct ks_in_addr {
    unsigned int s_addr;
};
_Static_assert(offsetof(struct ks_in_addr, s_addr) == 0x0, "ks_in_addr.s_addr offset");
_Static_assert(sizeof(struct ks_in_addr) == 0x4, "ks_in_addr size");

/* refs: 1 */
struct ks___flow_l3_ipv4_addrs {
    struct ks_in_addr _src;
    struct ks_in_addr _dst;
};
_Static_assert(offsetof(struct ks___flow_l3_ipv4_addrs, _src) == 0x0, "ks___flow_l3_ipv4_addrs._src offset");
_Static_assert(offsetof(struct ks___flow_l3_ipv4_addrs, _dst) == 0x4, "ks___flow_l3_ipv4_addrs._dst offset");
_Static_assert(sizeof(struct ks___flow_l3_ipv4_addrs) == 0x8, "ks___flow_l3_ipv4_addrs size");

/* refs: 12 */
struct ks_in6_addr {
    union {
        unsigned char __u6_addr8[0x10];
        unsigned short __u6_addr16[8];
        unsigned int __u6_addr32[4];
    } __u6_addr;
};
_Static_assert(offsetof(struct ks_in6_addr, __u6_addr) == 0x0, "ks_in6_addr.__u6_addr offset");
_Static_assert(sizeof(struct ks_in6_addr) == 0x10, "ks_in6_addr size");

/* refs: 1 */
struct ks___flow_l3_ipv6_addrs {
    struct ks_in6_addr _src;
    struct ks_in6_addr _dst;
};
_Static_assert(offsetof(struct ks___flow_l3_ipv6_addrs, _src) == 0x0, "ks___flow_l3_ipv6_addrs._src offset");
_Static_assert(offsetof(struct ks___flow_l3_ipv6_addrs, _dst) == 0x10, "ks___flow_l3_ipv6_addrs._dst offset");
_Static_assert(sizeof(struct ks___flow_l3_ipv6_addrs) == 0x20, "ks___flow_l3_ipv6_addrs size");

/* refs: 1 */
struct ks___flow_l3 {
    union {
        struct ks___flow_l3_ipv4_addrs _l3_ipv4;
        struct ks___flow_l3_ipv6_addrs _l3_ipv6;
    };
    unsigned char _l3_ip_ver;
    unsigned char _l3_proto;
    unsigned char _l3_hlen;
    unsigned int _l3_is_frag : 1; /* bit offset 280 */
    unsigned int _l3_is_first_frag : 1; /* bit offset 281 */
    unsigned int _l3_reserved_flags : 6; /* bit offset 282 */
    unsigned int _l3_frag_id;
    unsigned long long _l3_ptr;
};
_Static_assert(offsetof(struct ks___flow_l3, _l3_ip_ver) == 0x20, "ks___flow_l3._l3_ip_ver offset");
_Static_assert(offsetof(struct ks___flow_l3, _l3_proto) == 0x21, "ks___flow_l3._l3_proto offset");
_Static_assert(offsetof(struct ks___flow_l3, _l3_hlen) == 0x22, "ks___flow_l3._l3_hlen offset");
_Static_assert(offsetof(struct ks___flow_l3, _l3_frag_id) == 0x24, "ks___flow_l3._l3_frag_id offset");
_Static_assert(offsetof(struct ks___flow_l3, _l3_ptr) == 0x28, "ks___flow_l3._l3_ptr offset");
_Static_assert(sizeof(struct ks___flow_l3) == 0x30, "ks___flow_l3 size");

/* refs: 1 */
struct ks___flow_policy {
    unsigned int _fpc_id;
    unsigned int _fpc_skip_id;
    union {
        unsigned long long _fpc_euuid_64[2];
        unsigned int _fpc_euuid_32[4];
        unsigned char _fpc_euuid[0x10];
    } __attribute__((aligned(8)));
};
_Static_assert(offsetof(struct ks___flow_policy, _fpc_id) == 0x0, "ks___flow_policy._fpc_id offset");
_Static_assert(offsetof(struct ks___flow_policy, _fpc_skip_id) == 0x4, "ks___flow_policy._fpc_skip_id offset");
_Static_assert(sizeof(struct ks___flow_policy) == 0x18, "ks___flow_policy size");

/* refs: 1 */
struct ks___flow_source {
    union {
        unsigned long long _fsrc_id_64[2];
        unsigned int _fsrc_id_32[4];
        unsigned char _fsrc_id[0x10];
    } __attribute__((aligned(8)));
    unsigned int _fsrc_fidx;
    unsigned char _fsrc_type;
    unsigned char _fsrc_pad[3];
};
_Static_assert(offsetof(struct ks___flow_source, _fsrc_fidx) == 0x10, "ks___flow_source._fsrc_fidx offset");
_Static_assert(offsetof(struct ks___flow_source, _fsrc_type) == 0x14, "ks___flow_source._fsrc_type offset");
_Static_assert(offsetof(struct ks___flow_source, _fsrc_pad) == 0x15, "ks___flow_source._fsrc_pad offset");
_Static_assert(sizeof(struct ks___flow_source) == 0x18, "ks___flow_source size");

/* refs: 1 */
struct ks___flow_init {
    struct ks___flow_l3 __l3;
    struct ks___flow_classq __classq;
    unsigned int __ulen;
    unsigned char __ulp_encap;
    unsigned char __pad[3];
    unsigned long long __pad64[2];
    struct ks___flow_source __source;
    struct ks___flow_policy __policy;
};
_Static_assert(offsetof(struct ks___flow_init, __l3) == 0x0, "ks___flow_init.__l3 offset");
_Static_assert(offsetof(struct ks___flow_init, __classq) == 0x30, "ks___flow_init.__classq offset");
_Static_assert(offsetof(struct ks___flow_init, __ulen) == 0x38, "ks___flow_init.__ulen offset");
_Static_assert(offsetof(struct ks___flow_init, __ulp_encap) == 0x3C, "ks___flow_init.__ulp_encap offset");
_Static_assert(offsetof(struct ks___flow_init, __pad) == 0x3D, "ks___flow_init.__pad offset");
_Static_assert(offsetof(struct ks___flow_init, __pad64) == 0x40, "ks___flow_init.__pad64 offset");
_Static_assert(offsetof(struct ks___flow_init, __source) == 0x50, "ks___flow_init.__source offset");
_Static_assert(offsetof(struct ks___flow_init, __policy) == 0x68, "ks___flow_init.__policy offset");
_Static_assert(sizeof(struct ks___flow_init) == 0x80, "ks___flow_init size");

/* refs: 1 */
struct ks___flow_l4_esp {
    unsigned int _spi;
};
_Static_assert(offsetof(struct ks___flow_l4_esp, _spi) == 0x0, "ks___flow_l4_esp._spi offset");
_Static_assert(sizeof(struct ks___flow_l4_esp) == 0x4, "ks___flow_l4_esp size");

/* refs: 1 */
struct ks___flow_l4_tcp {
    unsigned short _src;
    unsigned short _dst;
    unsigned int _seq;
    unsigned int _ack;
    union {
        struct {
            unsigned char _tcp_res : 4; /* bit offset 0 */
            unsigned char _off : 4; /* bit offset 4 */
            unsigned char _flags;
            unsigned short _win;
        };
        unsigned int _ofw;
    };
};
_Static_assert(offsetof(struct ks___flow_l4_tcp, _src) == 0x0, "ks___flow_l4_tcp._src offset");
_Static_assert(offsetof(struct ks___flow_l4_tcp, _dst) == 0x2, "ks___flow_l4_tcp._dst offset");
_Static_assert(offsetof(struct ks___flow_l4_tcp, _seq) == 0x4, "ks___flow_l4_tcp._seq offset");
_Static_assert(offsetof(struct ks___flow_l4_tcp, _ack) == 0x8, "ks___flow_l4_tcp._ack offset");
_Static_assert(sizeof(struct ks___flow_l4_tcp) == 0x10, "ks___flow_l4_tcp size");

/* refs: 1 */
struct ks___flow_l4_udp {
    unsigned short _src;
    unsigned short _dst;
    unsigned int _ls;
};
_Static_assert(offsetof(struct ks___flow_l4_udp, _src) == 0x0, "ks___flow_l4_udp._src offset");
_Static_assert(offsetof(struct ks___flow_l4_udp, _dst) == 0x2, "ks___flow_l4_udp._dst offset");
_Static_assert(offsetof(struct ks___flow_l4_udp, _ls) == 0x4, "ks___flow_l4_udp._ls offset");
_Static_assert(sizeof(struct ks___flow_l4_udp) == 0x8, "ks___flow_l4_udp size");

/* refs: 1 */
struct ks___flow_l4 {
    union {
        struct ks___flow_l4_tcp _l4_tcp;
        struct ks___flow_l4_udp _l4_udp;
        struct ks___flow_l4_esp _l4_esp;
    };
    unsigned char _l4_hlen;
    unsigned char _l4_agg_fast;
    unsigned char _l4_pad[6];
    unsigned long long _l4_ptr;
};
_Static_assert(offsetof(struct ks___flow_l4, _l4_hlen) == 0x10, "ks___flow_l4._l4_hlen offset");
_Static_assert(offsetof(struct ks___flow_l4, _l4_agg_fast) == 0x11, "ks___flow_l4._l4_agg_fast offset");
_Static_assert(offsetof(struct ks___flow_l4, _l4_pad) == 0x12, "ks___flow_l4._l4_pad offset");
_Static_assert(offsetof(struct ks___flow_l4, _l4_ptr) == 0x18, "ks___flow_l4._l4_ptr offset");
_Static_assert(sizeof(struct ks___flow_l4) == 0x20, "ks___flow_l4 size");

/* refs: 1 */
struct ks___flow {
    union {
        struct ks___flow_init flow_init;
        unsigned long long flow_init_data[0x10];
    } __attribute__((aligned(16)));
    union {
        struct ks___flow_l4 flow_l4;
        unsigned long long flow_l4_data[4];
    } __attribute__((aligned(8)));
} __attribute__((aligned(16)));
_Static_assert(sizeof(struct ks___flow) == 0xA0, "ks___flow size");

/* refs: 2 */
struct ks___kern_buflet {
    struct ks___buflet buf_com;
    const struct ks_skmem_bufctl *buf_ctl;
} __attribute__((packed));
_Static_assert(offsetof(struct ks___kern_buflet, buf_com) == 0x0, "ks___kern_buflet.buf_com offset");
_Static_assert(offsetof(struct ks___kern_buflet, buf_ctl) == 0x2A, "ks___kern_buflet.buf_ctl offset");
_Static_assert(sizeof(struct ks___kern_buflet) == 0x32, "ks___kern_buflet size");

/* refs: 2 */
union ks_lck_mtx_state {
    struct {
        unsigned int owner : 28; /* bit offset 0 */
        unsigned int ilocked : 1; /* bit offset 28 */
        unsigned int spin_mode : 1; /* bit offset 29 */
        unsigned int needs_wakeup : 1; /* bit offset 30 */
        unsigned int profile : 1; /* bit offset 31 */
        unsigned short ilk_tail;
        unsigned short as_tail;
    };
    unsigned int data;
    unsigned long long val;
};
_Static_assert(offsetof(union ks_lck_mtx_state, data) == 0x0, "ks_lck_mtx_state.data offset");
_Static_assert(offsetof(union ks_lck_mtx_state, val) == 0x0, "ks_lck_mtx_state.val offset");

/* refs: 80 */
struct ks_lck_mtx_s {
    unsigned int lck_mtx_tsid : 24; /* bit offset 0 */
    unsigned char lck_mtx_type : 8; /* bit offset 24 */
    unsigned int lck_mtx_grp;
    union ks_lck_mtx_state lck_mtx;
};
_Static_assert(offsetof(struct ks_lck_mtx_s, lck_mtx_grp) == 0x4, "ks_lck_mtx_s.lck_mtx_grp offset");
_Static_assert(offsetof(struct ks_lck_mtx_s, lck_mtx) == 0x8, "ks_lck_mtx_s.lck_mtx offset");
_Static_assert(sizeof(struct ks_lck_mtx_s) == 0x10, "ks_lck_mtx_s size");

/* refs: 8 */
struct ks_klist {
    struct ks_knote *slh_first;
};
_Static_assert(offsetof(struct ks_klist, slh_first) == 0x0, "ks_klist.slh_first offset");
_Static_assert(sizeof(struct ks_klist) == 0x8, "ks_klist size");

/* refs: 12 */
struct ks_circle_queue_head {
    struct ks_queue_entry *head;
};
_Static_assert(offsetof(struct ks_circle_queue_head, head) == 0x0, "ks_circle_queue_head.head offset");
_Static_assert(sizeof(struct ks_circle_queue_head) == 0x8, "ks_circle_queue_head size");

/* refs: 7 */
struct ks_mpsc_queue_chain {
    struct ks_mpsc_queue_chain * _Atomic mpqc_next;
};
_Static_assert(offsetof(struct ks_mpsc_queue_chain, mpqc_next) == 0x0, "ks_mpsc_queue_chain.mpqc_next offset");
_Static_assert(sizeof(struct ks_mpsc_queue_chain) == 0x8, "ks_mpsc_queue_chain size");

/* refs: 11 */
struct ks_priority_queue_sched_max {
    struct ks_priority_queue_entry_sched *pq_root;
};
_Static_assert(offsetof(struct ks_priority_queue_sched_max, pq_root) == 0x0, "ks_priority_queue_sched_max.pq_root offset");
_Static_assert(sizeof(struct ks_priority_queue_sched_max) == 0x8, "ks_priority_queue_sched_max size");

/* refs: 4 */
struct ks_waitq_link_list_entry {
    struct ks_waitq_link_list_entry *next;
};
_Static_assert(offsetof(struct ks_waitq_link_list_entry, next) == 0x0, "ks_waitq_link_list_entry.next offset");
_Static_assert(sizeof(struct ks_waitq_link_list_entry) == 0x8, "ks_waitq_link_list_entry size");

/* refs: 8 */
union ks_hw_lck_ticket_s {
    struct {
        unsigned char lck_type;
        unsigned char lck_valid : 1; /* bit offset 8 */
        unsigned char lck_is_pv : 1; /* bit offset 9 */
        unsigned char lck_unused : 6; /* bit offset 10 */
        union {
            struct {
                unsigned char cticket;
                unsigned char nticket;
            };
            unsigned short tcurnext;
        };
    };
    unsigned int lck_value;
};
_Static_assert(offsetof(union ks_hw_lck_ticket_s, lck_value) == 0x0, "ks_hw_lck_ticket_s.lck_value offset");

/* refs: 4 */
struct ks_waitq {
    struct {
        unsigned int waitq_type : 3; /* bit offset 0 */
        unsigned int waitq_fifo : 1; /* bit offset 3 */
        unsigned int waitq_preposted : 1; /* bit offset 4 */
        unsigned int waitq_eventmask : 27; /* bit offset 5 */
    };
    union ks_hw_lck_ticket_s waitq_interlock;
    unsigned char waitq_padding[0];
    union {
        struct ks_circle_queue_head waitq_queue;
        struct ks_priority_queue_sched_max waitq_prio_queue;
        struct ks_turnstile *waitq_ts;
    };
    union {
        struct ks_circle_queue_head waitq_links;
        struct ks_waitq_link_list_entry waitq_sellinks;
        void *waitq_inheritor;
        struct ks_mpsc_queue_chain waitq_defer;
    };
} __attribute__((aligned(8)));
_Static_assert(offsetof(struct ks_waitq, waitq_interlock) == 0x4, "ks_waitq.waitq_interlock offset");
_Static_assert(offsetof(struct ks_waitq, waitq_padding) == 0x8, "ks_waitq.waitq_padding offset");
_Static_assert(sizeof(struct ks_waitq) == 0x18, "ks_waitq size");

/* refs: 5 */
struct ks_selinfo {
    union {
        struct ks_waitq si_waitq __attribute__((aligned(8)));
        unsigned char si_waitq_storage[0x28];
    };
    struct ks_klist si_note;
    unsigned int si_flags;
};
_Static_assert(offsetof(struct ks_selinfo, si_note) == 0x28, "ks_selinfo.si_note offset");
_Static_assert(offsetof(struct ks_selinfo, si_flags) == 0x30, "ks_selinfo.si_flags offset");
_Static_assert(sizeof(struct ks_selinfo) == 0x38, "ks_selinfo size");

/* refs: 3 */
struct ks_ch_selinfo {
    struct ks_lck_mtx_s csi_lock;
    struct ks_selinfo csi_si;
    unsigned int csi_flags;
    unsigned int csi_pending;
    unsigned long long csi_eff_interval;
    unsigned long long csi_interval;
    struct ks_thread_call *csi_tcall;
};
_Static_assert(offsetof(struct ks_ch_selinfo, csi_lock) == 0x0, "ks_ch_selinfo.csi_lock offset");
_Static_assert(offsetof(struct ks_ch_selinfo, csi_si) == 0x10, "ks_ch_selinfo.csi_si offset");
_Static_assert(offsetof(struct ks_ch_selinfo, csi_flags) == 0x48, "ks_ch_selinfo.csi_flags offset");
_Static_assert(offsetof(struct ks_ch_selinfo, csi_pending) == 0x4C, "ks_ch_selinfo.csi_pending offset");
_Static_assert(offsetof(struct ks_ch_selinfo, csi_eff_interval) == 0x50, "ks_ch_selinfo.csi_eff_interval offset");
_Static_assert(offsetof(struct ks_ch_selinfo, csi_interval) == 0x58, "ks_ch_selinfo.csi_interval offset");
_Static_assert(offsetof(struct ks_ch_selinfo, csi_tcall) == 0x60, "ks_ch_selinfo.csi_tcall offset");
_Static_assert(sizeof(struct ks_ch_selinfo) == 0x68, "ks_ch_selinfo size");

/* refs: 2 */
struct ks_channel_ring_error_stats {
    unsigned int cres_pkt_alloc_failures;
    unsigned int __cres_reserved[1];
};
_Static_assert(offsetof(struct ks_channel_ring_error_stats, cres_pkt_alloc_failures) == 0x0, "ks_channel_ring_error_stats.cres_pkt_alloc_failures offset");
_Static_assert(offsetof(struct ks_channel_ring_error_stats, __cres_reserved) == 0x4, "ks_channel_ring_error_stats.__cres_reserved offset");
_Static_assert(sizeof(struct ks_channel_ring_error_stats) == 0x8, "ks_channel_ring_error_stats size");

/* refs: 2 */
struct ks_channel_ring_stats {
    unsigned long long crs_total_slots_transferred;
    unsigned long long crs_total_bytes_transferred;
    unsigned long long crs_number_of_transfers;
    unsigned long long crs_last_update_net_uptime;
    unsigned long long crs_slots_per_second;
    unsigned long long crs_slots_per_second_ma;
    unsigned long long crs_bytes_per_second;
    unsigned long long crs_bytes_per_second_ma;
    unsigned int crs_min_slots_transferred;
    unsigned int crs_max_slots_transferred;
};
_Static_assert(offsetof(struct ks_channel_ring_stats, crs_total_slots_transferred) == 0x0, "ks_channel_ring_stats.crs_total_slots_transferred offset");
_Static_assert(offsetof(struct ks_channel_ring_stats, crs_total_bytes_transferred) == 0x8, "ks_channel_ring_stats.crs_total_bytes_transferred offset");
_Static_assert(offsetof(struct ks_channel_ring_stats, crs_number_of_transfers) == 0x10, "ks_channel_ring_stats.crs_number_of_transfers offset");
_Static_assert(offsetof(struct ks_channel_ring_stats, crs_last_update_net_uptime) == 0x18, "ks_channel_ring_stats.crs_last_update_net_uptime offset");
_Static_assert(offsetof(struct ks_channel_ring_stats, crs_slots_per_second) == 0x20, "ks_channel_ring_stats.crs_slots_per_second offset");
_Static_assert(offsetof(struct ks_channel_ring_stats, crs_slots_per_second_ma) == 0x28, "ks_channel_ring_stats.crs_slots_per_second_ma offset");
_Static_assert(offsetof(struct ks_channel_ring_stats, crs_bytes_per_second) == 0x30, "ks_channel_ring_stats.crs_bytes_per_second offset");
_Static_assert(offsetof(struct ks_channel_ring_stats, crs_bytes_per_second_ma) == 0x38, "ks_channel_ring_stats.crs_bytes_per_second_ma offset");
_Static_assert(offsetof(struct ks_channel_ring_stats, crs_min_slots_transferred) == 0x40, "ks_channel_ring_stats.crs_min_slots_transferred offset");
_Static_assert(offsetof(struct ks_channel_ring_stats, crs_max_slots_transferred) == 0x44, "ks_channel_ring_stats.crs_max_slots_transferred offset");
_Static_assert(sizeof(struct ks_channel_ring_stats) == 0x48, "ks_channel_ring_stats size");

/* refs: 2 */
struct ks_channel_ring_user_stats {
    unsigned long long crsu_total_slots_transferred;
    unsigned long long crsu_total_bytes_transferred;
    unsigned long long crsu_number_of_syncs;
    unsigned long long crsu_bytes_per_sync;
    unsigned long long crsu_bytes_per_sync_ma;
    unsigned int crsu_min_slots_transferred;
    unsigned int crsu_max_slots_transferred;
    unsigned int crsu_slots_per_sync;
    unsigned int crsu_slots_per_sync_ma;
};
_Static_assert(offsetof(struct ks_channel_ring_user_stats, crsu_total_slots_transferred) == 0x0, "ks_channel_ring_user_stats.crsu_total_slots_transferred offset");
_Static_assert(offsetof(struct ks_channel_ring_user_stats, crsu_total_bytes_transferred) == 0x8, "ks_channel_ring_user_stats.crsu_total_bytes_transferred offset");
_Static_assert(offsetof(struct ks_channel_ring_user_stats, crsu_number_of_syncs) == 0x10, "ks_channel_ring_user_stats.crsu_number_of_syncs offset");
_Static_assert(offsetof(struct ks_channel_ring_user_stats, crsu_bytes_per_sync) == 0x18, "ks_channel_ring_user_stats.crsu_bytes_per_sync offset");
_Static_assert(offsetof(struct ks_channel_ring_user_stats, crsu_bytes_per_sync_ma) == 0x20, "ks_channel_ring_user_stats.crsu_bytes_per_sync_ma offset");
_Static_assert(offsetof(struct ks_channel_ring_user_stats, crsu_min_slots_transferred) == 0x28, "ks_channel_ring_user_stats.crsu_min_slots_transferred offset");
_Static_assert(offsetof(struct ks_channel_ring_user_stats, crsu_max_slots_transferred) == 0x2C, "ks_channel_ring_user_stats.crsu_max_slots_transferred offset");
_Static_assert(offsetof(struct ks_channel_ring_user_stats, crsu_slots_per_sync) == 0x30, "ks_channel_ring_user_stats.crsu_slots_per_sync offset");
_Static_assert(offsetof(struct ks_channel_ring_user_stats, crsu_slots_per_sync_ma) == 0x34, "ks_channel_ring_user_stats.crsu_slots_per_sync_ma offset");
_Static_assert(sizeof(struct ks_channel_ring_user_stats) == 0x38, "ks_channel_ring_user_stats size");

/* refs: 1 */
struct ks_hslock {
    unsigned long lock_data;
};
_Static_assert(offsetof(struct ks_hslock, lock_data) == 0x0, "ks_hslock.lock_data offset");
_Static_assert(sizeof(struct ks_hslock) == 0x8, "ks_hslock size");

/* refs: 15 */
struct ks_lck_spin_s {
    struct ks_hslock hwlock;
    unsigned long type;
};
_Static_assert(offsetof(struct ks_lck_spin_s, hwlock) == 0x0, "ks_lck_spin_s.hwlock offset");
_Static_assert(offsetof(struct ks_lck_spin_s, type) == 0x8, "ks_lck_spin_s.type offset");
_Static_assert(sizeof(struct ks_lck_spin_s) == 0x10, "ks_lck_spin_s size");

/* refs: 1 */
struct ks_kq_head {
    struct ks___kern_packet *kq_first;
    struct ks___kern_packet **kq_last;
    unsigned int kq_len;
};
_Static_assert(offsetof(struct ks_kq_head, kq_first) == 0x0, "ks_kq_head.kq_first offset");
_Static_assert(offsetof(struct ks_kq_head, kq_last) == 0x8, "ks_kq_head.kq_last offset");
_Static_assert(offsetof(struct ks_kq_head, kq_len) == 0x10, "ks_kq_head.kq_len offset");
_Static_assert(sizeof(struct ks_kq_head) == 0x18, "ks_kq_head size");

/* refs: 1 */
struct ks_mq_head {
    struct ks_mbuf *mq_first;
    struct ks_mbuf **mq_last;
};
_Static_assert(offsetof(struct ks_mq_head, mq_first) == 0x0, "ks_mq_head.mq_first offset");
_Static_assert(offsetof(struct ks_mq_head, mq_last) == 0x8, "ks_mq_head.mq_last offset");
_Static_assert(sizeof(struct ks_mq_head) == 0x10, "ks_mq_head size");

/* refs: 4 */
struct ks__class_queue_ {
    union {
        struct ks_mq_head __mbufq;
        struct ks_kq_head __kpktq;
    } __pktq_u;
    unsigned int qlen;
    unsigned int qlim;
    unsigned long long qsize;
    unsigned int qtype;
    unsigned int qstate;
    unsigned int qptype;
};
_Static_assert(offsetof(struct ks__class_queue_, __pktq_u) == 0x0, "ks__class_queue_.__pktq_u offset");
_Static_assert(offsetof(struct ks__class_queue_, qlen) == 0x18, "ks__class_queue_.qlen offset");
_Static_assert(offsetof(struct ks__class_queue_, qlim) == 0x1C, "ks__class_queue_.qlim offset");
_Static_assert(offsetof(struct ks__class_queue_, qsize) == 0x20, "ks__class_queue_.qsize offset");
_Static_assert(offsetof(struct ks__class_queue_, qtype) == 0x28, "ks__class_queue_.qtype offset");
_Static_assert(offsetof(struct ks__class_queue_, qstate) == 0x2C, "ks__class_queue_.qstate offset");
_Static_assert(offsetof(struct ks__class_queue_, qptype) == 0x30, "ks__class_queue_.qptype offset");
_Static_assert(sizeof(struct ks__class_queue_) == 0x38, "ks__class_queue_ size");

/* refs: 2 */
struct ks_nx_mbq {
    struct ks_lck_mtx_s nx_mbq_lock;
    struct ks__class_queue_ nx_mbq_q;
    struct ks__lck_grp_ *nx_mbq_grp;
    struct ks___kern_channel_ring *nx_mbq_kring;
};
_Static_assert(offsetof(struct ks_nx_mbq, nx_mbq_lock) == 0x0, "ks_nx_mbq.nx_mbq_lock offset");
_Static_assert(offsetof(struct ks_nx_mbq, nx_mbq_q) == 0x10, "ks_nx_mbq.nx_mbq_q offset");
_Static_assert(offsetof(struct ks_nx_mbq, nx_mbq_grp) == 0x48, "ks_nx_mbq.nx_mbq_grp offset");
_Static_assert(offsetof(struct ks_nx_mbq, nx_mbq_kring) == 0x50, "ks_nx_mbq.nx_mbq_kring offset");
_Static_assert(sizeof(struct ks_nx_mbq) == 0x58, "ks_nx_mbq size");

/* refs: 18 */
struct ks___kern_channel_ring {
    struct ks___user_channel_ring *ckr_ring;
    unsigned int ckr_flags;
    unsigned int ckr_num_slots;
    unsigned int ckr_max_pkt_len;
    unsigned int ckr_largest;
    unsigned int ckr_lim;
    unsigned int ckr_tx;
    unsigned int ckr_khead;
    unsigned int ckr_ktail;
    unsigned int ckr_khead_pre;
    unsigned int ckr_rhead;
    unsigned int ckr_rtail;
    unsigned int ckr_transfer_decay;
    unsigned long long ckr_ready_bytes;
    unsigned long long ckr_ready_slots;
    struct ks_lck_spin_s ckr_slock;
    struct ks_thread *ckr_owner;
    unsigned int ckr_busy;
    unsigned int ckr_want;
    unsigned int ckr_state;
    unsigned int ckr_alloc_ws;
    struct ks_nexus_adapter *ckr_na;
    struct ks_kern_pbufpool *ckr_pp;
    struct ks___slot_desc *ckr_usds;
    unsigned int ckr_usds_cnt;
    struct ks___slot_desc *ckr_ksds;
    unsigned int ckr_ksds_cnt;
    struct ks___slot_desc *ckr_ksds_last;
    struct ks_skmem_cache *ckr_ksds_cache;
    unsigned int ckr_ring_id;
    int ckr_rate_limited;
    unsigned long long *ckr_scratch;
    unsigned int ckr_scratch_cnt;
    int *ckr_na_sync;
    volatile int *ckr_na_notify;
    int *ckr_prologue;
    void *ckr_finalize;
    unsigned long long ckr_sync_time;
    int *ckr_save_notify;
    int ckr_svc;
    unsigned int ckr_slot_ctxs_set;
    struct ks_slot_ctx *ckr_slot_ctxs;
    unsigned int ckr_slot_ctxs_cnt;
    void *ckr_ctx;
    struct ks_ch_selinfo ckr_si;
    int *ckr_netif_notify;
    void *ckr_netif_mit_stats;
    struct ks_nx_netif_mit *ckr_mit;
    unsigned int ckr_pending_intr;
    unsigned int ckr_pending_doorbell;
    struct ks_mbuf **ckr_tx_pool;
    unsigned int ckr_tx_pool_count;
    struct ks_nx_mbq ckr_rx_queue;
    struct ks___kern_channel_ring *ckr_pipe;
    struct ks___user_channel_ring *ckr_save_ring;
    struct ks_lck_mtx_s ckr_qlock;
    unsigned int ckr_users;
    long long ckr_tbr_token;
    long long ckr_tbr_depth;
    unsigned long long ckr_tbr_last;
    struct ks_channel_ring_error_stats ckr_err_stats __attribute__((aligned(64)));
    struct ks_channel_ring_stats ckr_stats __attribute__((aligned(64)));
    unsigned long long ckr_accumulated_bytes;
    unsigned long long ckr_accumulated_slots;
    unsigned long long ckr_accumulate_start;
    struct ks_channel_ring_user_stats ckr_usr_stats __attribute__((aligned(64)));
    unsigned long long ckr_user_accumulated_bytes;
    unsigned long long ckr_user_accumulated_slots;
    unsigned long long ckr_user_accumulated_syncs;
    unsigned long long ckr_user_accumulate_start;
    struct ks__lck_grp_ *ckr_qlock_group;
    struct ks__lck_grp_ *ckr_slock_group;
    char ckr_name[0x40];
    unsigned long long ckr_rx_dequeue_ts;
    unsigned long long ckr_rx_enqueue_ts;
} __attribute__((aligned(128)));
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_ring) == 0x0, "ks___kern_channel_ring.ckr_ring offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_flags) == 0x8, "ks___kern_channel_ring.ckr_flags offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_num_slots) == 0xC, "ks___kern_channel_ring.ckr_num_slots offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_max_pkt_len) == 0x10, "ks___kern_channel_ring.ckr_max_pkt_len offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_largest) == 0x14, "ks___kern_channel_ring.ckr_largest offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_lim) == 0x18, "ks___kern_channel_ring.ckr_lim offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_tx) == 0x1C, "ks___kern_channel_ring.ckr_tx offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_khead) == 0x20, "ks___kern_channel_ring.ckr_khead offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_ktail) == 0x24, "ks___kern_channel_ring.ckr_ktail offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_khead_pre) == 0x28, "ks___kern_channel_ring.ckr_khead_pre offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_rhead) == 0x2C, "ks___kern_channel_ring.ckr_rhead offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_rtail) == 0x30, "ks___kern_channel_ring.ckr_rtail offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_transfer_decay) == 0x34, "ks___kern_channel_ring.ckr_transfer_decay offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_ready_bytes) == 0x38, "ks___kern_channel_ring.ckr_ready_bytes offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_ready_slots) == 0x40, "ks___kern_channel_ring.ckr_ready_slots offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_slock) == 0x48, "ks___kern_channel_ring.ckr_slock offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_owner) == 0x58, "ks___kern_channel_ring.ckr_owner offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_busy) == 0x60, "ks___kern_channel_ring.ckr_busy offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_want) == 0x64, "ks___kern_channel_ring.ckr_want offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_state) == 0x68, "ks___kern_channel_ring.ckr_state offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_alloc_ws) == 0x6C, "ks___kern_channel_ring.ckr_alloc_ws offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_na) == 0x70, "ks___kern_channel_ring.ckr_na offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_pp) == 0x78, "ks___kern_channel_ring.ckr_pp offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_usds) == 0x80, "ks___kern_channel_ring.ckr_usds offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_usds_cnt) == 0x88, "ks___kern_channel_ring.ckr_usds_cnt offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_ksds) == 0x90, "ks___kern_channel_ring.ckr_ksds offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_ksds_cnt) == 0x98, "ks___kern_channel_ring.ckr_ksds_cnt offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_ksds_last) == 0xA0, "ks___kern_channel_ring.ckr_ksds_last offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_ksds_cache) == 0xA8, "ks___kern_channel_ring.ckr_ksds_cache offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_ring_id) == 0xB0, "ks___kern_channel_ring.ckr_ring_id offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_rate_limited) == 0xB4, "ks___kern_channel_ring.ckr_rate_limited offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_scratch) == 0xB8, "ks___kern_channel_ring.ckr_scratch offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_scratch_cnt) == 0xC0, "ks___kern_channel_ring.ckr_scratch_cnt offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_na_sync) == 0xC8, "ks___kern_channel_ring.ckr_na_sync offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_na_notify) == 0xD0, "ks___kern_channel_ring.ckr_na_notify offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_prologue) == 0xD8, "ks___kern_channel_ring.ckr_prologue offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_finalize) == 0xE0, "ks___kern_channel_ring.ckr_finalize offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_sync_time) == 0xE8, "ks___kern_channel_ring.ckr_sync_time offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_save_notify) == 0xF0, "ks___kern_channel_ring.ckr_save_notify offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_svc) == 0xF8, "ks___kern_channel_ring.ckr_svc offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_slot_ctxs_set) == 0xFC, "ks___kern_channel_ring.ckr_slot_ctxs_set offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_slot_ctxs) == 0x100, "ks___kern_channel_ring.ckr_slot_ctxs offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_slot_ctxs_cnt) == 0x108, "ks___kern_channel_ring.ckr_slot_ctxs_cnt offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_ctx) == 0x110, "ks___kern_channel_ring.ckr_ctx offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_si) == 0x118, "ks___kern_channel_ring.ckr_si offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_netif_notify) == 0x180, "ks___kern_channel_ring.ckr_netif_notify offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_netif_mit_stats) == 0x188, "ks___kern_channel_ring.ckr_netif_mit_stats offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_mit) == 0x190, "ks___kern_channel_ring.ckr_mit offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_pending_intr) == 0x198, "ks___kern_channel_ring.ckr_pending_intr offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_pending_doorbell) == 0x19C, "ks___kern_channel_ring.ckr_pending_doorbell offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_tx_pool) == 0x1A0, "ks___kern_channel_ring.ckr_tx_pool offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_tx_pool_count) == 0x1A8, "ks___kern_channel_ring.ckr_tx_pool_count offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_rx_queue) == 0x1B0, "ks___kern_channel_ring.ckr_rx_queue offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_pipe) == 0x208, "ks___kern_channel_ring.ckr_pipe offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_save_ring) == 0x210, "ks___kern_channel_ring.ckr_save_ring offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_qlock) == 0x218, "ks___kern_channel_ring.ckr_qlock offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_users) == 0x228, "ks___kern_channel_ring.ckr_users offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_tbr_token) == 0x230, "ks___kern_channel_ring.ckr_tbr_token offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_tbr_depth) == 0x238, "ks___kern_channel_ring.ckr_tbr_depth offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_tbr_last) == 0x240, "ks___kern_channel_ring.ckr_tbr_last offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_err_stats) == 0x280, "ks___kern_channel_ring.ckr_err_stats offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_stats) == 0x2C0, "ks___kern_channel_ring.ckr_stats offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_accumulated_bytes) == 0x308, "ks___kern_channel_ring.ckr_accumulated_bytes offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_accumulated_slots) == 0x310, "ks___kern_channel_ring.ckr_accumulated_slots offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_accumulate_start) == 0x318, "ks___kern_channel_ring.ckr_accumulate_start offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_usr_stats) == 0x340, "ks___kern_channel_ring.ckr_usr_stats offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_user_accumulated_bytes) == 0x378, "ks___kern_channel_ring.ckr_user_accumulated_bytes offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_user_accumulated_slots) == 0x380, "ks___kern_channel_ring.ckr_user_accumulated_slots offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_user_accumulated_syncs) == 0x388, "ks___kern_channel_ring.ckr_user_accumulated_syncs offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_user_accumulate_start) == 0x390, "ks___kern_channel_ring.ckr_user_accumulate_start offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_qlock_group) == 0x398, "ks___kern_channel_ring.ckr_qlock_group offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_slock_group) == 0x3A0, "ks___kern_channel_ring.ckr_slock_group offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_name) == 0x3A8, "ks___kern_channel_ring.ckr_name offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_rx_dequeue_ts) == 0x3E8, "ks___kern_channel_ring.ckr_rx_dequeue_ts offset");
_Static_assert(offsetof(struct ks___kern_channel_ring, ckr_rx_enqueue_ts) == 0x3F0, "ks___kern_channel_ring.ckr_rx_enqueue_ts offset");
_Static_assert(sizeof(struct ks___kern_channel_ring) == 0x400, "ks___kern_channel_ring size");

/* refs: 1 */
struct ks_ifnet_interface_advisory_capacity {
    int rate_trend_suggestion;
    unsigned long long timestamp;
    unsigned long long max_bandwidth;
    unsigned long long total_byte_count;
    unsigned long long average_throughput;
    unsigned int flushable_queue_size;
    unsigned int non_flushable_queue_size;
    unsigned int average_delay;
} __attribute__((packed));
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_capacity, rate_trend_suggestion) == 0x0, "ks_ifnet_interface_advisory_capacity.rate_trend_suggestion offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_capacity, timestamp) == 0x4, "ks_ifnet_interface_advisory_capacity.timestamp offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_capacity, max_bandwidth) == 0xC, "ks_ifnet_interface_advisory_capacity.max_bandwidth offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_capacity, total_byte_count) == 0x14, "ks_ifnet_interface_advisory_capacity.total_byte_count offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_capacity, average_throughput) == 0x1C, "ks_ifnet_interface_advisory_capacity.average_throughput offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_capacity, flushable_queue_size) == 0x24, "ks_ifnet_interface_advisory_capacity.flushable_queue_size offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_capacity, non_flushable_queue_size) == 0x28, "ks_ifnet_interface_advisory_capacity.non_flushable_queue_size offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_capacity, average_delay) == 0x2C, "ks_ifnet_interface_advisory_capacity.average_delay offset");
_Static_assert(sizeof(struct ks_ifnet_interface_advisory_capacity) == 0x30, "ks_ifnet_interface_advisory_capacity size");

/* refs: 1 */
struct ks_ifnet_interface_advisory_cell_context {
    unsigned char radio_access_technology;
    short reference_signal_level;
    short signal_level;
    signed char signal_quality;
    unsigned char uplink_bler;
    unsigned char downlink_bler;
    unsigned char bandwidth_limitation_indication;
    unsigned char cdrx_state;
    unsigned short cdrx_cycle;
    unsigned short estimated_outage_period;
    unsigned char outage_state;
    unsigned char __pad;
} __attribute__((packed));
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, radio_access_technology) == 0x0, "ks_ifnet_interface_advisory_cell_context.radio_access_technology offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, reference_signal_level) == 0x1, "ks_ifnet_interface_advisory_cell_context.reference_signal_level offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, signal_level) == 0x3, "ks_ifnet_interface_advisory_cell_context.signal_level offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, signal_quality) == 0x5, "ks_ifnet_interface_advisory_cell_context.signal_quality offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, uplink_bler) == 0x6, "ks_ifnet_interface_advisory_cell_context.uplink_bler offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, downlink_bler) == 0x7, "ks_ifnet_interface_advisory_cell_context.downlink_bler offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, bandwidth_limitation_indication) == 0x8, "ks_ifnet_interface_advisory_cell_context.bandwidth_limitation_indication offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, cdrx_state) == 0x9, "ks_ifnet_interface_advisory_cell_context.cdrx_state offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, cdrx_cycle) == 0xA, "ks_ifnet_interface_advisory_cell_context.cdrx_cycle offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, estimated_outage_period) == 0xC, "ks_ifnet_interface_advisory_cell_context.estimated_outage_period offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, outage_state) == 0xE, "ks_ifnet_interface_advisory_cell_context.outage_state offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_cell_context, __pad) == 0xF, "ks_ifnet_interface_advisory_cell_context.__pad offset");
_Static_assert(sizeof(struct ks_ifnet_interface_advisory_cell_context) == 0x10, "ks_ifnet_interface_advisory_cell_context size");

/* refs: 2 */
union ks_ifnet_interface_advisory_notification_type_t {
    unsigned char cell;
    unsigned char wifi;
};
_Static_assert(offsetof(union ks_ifnet_interface_advisory_notification_type_t, cell) == 0x0, "ks_ifnet_interface_advisory_notification_type_t.cell offset");
_Static_assert(offsetof(union ks_ifnet_interface_advisory_notification_type_t, wifi) == 0x0, "ks_ifnet_interface_advisory_notification_type_t.wifi offset");

/* refs: 1 */
struct ks_ifnet_interface_advisory_header {
    unsigned char version;
    unsigned char direction;
    unsigned char interface_type;
    union ks_ifnet_interface_advisory_notification_type_t notification_type;
};
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_header, version) == 0x0, "ks_ifnet_interface_advisory_header.version offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_header, direction) == 0x1, "ks_ifnet_interface_advisory_header.direction offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_header, interface_type) == 0x2, "ks_ifnet_interface_advisory_header.interface_type offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_header, notification_type) == 0x3, "ks_ifnet_interface_advisory_header.notification_type offset");
_Static_assert(sizeof(struct ks_ifnet_interface_advisory_header) == 0x4, "ks_ifnet_interface_advisory_header size");

/* refs: 1 */
struct ks_ifnet_interface_advisory_wifi_context {
    unsigned char frequency_band;
    unsigned char intermittent_state;
    unsigned short estimated_intermittent_period;
    unsigned short single_outage_period;
    unsigned char bt_coex;
    unsigned char quality_score_delay;
    unsigned char quality_score_loss;
    unsigned char quality_score_channel;
    unsigned char radio_coex;
    unsigned short wlan_duty_cycle;
    unsigned int wifi_observed_tx_bitrate[6];
} __attribute__((packed));
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, frequency_band) == 0x0, "ks_ifnet_interface_advisory_wifi_context.frequency_band offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, intermittent_state) == 0x1, "ks_ifnet_interface_advisory_wifi_context.intermittent_state offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, estimated_intermittent_period) == 0x2, "ks_ifnet_interface_advisory_wifi_context.estimated_intermittent_period offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, single_outage_period) == 0x4, "ks_ifnet_interface_advisory_wifi_context.single_outage_period offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, bt_coex) == 0x6, "ks_ifnet_interface_advisory_wifi_context.bt_coex offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, quality_score_delay) == 0x7, "ks_ifnet_interface_advisory_wifi_context.quality_score_delay offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, quality_score_loss) == 0x8, "ks_ifnet_interface_advisory_wifi_context.quality_score_loss offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, quality_score_channel) == 0x9, "ks_ifnet_interface_advisory_wifi_context.quality_score_channel offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, radio_coex) == 0xA, "ks_ifnet_interface_advisory_wifi_context.radio_coex offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, wlan_duty_cycle) == 0xB, "ks_ifnet_interface_advisory_wifi_context.wlan_duty_cycle offset");
_Static_assert(offsetof(struct ks_ifnet_interface_advisory_wifi_context, wifi_observed_tx_bitrate) == 0xD, "ks_ifnet_interface_advisory_wifi_context.wifi_observed_tx_bitrate offset");
_Static_assert(sizeof(struct ks_ifnet_interface_advisory_wifi_context) == 0x25, "ks_ifnet_interface_advisory_wifi_context size");

/* refs: 1 */
struct ks_ifnet_interface_advisory {
    union {
        struct {
            unsigned char version;
            unsigned char direction;
            unsigned short _reserved;
            int rate_trend_suggestion;
            unsigned long long timestamp;
            unsigned long long max_bandwidth;
            unsigned long long total_byte_count;
            unsigned long long average_throughput;
            unsigned int flushable_queue_size;
            unsigned int non_flushable_queue_size;
            unsigned int average_delay;
            unsigned char frequency_band;
            unsigned char intermittent_state;
            unsigned short estimated_intermittent_period;
            unsigned short single_outage_period;
            unsigned char bt_coex;
            unsigned char quality_score_delay;
            unsigned char quality_score_loss;
            unsigned char quality_score_channel;
        };
        struct {
            struct ks_ifnet_interface_advisory_header header;
            struct ks_ifnet_interface_advisory_capacity capacity;
            union {
                struct ks_ifnet_interface_advisory_wifi_context wifi_context;
                struct ks_ifnet_interface_advisory_cell_context cell_context;
            };
        };
    };
} __attribute__((aligned(8)));
_Static_assert(sizeof(struct ks_ifnet_interface_advisory) == 0x60, "ks_ifnet_interface_advisory size");

/* refs: 2 */
struct ks___kern_netif_intf_advisory {
    unsigned int cksum;
    unsigned int _reserved;
    struct ks_ifnet_interface_advisory adv __attribute__((aligned(8)));
} __attribute__((aligned(8)));
_Static_assert(offsetof(struct ks___kern_netif_intf_advisory, cksum) == 0x0, "ks___kern_netif_intf_advisory.cksum offset");
_Static_assert(offsetof(struct ks___kern_netif_intf_advisory, _reserved) == 0x4, "ks___kern_netif_intf_advisory._reserved offset");
_Static_assert(offsetof(struct ks___kern_netif_intf_advisory, adv) == 0x8, "ks___kern_netif_intf_advisory.adv offset");
_Static_assert(sizeof(struct ks___kern_netif_intf_advisory) == 0x68, "ks___kern_netif_intf_advisory size");

/* refs: 2 */
struct ks___quantum {
    union {
        unsigned char __uuid[0x10];
        unsigned char __val8[0x10];
        unsigned short __val16[8];
        unsigned int __val32[4];
        unsigned long long __val64[2];
    } __flow_id_u;
    unsigned int __q_len;
    unsigned int __q_svc_class;
    unsigned short __q_flags;
    unsigned short __q_pad[3];
} __attribute__((aligned(8)));
_Static_assert(offsetof(struct ks___quantum, __flow_id_u) == 0x0, "ks___quantum.__flow_id_u offset");
_Static_assert(offsetof(struct ks___quantum, __q_len) == 0x10, "ks___quantum.__q_len offset");
_Static_assert(offsetof(struct ks___quantum, __q_svc_class) == 0x14, "ks___quantum.__q_svc_class offset");
_Static_assert(offsetof(struct ks___quantum, __q_flags) == 0x18, "ks___quantum.__q_flags offset");
_Static_assert(offsetof(struct ks___quantum, __q_pad) == 0x1A, "ks___quantum.__q_pad offset");
_Static_assert(sizeof(struct ks___quantum) == 0x20, "ks___quantum size");

/* refs: 3 */
struct ks___kern_quantum {
    struct ks___quantum qum_com __attribute__((aligned(8)));
    struct {
        struct ks___kern_quantum *sle_next;
    } qum_upp_link;
    const struct ks_kern_pbufpool *qum_pp;
    const struct ks___user_quantum *qum_user;
    const struct ks___kern_slot_desc *qum_ksd;
    struct ks___kern_buflet qum_buf[1];
    int qum_pid;
} __attribute__((aligned(8)));
_Static_assert(offsetof(struct ks___kern_quantum, qum_com) == 0x0, "ks___kern_quantum.qum_com offset");
_Static_assert(offsetof(struct ks___kern_quantum, qum_upp_link) == 0x20, "ks___kern_quantum.qum_upp_link offset");
_Static_assert(offsetof(struct ks___kern_quantum, qum_pp) == 0x28, "ks___kern_quantum.qum_pp offset");
_Static_assert(offsetof(struct ks___kern_quantum, qum_user) == 0x30, "ks___kern_quantum.qum_user offset");
_Static_assert(offsetof(struct ks___kern_quantum, qum_ksd) == 0x38, "ks___kern_quantum.qum_ksd offset");
_Static_assert(offsetof(struct ks___kern_quantum, qum_buf) == 0x40, "ks___kern_quantum.qum_buf offset");
_Static_assert(offsetof(struct ks___kern_quantum, qum_pid) == 0x74, "ks___kern_quantum.qum_pid offset");
_Static_assert(sizeof(struct ks___kern_quantum) == 0x78, "ks___kern_quantum size");

/* refs: 1 */
struct ks___packet_com {
    unsigned short __link_flags;
    unsigned char __headroom;
    unsigned char __l2_len;
    unsigned int __csum_flags;
    union {
        struct {
            unsigned short __csum_start_off;
            unsigned short __csum_value;
        } __csum_rx;
        struct {
            unsigned short __csum_start_off;
            unsigned short __csum_stuff_off;
        } __csum_tx;
        unsigned int __csum_data;
    };
    unsigned int __comp_gencnt;
    unsigned int __trace_id;
    unsigned char __aggr_type;
    unsigned char __seg_cnt;
    unsigned short __proto_seg_sz;
    union {
        unsigned int __flags32[2];
        unsigned long long __flags;
    };
} __attribute__((aligned(8)));
_Static_assert(offsetof(struct ks___packet_com, __link_flags) == 0x0, "ks___packet_com.__link_flags offset");
_Static_assert(offsetof(struct ks___packet_com, __headroom) == 0x2, "ks___packet_com.__headroom offset");
_Static_assert(offsetof(struct ks___packet_com, __l2_len) == 0x3, "ks___packet_com.__l2_len offset");
_Static_assert(offsetof(struct ks___packet_com, __csum_flags) == 0x4, "ks___packet_com.__csum_flags offset");
_Static_assert(offsetof(struct ks___packet_com, __comp_gencnt) == 0xC, "ks___packet_com.__comp_gencnt offset");
_Static_assert(offsetof(struct ks___packet_com, __trace_id) == 0x10, "ks___packet_com.__trace_id offset");
_Static_assert(offsetof(struct ks___packet_com, __aggr_type) == 0x14, "ks___packet_com.__aggr_type offset");
_Static_assert(offsetof(struct ks___packet_com, __seg_cnt) == 0x15, "ks___packet_com.__seg_cnt offset");
_Static_assert(offsetof(struct ks___packet_com, __proto_seg_sz) == 0x16, "ks___packet_com.__proto_seg_sz offset");
_Static_assert(sizeof(struct ks___packet_com) == 0x20, "ks___packet_com size");

/* refs: 1 */
struct ks___packet {
    union {
        unsigned long long __pkt_data[4];
        struct ks___packet_com __pkt_com __attribute__((aligned(8)));
    };
};
_Static_assert(sizeof(struct ks___packet) == 0x20, "ks___packet size");

/* refs: 5 */
struct ks___kern_packet {
    struct ks___kern_quantum pkt_qum __attribute__((aligned(8)));
    struct ks___packet pkt_com;
    struct ks___packet_opt *pkt_com_opt;
    unsigned long long pkt_timestamp;
    struct ks___kern_packet *pkt_nextpkt;
    union {
        struct ks_mbuf *pkt_mbuf;
        struct ks___kern_packet *pkt_pkt;
    };
    struct ks___flow *pkt_flow;
    struct ks___packet_compl *pkt_tx_compl;
    void *pkt_priv;
    unsigned int pkt_fpd_seqnum;
    unsigned short pkt_fpd_metadata;
    unsigned short pkt_bufs_max;
    unsigned short pkt_bufs_cnt;
    unsigned int pkt_chain_count;
    unsigned int pkt_chain_bytes;
    unsigned short pkt_nx_port;
    unsigned short pkt_vpna_gencnt;
    unsigned short pkt_trace_tag;
    unsigned char pkt_qset_idx;
    unsigned char _pad[1];
} __attribute__((aligned(8)));
_Static_assert(offsetof(struct ks___kern_packet, pkt_qum) == 0x0, "ks___kern_packet.pkt_qum offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_com) == 0x78, "ks___kern_packet.pkt_com offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_com_opt) == 0x98, "ks___kern_packet.pkt_com_opt offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_timestamp) == 0xA0, "ks___kern_packet.pkt_timestamp offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_nextpkt) == 0xA8, "ks___kern_packet.pkt_nextpkt offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_flow) == 0xB8, "ks___kern_packet.pkt_flow offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_tx_compl) == 0xC0, "ks___kern_packet.pkt_tx_compl offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_priv) == 0xC8, "ks___kern_packet.pkt_priv offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_fpd_seqnum) == 0xD0, "ks___kern_packet.pkt_fpd_seqnum offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_fpd_metadata) == 0xD4, "ks___kern_packet.pkt_fpd_metadata offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_bufs_max) == 0xD6, "ks___kern_packet.pkt_bufs_max offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_bufs_cnt) == 0xD8, "ks___kern_packet.pkt_bufs_cnt offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_chain_count) == 0xDC, "ks___kern_packet.pkt_chain_count offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_chain_bytes) == 0xE0, "ks___kern_packet.pkt_chain_bytes offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_nx_port) == 0xE4, "ks___kern_packet.pkt_nx_port offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_vpna_gencnt) == 0xE6, "ks___kern_packet.pkt_vpna_gencnt offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_trace_tag) == 0xE8, "ks___kern_packet.pkt_trace_tag offset");
_Static_assert(offsetof(struct ks___kern_packet, pkt_qset_idx) == 0xEA, "ks___kern_packet.pkt_qset_idx offset");
_Static_assert(offsetof(struct ks___kern_packet, _pad) == 0xEB, "ks___kern_packet._pad offset");
_Static_assert(sizeof(struct ks___kern_packet) == 0xF0, "ks___kern_packet size");

/* refs: 1 */
struct ks___kern_slot_desc {
    union {
        struct ks___kern_quantum *sd_qum;
        struct ks___kern_packet *sd_pkt;
        struct ks___kern_buflet *sd_buf;
        void *sd_md;
    };
};
_Static_assert(sizeof(struct ks___kern_slot_desc) == 0x8, "ks___kern_slot_desc size");

/* refs: 1 */
struct ks___packet_compl {
    union {
        unsigned long long compl_data64[3];
        struct {
            unsigned long _cb_arg;
            unsigned long _cb_data;
            unsigned int _tx_status;
            unsigned int _pad;
        } compl_data;
    };
    unsigned char compl_callbacks;
    unsigned int compl_context;
};
_Static_assert(offsetof(struct ks___packet_compl, compl_callbacks) == 0x18, "ks___packet_compl.compl_callbacks offset");
_Static_assert(offsetof(struct ks___packet_compl, compl_context) == 0x1C, "ks___packet_compl.compl_context offset");
_Static_assert(sizeof(struct ks___packet_compl) == 0x20, "ks___packet_compl size");

/* refs: 1 */
struct ks___packet_opt_com {
    union {
        unsigned long long __token_data[2];
        unsigned char __token[0x10];
    };
    unsigned long long __expire_ts;
    unsigned long long __pkt_tx_time;
    unsigned short __vlan_tag;
    unsigned short __token_len;
    unsigned char __token_type;
    unsigned char __expiry_action;
    unsigned char __app_type;
    unsigned char __app_metadata;
} __attribute__((aligned(8)));
_Static_assert(offsetof(struct ks___packet_opt_com, __expire_ts) == 0x10, "ks___packet_opt_com.__expire_ts offset");
_Static_assert(offsetof(struct ks___packet_opt_com, __pkt_tx_time) == 0x18, "ks___packet_opt_com.__pkt_tx_time offset");
_Static_assert(offsetof(struct ks___packet_opt_com, __vlan_tag) == 0x20, "ks___packet_opt_com.__vlan_tag offset");
_Static_assert(offsetof(struct ks___packet_opt_com, __token_len) == 0x22, "ks___packet_opt_com.__token_len offset");
_Static_assert(offsetof(struct ks___packet_opt_com, __token_type) == 0x24, "ks___packet_opt_com.__token_type offset");
_Static_assert(offsetof(struct ks___packet_opt_com, __expiry_action) == 0x25, "ks___packet_opt_com.__expiry_action offset");
_Static_assert(offsetof(struct ks___packet_opt_com, __app_type) == 0x26, "ks___packet_opt_com.__app_type offset");
_Static_assert(offsetof(struct ks___packet_opt_com, __app_metadata) == 0x27, "ks___packet_opt_com.__app_metadata offset");
_Static_assert(sizeof(struct ks___packet_opt_com) == 0x28, "ks___packet_opt_com size");

/* refs: 1 */
struct ks___packet_opt {
    union {
        unsigned long long __pkt_opt_data[5];
        struct ks___packet_opt_com __pkt_opt_com __attribute__((aligned(8)));
    };
};
_Static_assert(sizeof(struct ks___packet_opt) == 0x28, "ks___packet_opt size");

/* refs: 1 */
union ks_sigval {
    int sival_int;
    void *sival_ptr;
};
_Static_assert(offsetof(union ks_sigval, sival_int) == 0x0, "ks_sigval.sival_int offset");
_Static_assert(offsetof(union ks_sigval, sival_ptr) == 0x0, "ks_sigval.sival_ptr offset");

/* refs: 2 */
struct ks___siginfo {
    int si_signo;
    int si_errno;
    int si_code;
    int si_pid;
    unsigned int si_uid;
    int si_status;
    void *si_addr;
    union ks_sigval si_value;
    long si_band;
    unsigned long __pad[7];
};
_Static_assert(offsetof(struct ks___siginfo, si_signo) == 0x0, "ks___siginfo.si_signo offset");
_Static_assert(offsetof(struct ks___siginfo, si_errno) == 0x4, "ks___siginfo.si_errno offset");
_Static_assert(offsetof(struct ks___siginfo, si_code) == 0x8, "ks___siginfo.si_code offset");
_Static_assert(offsetof(struct ks___siginfo, si_pid) == 0xC, "ks___siginfo.si_pid offset");
_Static_assert(offsetof(struct ks___siginfo, si_uid) == 0x10, "ks___siginfo.si_uid offset");
_Static_assert(offsetof(struct ks___siginfo, si_status) == 0x14, "ks___siginfo.si_status offset");
_Static_assert(offsetof(struct ks___siginfo, si_addr) == 0x18, "ks___siginfo.si_addr offset");
_Static_assert(offsetof(struct ks___siginfo, si_value) == 0x20, "ks___siginfo.si_value offset");
_Static_assert(offsetof(struct ks___siginfo, si_band) == 0x28, "ks___siginfo.si_band offset");
_Static_assert(offsetof(struct ks___siginfo, __pad) == 0x30, "ks___siginfo.__pad offset");
_Static_assert(sizeof(struct ks___siginfo) == 0x68, "ks___siginfo size");

/* refs: 1 */
struct ks___user_slot_desc {
    unsigned int sd_md_idx;
    unsigned short sd_flags;
    unsigned short sd_len;
};
_Static_assert(offsetof(struct ks___user_slot_desc, sd_md_idx) == 0x0, "ks___user_slot_desc.sd_md_idx offset");
_Static_assert(offsetof(struct ks___user_slot_desc, sd_flags) == 0x4, "ks___user_slot_desc.sd_flags offset");
_Static_assert(offsetof(struct ks___user_slot_desc, sd_len) == 0x6, "ks___user_slot_desc.sd_len offset");
_Static_assert(sizeof(struct ks___user_slot_desc) == 0x8, "ks___user_slot_desc size");

/* refs: 5 */
struct ks___slot_desc {
    union {
        struct ks___user_slot_desc _sd_user;
        unsigned long long _sd_private[1];
    };
};
_Static_assert(sizeof(struct ks___slot_desc) == 0x8, "ks___slot_desc size");

/* refs: 3 */
struct ks___smrq_link_t {
    volatile struct ks_smrq_link *__smr_ptr;
};
_Static_assert(offsetof(struct ks___smrq_link_t, __smr_ptr) == 0x0, "ks___smrq_link_t.__smr_ptr offset");
_Static_assert(sizeof(struct ks___smrq_link_t) == 0x8, "ks___smrq_link_t size");

/* refs: 3 */
struct ks___smrq_slink_t {
    volatile struct ks_smrq_slink *__smr_ptr;
};
_Static_assert(offsetof(struct ks___smrq_slink_t, __smr_ptr) == 0x0, "ks___smrq_slink_t.__smr_ptr offset");
_Static_assert(sizeof(struct ks___smrq_slink_t) == 0x8, "ks___smrq_slink_t size");

/* refs: 1 */
struct ks___sockaddr_header {
    unsigned char sa_len;
    unsigned char sa_family;
};
_Static_assert(offsetof(struct ks___sockaddr_header, sa_len) == 0x0, "ks___sockaddr_header.sa_len offset");
_Static_assert(offsetof(struct ks___sockaddr_header, sa_family) == 0x1, "ks___sockaddr_header.sa_family offset");
_Static_assert(sizeof(struct ks___sockaddr_header) == 0x2, "ks___sockaddr_header size");

/* refs: 1 */
struct ks___tds {
    unsigned char _t_dtrace_on;
    unsigned char _t_dtrace_step;
    unsigned char _t_dtrace_ret;
    unsigned char _t_dtrace_ast;
    unsigned char _t_dtrace_reg;
};
_Static_assert(offsetof(struct ks___tds, _t_dtrace_on) == 0x0, "ks___tds._t_dtrace_on offset");
_Static_assert(offsetof(struct ks___tds, _t_dtrace_step) == 0x1, "ks___tds._t_dtrace_step offset");
_Static_assert(offsetof(struct ks___tds, _t_dtrace_ret) == 0x2, "ks___tds._t_dtrace_ret offset");
_Static_assert(offsetof(struct ks___tds, _t_dtrace_ast) == 0x3, "ks___tds._t_dtrace_ast offset");
_Static_assert(offsetof(struct ks___tds, _t_dtrace_reg) == 0x4, "ks___tds._t_dtrace_reg offset");
_Static_assert(sizeof(struct ks___tds) == 0x5, "ks___tds size");

/* refs: 1 */
struct ks___user_buflet {
    struct ks___buflet buf_com;
};
_Static_assert(offsetof(struct ks___user_buflet, buf_com) == 0x0, "ks___user_buflet.buf_com offset");
_Static_assert(sizeof(struct ks___user_buflet) == 0x2A, "ks___user_buflet size");

/* refs: 2 */
struct ks___user_channel_ring {
    unsigned int ring_head;
    unsigned int ring_tail;
    unsigned int ring_khead;
    unsigned int ring_num_slots;
    unsigned int ring_def_buf_size;
    unsigned int ring_large_buf_size;
    unsigned short ring_md_size;
    unsigned short ring_bft_size;
    unsigned short ring_id;
    unsigned short ring_kind;
    unsigned long long ring_def_buf_base __attribute__((aligned(8)));
    unsigned long long ring_large_buf_base __attribute__((aligned(8)));
    unsigned long long ring_md_base __attribute__((aligned(8)));
    unsigned long long ring_sd_base __attribute__((aligned(8)));
    unsigned long long ring_bft_base __attribute__((aligned(8)));
    unsigned long long ring_sync_time __attribute__((aligned(8)));
    unsigned long long ring_notify_time __attribute__((aligned(8)));
    unsigned int ring_alloc_ws;
    unsigned int ring_alloc_buf_ws;
};
_Static_assert(offsetof(struct ks___user_channel_ring, ring_head) == 0x0, "ks___user_channel_ring.ring_head offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_tail) == 0x4, "ks___user_channel_ring.ring_tail offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_khead) == 0x8, "ks___user_channel_ring.ring_khead offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_num_slots) == 0xC, "ks___user_channel_ring.ring_num_slots offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_def_buf_size) == 0x10, "ks___user_channel_ring.ring_def_buf_size offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_large_buf_size) == 0x14, "ks___user_channel_ring.ring_large_buf_size offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_md_size) == 0x18, "ks___user_channel_ring.ring_md_size offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_bft_size) == 0x1A, "ks___user_channel_ring.ring_bft_size offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_id) == 0x1C, "ks___user_channel_ring.ring_id offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_kind) == 0x1E, "ks___user_channel_ring.ring_kind offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_def_buf_base) == 0x20, "ks___user_channel_ring.ring_def_buf_base offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_large_buf_base) == 0x28, "ks___user_channel_ring.ring_large_buf_base offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_md_base) == 0x30, "ks___user_channel_ring.ring_md_base offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_sd_base) == 0x38, "ks___user_channel_ring.ring_sd_base offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_bft_base) == 0x40, "ks___user_channel_ring.ring_bft_base offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_sync_time) == 0x48, "ks___user_channel_ring.ring_sync_time offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_notify_time) == 0x50, "ks___user_channel_ring.ring_notify_time offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_alloc_ws) == 0x58, "ks___user_channel_ring.ring_alloc_ws offset");
_Static_assert(offsetof(struct ks___user_channel_ring, ring_alloc_buf_ws) == 0x5C, "ks___user_channel_ring.ring_alloc_buf_ws offset");
_Static_assert(sizeof(struct ks___user_channel_ring) == 0x60, "ks___user_channel_ring size");

/* refs: 1 */
struct ks___user_quantum {
    struct ks___quantum qum_com __attribute__((aligned(8)));
    struct ks___user_buflet qum_buf[1];
    unsigned short qum_usecnt;
} __attribute__((aligned(8)));
_Static_assert(offsetof(struct ks___user_quantum, qum_com) == 0x0, "ks___user_quantum.qum_com offset");
_Static_assert(offsetof(struct ks___user_quantum, qum_buf) == 0x20, "ks___user_quantum.qum_buf offset");
_Static_assert(offsetof(struct ks___user_quantum, qum_usecnt) == 0x4A, "ks___user_quantum.qum_usecnt offset");
_Static_assert(sizeof(struct ks___user_quantum) == 0x50, "ks___user_quantum size");

/* refs: 1 */
struct ks__bsdthread_terminate {
    unsigned long long ulock_addr;
    unsigned int kport;
};
_Static_assert(offsetof(struct ks__bsdthread_terminate, ulock_addr) == 0x0, "ks__bsdthread_terminate.ulock_addr offset");
_Static_assert(offsetof(struct ks__bsdthread_terminate, kport) == 0x8, "ks__bsdthread_terminate.kport offset");
_Static_assert(sizeof(struct ks__bsdthread_terminate) == 0x10, "ks__bsdthread_terminate size");

/* refs: 2 */
struct ks__cpu_time_qos_stats {
    unsigned long long cpu_time_qos_default;
    unsigned long long cpu_time_qos_maintenance;
    unsigned long long cpu_time_qos_background;
    unsigned long long cpu_time_qos_utility;
    unsigned long long cpu_time_qos_legacy;
    unsigned long long cpu_time_qos_user_initiated;
    unsigned long long cpu_time_qos_user_interactive;
};
_Static_assert(offsetof(struct ks__cpu_time_qos_stats, cpu_time_qos_default) == 0x0, "ks__cpu_time_qos_stats.cpu_time_qos_default offset");
_Static_assert(offsetof(struct ks__cpu_time_qos_stats, cpu_time_qos_maintenance) == 0x8, "ks__cpu_time_qos_stats.cpu_time_qos_maintenance offset");
_Static_assert(offsetof(struct ks__cpu_time_qos_stats, cpu_time_qos_background) == 0x10, "ks__cpu_time_qos_stats.cpu_time_qos_background offset");
_Static_assert(offsetof(struct ks__cpu_time_qos_stats, cpu_time_qos_utility) == 0x18, "ks__cpu_time_qos_stats.cpu_time_qos_utility offset");
_Static_assert(offsetof(struct ks__cpu_time_qos_stats, cpu_time_qos_legacy) == 0x20, "ks__cpu_time_qos_stats.cpu_time_qos_legacy offset");
_Static_assert(offsetof(struct ks__cpu_time_qos_stats, cpu_time_qos_user_initiated) == 0x28, "ks__cpu_time_qos_stats.cpu_time_qos_user_initiated offset");
_Static_assert(offsetof(struct ks__cpu_time_qos_stats, cpu_time_qos_user_interactive) == 0x30, "ks__cpu_time_qos_stats.cpu_time_qos_user_interactive offset");
_Static_assert(sizeof(struct ks__cpu_time_qos_stats) == 0x38, "ks__cpu_time_qos_stats size");

/* refs: 1 */
struct ks__exec_data {
    struct ks_image_params *imgp;
};
_Static_assert(offsetof(struct ks__exec_data, imgp) == 0x0, "ks__exec_data.imgp offset");
_Static_assert(sizeof(struct ks__exec_data) == 0x8, "ks__exec_data size");

/* refs: 1 */
struct ks__kauth {
    unsigned long long message;
};
_Static_assert(offsetof(struct ks__kauth, message) == 0x0, "ks__kauth.message offset");
_Static_assert(sizeof(struct ks__kauth) == 0x8, "ks__kauth size");

/* refs: 1 */
struct ks_kevent_qos_s {
    unsigned long long ident;
    short filter;
    unsigned short flags;
    int qos;
    unsigned long long udata;
    unsigned int fflags;
    unsigned int xflags;
    long long data;
    unsigned long long ext[4];
};
_Static_assert(offsetof(struct ks_kevent_qos_s, ident) == 0x0, "ks_kevent_qos_s.ident offset");
_Static_assert(offsetof(struct ks_kevent_qos_s, filter) == 0x8, "ks_kevent_qos_s.filter offset");
_Static_assert(offsetof(struct ks_kevent_qos_s, flags) == 0xA, "ks_kevent_qos_s.flags offset");
_Static_assert(offsetof(struct ks_kevent_qos_s, qos) == 0xC, "ks_kevent_qos_s.qos offset");
_Static_assert(offsetof(struct ks_kevent_qos_s, udata) == 0x10, "ks_kevent_qos_s.udata offset");
_Static_assert(offsetof(struct ks_kevent_qos_s, fflags) == 0x18, "ks_kevent_qos_s.fflags offset");
_Static_assert(offsetof(struct ks_kevent_qos_s, xflags) == 0x1C, "ks_kevent_qos_s.xflags offset");
_Static_assert(offsetof(struct ks_kevent_qos_s, data) == 0x20, "ks_kevent_qos_s.data offset");
_Static_assert(offsetof(struct ks_kevent_qos_s, ext) == 0x28, "ks_kevent_qos_s.ext offset");
_Static_assert(sizeof(struct ks_kevent_qos_s) == 0x48, "ks_kevent_qos_s size");

/* refs: 1 */
struct ks__kevent_register {
    struct ks_kevent_qos_s kev;
    struct ks_thread *handoff_thread;
    struct ks_kqworkloop *kqwl;
    int eventout;
    unsigned long long ueventlist;
};
_Static_assert(offsetof(struct ks__kevent_register, kev) == 0x0, "ks__kevent_register.kev offset");
_Static_assert(offsetof(struct ks__kevent_register, handoff_thread) == 0x48, "ks__kevent_register.handoff_thread offset");
_Static_assert(offsetof(struct ks__kevent_register, kqwl) == 0x50, "ks__kevent_register.kqwl offset");
_Static_assert(offsetof(struct ks__kevent_register, eventout) == 0x58, "ks__kevent_register.eventout offset");
_Static_assert(offsetof(struct ks__kevent_register, ueventlist) == 0x60, "ks__kevent_register.ueventlist offset");
_Static_assert(sizeof(struct ks__kevent_register) == 0x68, "ks__kevent_register size");

/* refs: 11 */
struct ks__lck_grp_stat_ {
    unsigned long long lgs_count;
    unsigned int lgs_enablings;
    unsigned int lgs_probeid;
    unsigned long long lgs_limit;
};
_Static_assert(offsetof(struct ks__lck_grp_stat_, lgs_count) == 0x0, "ks__lck_grp_stat_.lgs_count offset");
_Static_assert(offsetof(struct ks__lck_grp_stat_, lgs_enablings) == 0x8, "ks__lck_grp_stat_.lgs_enablings offset");
_Static_assert(offsetof(struct ks__lck_grp_stat_, lgs_probeid) == 0xC, "ks__lck_grp_stat_.lgs_probeid offset");
_Static_assert(offsetof(struct ks__lck_grp_stat_, lgs_limit) == 0x10, "ks__lck_grp_stat_.lgs_limit offset");
_Static_assert(sizeof(struct ks__lck_grp_stat_) == 0x18, "ks__lck_grp_stat_ size");

/* refs: 2 */
struct ks__lck_grp_stats_ {
    struct ks__lck_grp_stat_ lgss_spin_held;
    struct ks__lck_grp_stat_ lgss_spin_miss;
    struct ks__lck_grp_stat_ lgss_spin_spin;
    struct ks__lck_grp_stat_ lgss_ticket_held;
    struct ks__lck_grp_stat_ lgss_ticket_miss;
    struct ks__lck_grp_stat_ lgss_ticket_spin;
    struct ks__lck_grp_stat_ lgss_mtx_held;
    struct ks__lck_grp_stat_ lgss_mtx_direct_wait;
    struct ks__lck_grp_stat_ lgss_mtx_miss;
    struct ks__lck_grp_stat_ lgss_mtx_wait;
};
_Static_assert(offsetof(struct ks__lck_grp_stats_, lgss_spin_held) == 0x0, "ks__lck_grp_stats_.lgss_spin_held offset");
_Static_assert(offsetof(struct ks__lck_grp_stats_, lgss_spin_miss) == 0x18, "ks__lck_grp_stats_.lgss_spin_miss offset");
_Static_assert(offsetof(struct ks__lck_grp_stats_, lgss_spin_spin) == 0x30, "ks__lck_grp_stats_.lgss_spin_spin offset");
_Static_assert(offsetof(struct ks__lck_grp_stats_, lgss_ticket_held) == 0x48, "ks__lck_grp_stats_.lgss_ticket_held offset");
_Static_assert(offsetof(struct ks__lck_grp_stats_, lgss_ticket_miss) == 0x60, "ks__lck_grp_stats_.lgss_ticket_miss offset");
_Static_assert(offsetof(struct ks__lck_grp_stats_, lgss_ticket_spin) == 0x78, "ks__lck_grp_stats_.lgss_ticket_spin offset");
_Static_assert(offsetof(struct ks__lck_grp_stats_, lgss_mtx_held) == 0x90, "ks__lck_grp_stats_.lgss_mtx_held offset");
_Static_assert(offsetof(struct ks__lck_grp_stats_, lgss_mtx_direct_wait) == 0xA8, "ks__lck_grp_stats_.lgss_mtx_direct_wait offset");
_Static_assert(offsetof(struct ks__lck_grp_stats_, lgss_mtx_miss) == 0xC0, "ks__lck_grp_stats_.lgss_mtx_miss offset");
_Static_assert(offsetof(struct ks__lck_grp_stats_, lgss_mtx_wait) == 0xD8, "ks__lck_grp_stats_.lgss_mtx_wait offset");
_Static_assert(sizeof(struct ks__lck_grp_stats_) == 0xF0, "ks__lck_grp_stats_ size");

/* refs: 6 */
struct ks__lck_grp_ {
    unsigned int lck_grp_refcnt;
    unsigned int lck_grp_attr_id;
    unsigned int lck_grp_spincnt;
    unsigned int lck_grp_ticketcnt;
    unsigned int lck_grp_mtxcnt;
    unsigned int lck_grp_rwcnt;
    char lck_grp_name[0x40];
    struct ks__lck_grp_stats_ lck_grp_stats;
};
_Static_assert(offsetof(struct ks__lck_grp_, lck_grp_refcnt) == 0x0, "ks__lck_grp_.lck_grp_refcnt offset");
_Static_assert(offsetof(struct ks__lck_grp_, lck_grp_attr_id) == 0x4, "ks__lck_grp_.lck_grp_attr_id offset");
_Static_assert(offsetof(struct ks__lck_grp_, lck_grp_spincnt) == 0x8, "ks__lck_grp_.lck_grp_spincnt offset");
_Static_assert(offsetof(struct ks__lck_grp_, lck_grp_ticketcnt) == 0xC, "ks__lck_grp_.lck_grp_ticketcnt offset");
_Static_assert(offsetof(struct ks__lck_grp_, lck_grp_mtxcnt) == 0x10, "ks__lck_grp_.lck_grp_mtxcnt offset");
_Static_assert(offsetof(struct ks__lck_grp_, lck_grp_rwcnt) == 0x14, "ks__lck_grp_.lck_grp_rwcnt offset");
_Static_assert(offsetof(struct ks__lck_grp_, lck_grp_name) == 0x18, "ks__lck_grp_.lck_grp_name offset");
_Static_assert(offsetof(struct ks__lck_grp_, lck_grp_stats) == 0x58, "ks__lck_grp_.lck_grp_stats offset");
_Static_assert(sizeof(struct ks__lck_grp_) == 0x148, "ks__lck_grp_ size");

/* refs: 3 */
struct ks_classq_pkt {
    union {
        struct ks_mbuf *cp_mbuf;
        struct ks___kern_packet *cp_kpkt;
    };
    unsigned int cp_ptype;
};
_Static_assert(offsetof(struct ks_classq_pkt, cp_ptype) == 0x8, "ks_classq_pkt.cp_ptype offset");
_Static_assert(sizeof(struct ks_classq_pkt) == 0x10, "ks_classq_pkt size");

/* refs: 2 */
struct ks__pktsched_pkt_ {
    struct ks_classq_pkt __pkt;
    struct ks_classq_pkt __tail;
    unsigned int __plen;
    unsigned int __pcnt;
};
_Static_assert(offsetof(struct ks__pktsched_pkt_, __pkt) == 0x0, "ks__pktsched_pkt_.__pkt offset");
_Static_assert(offsetof(struct ks__pktsched_pkt_, __tail) == 0x10, "ks__pktsched_pkt_.__tail offset");
_Static_assert(offsetof(struct ks__pktsched_pkt_, __plen) == 0x20, "ks__pktsched_pkt_.__plen offset");
_Static_assert(offsetof(struct ks__pktsched_pkt_, __pcnt) == 0x24, "ks__pktsched_pkt_.__pcnt offset");
_Static_assert(sizeof(struct ks__pktsched_pkt_) == 0x28, "ks__pktsched_pkt_ size");

/* refs: 1 */
struct ks__select {
    unsigned int *ibits;
    unsigned int *obits;
    unsigned int nbytes;
};
_Static_assert(offsetof(struct ks__select, ibits) == 0x0, "ks__select.ibits offset");
_Static_assert(offsetof(struct ks__select, obits) == 0x8, "ks__select.obits offset");
_Static_assert(offsetof(struct ks__select, nbytes) == 0x10, "ks__select.nbytes offset");
_Static_assert(sizeof(struct ks__select) == 0x18, "ks__select size");

/* refs: 1 */
struct ks__select_data {
    unsigned long long abstime;
    int count;
    struct ks_select_nocancel_args *args;
    int *retval;
};
_Static_assert(offsetof(struct ks__select_data, abstime) == 0x0, "ks__select_data.abstime offset");
_Static_assert(offsetof(struct ks__select_data, count) == 0x8, "ks__select_data.count offset");
_Static_assert(offsetof(struct ks__select_data, args) == 0x10, "ks__select_data.args offset");
_Static_assert(offsetof(struct ks__select_data, retval) == 0x18, "ks__select_data.retval offset");
_Static_assert(sizeof(struct ks__select_data) == 0x20, "ks__select_data size");

/* refs: 1 */
struct ks__ulock_wait_data {
    struct ks_ull *ull;
    struct ks_thread *owner_thread;
    struct ks_thread *old_owner;
    int *retval;
    unsigned int flags;
};
_Static_assert(offsetof(struct ks__ulock_wait_data, ull) == 0x0, "ks__ulock_wait_data.ull offset");
_Static_assert(offsetof(struct ks__ulock_wait_data, owner_thread) == 0x8, "ks__ulock_wait_data.owner_thread offset");
_Static_assert(offsetof(struct ks__ulock_wait_data, old_owner) == 0x10, "ks__ulock_wait_data.old_owner offset");
_Static_assert(offsetof(struct ks__ulock_wait_data, retval) == 0x18, "ks__ulock_wait_data.retval offset");
_Static_assert(offsetof(struct ks__ulock_wait_data, flags) == 0x20, "ks__ulock_wait_data.flags offset");
_Static_assert(sizeof(struct ks__ulock_wait_data) == 0x28, "ks__ulock_wait_data size");

/* refs: 2 */
union ks_lck_rw_word_t {
    struct {
        unsigned short shared_count;
        unsigned short interlock : 1; /* bit offset 16 */
        unsigned short priv_excl : 1; /* bit offset 17 */
        unsigned short want_upgrade : 1; /* bit offset 18 */
        unsigned short want_excl : 1; /* bit offset 19 */
        unsigned short r_waiting : 1; /* bit offset 20 */
        unsigned short w_waiting : 1; /* bit offset 21 */
        unsigned short can_sleep : 1; /* bit offset 22 */
        unsigned short _pad2 : 8; /* bit offset 23 */
        unsigned short tag_valid : 1; /* bit offset 31 */
    };
    unsigned int data;
};
_Static_assert(offsetof(union ks_lck_rw_word_t, data) == 0x0, "ks_lck_rw_word_t.data offset");

/* refs: 17 */
struct ks_lck_rw_s {
    unsigned int lck_rw_unused : 24; /* bit offset 0 */
    unsigned int lck_rw_type : 8; /* bit offset 24 */
    unsigned int lck_rw_padding;
    union ks_lck_rw_word_t lck_rw;
    unsigned int lck_rw_owner;
};
_Static_assert(offsetof(struct ks_lck_rw_s, lck_rw_padding) == 0x4, "ks_lck_rw_s.lck_rw_padding offset");
_Static_assert(offsetof(struct ks_lck_rw_s, lck_rw) == 0x8, "ks_lck_rw_s.lck_rw offset");
_Static_assert(offsetof(struct ks_lck_rw_s, lck_rw_owner) == 0xC, "ks_lck_rw_s.lck_rw_owner offset");
_Static_assert(sizeof(struct ks_lck_rw_s) == 0x10, "ks_lck_rw_s size");

/* refs: 1 */
struct ks_rb_head {
    struct ks_vm_map_store *rbh_root;
};
_Static_assert(offsetof(struct ks_rb_head, rbh_root) == 0x0, "ks_rb_head.rbh_root offset");
_Static_assert(sizeof(struct ks_rb_head) == 0x8, "ks_rb_head size");

/* refs: 4 */
struct ks_vm_map_links {
    unsigned long prev : 48; /* bit offset 0 */
    unsigned char vme_zero_wire_count_waiters : 1; /* bit offset 48 */
    struct ks_vm_map_entry *next;
    unsigned long long start;
    unsigned long long end;
};
_Static_assert(offsetof(struct ks_vm_map_links, next) == 0x8, "ks_vm_map_links.next offset");
_Static_assert(offsetof(struct ks_vm_map_links, start) == 0x10, "ks_vm_map_links.start offset");
_Static_assert(offsetof(struct ks_vm_map_links, end) == 0x18, "ks_vm_map_links.end offset");
_Static_assert(sizeof(struct ks_vm_map_links) == 0x20, "ks_vm_map_links size");

/* refs: 1 */
struct ks_vm_map_header {
    struct ks_vm_map_links links;
    int nentries;
    unsigned short page_shift;
    unsigned short entries_pageable : 1; /* bit offset 304 */
    unsigned short __padding : 15; /* bit offset 305 */
    struct ks_rb_head rb_head_store;
};
_Static_assert(offsetof(struct ks_vm_map_header, links) == 0x0, "ks_vm_map_header.links offset");
_Static_assert(offsetof(struct ks_vm_map_header, nentries) == 0x20, "ks_vm_map_header.nentries offset");
_Static_assert(offsetof(struct ks_vm_map_header, page_shift) == 0x24, "ks_vm_map_header.page_shift offset");
_Static_assert(offsetof(struct ks_vm_map_header, rb_head_store) == 0x28, "ks_vm_map_header.rb_head_store offset");
_Static_assert(sizeof(struct ks_vm_map_header) == 0x30, "ks_vm_map_header size");

/* refs: 7 */
struct ks__vm_map {
    struct ks_lck_rw_s lock;
    struct ks_vm_map_header hdr;
    struct ks_pmap *pmap;
    unsigned long long size;
    unsigned long long size_limit;
    unsigned long long data_limit;
    unsigned long long user_wire_limit;
    unsigned long long user_wire_size;
    unsigned int map_refcnt;
    unsigned long long vmu1;
    struct ks_vm_map_entry *hint;
    union {
        struct ks_vm_map_links *vmmap_hole_hint;
        struct ks_vm_map_corpse_footprint_header *vmmap_corpse_footprint;
    } vmmap_u_1;
    union {
        struct ks_vm_map_entry *_first_free;
        struct ks_vm_map_links *_holes;
    } f_s;
    unsigned int wait_for_space : 1; /* bit offset 1216 */
    unsigned int wiring_required : 1; /* bit offset 1217 */
    unsigned int no_zero_fill : 1; /* bit offset 1218 */
    unsigned int mapped_in_other_pmaps : 1; /* bit offset 1219 */
    unsigned int switch_protect : 1; /* bit offset 1220 */
    unsigned int disable_vmentry_reuse : 1; /* bit offset 1221 */
    unsigned int map_disallow_data_exec : 1; /* bit offset 1222 */
    unsigned int holelistenabled : 1; /* bit offset 1223 */
    unsigned int is_nested_map : 1; /* bit offset 1224 */
    unsigned int map_disallow_new_exec : 1; /* bit offset 1225 */
    unsigned int jit_entry_exists : 1; /* bit offset 1226 */
    unsigned int has_corpse_footprint : 1; /* bit offset 1227 */
    unsigned int terminated : 1; /* bit offset 1228 */
    unsigned int is_alien : 1; /* bit offset 1229 */
    unsigned int cs_enforcement : 1; /* bit offset 1230 */
    unsigned int cs_debugged : 1; /* bit offset 1231 */
    unsigned int reserved_regions : 1; /* bit offset 1232 */
    unsigned int single_jit : 1; /* bit offset 1233 */
    unsigned int never_faults : 1; /* bit offset 1234 */
    unsigned int uses_user_ranges : 1; /* bit offset 1235 */
    unsigned int tpro_enforcement : 1; /* bit offset 1236 */
    unsigned int corpse_source : 1; /* bit offset 1237 */
    unsigned int cs_platform_binary : 1; /* bit offset 1238 */
    unsigned int vmmap_sealed : 2; /* bit offset 1239 */
    unsigned int res0 : 1; /* bit offset 1241 */
    unsigned int pad : 6; /* bit offset 1242 */
    unsigned long long timestamp;
    struct ks_task *owning_task;
    const void *serial_id;
};
_Static_assert(offsetof(struct ks__vm_map, lock) == 0x0, "ks__vm_map.lock offset");
_Static_assert(offsetof(struct ks__vm_map, hdr) == 0x10, "ks__vm_map.hdr offset");
_Static_assert(offsetof(struct ks__vm_map, pmap) == 0x40, "ks__vm_map.pmap offset");
_Static_assert(offsetof(struct ks__vm_map, size) == 0x48, "ks__vm_map.size offset");
_Static_assert(offsetof(struct ks__vm_map, size_limit) == 0x50, "ks__vm_map.size_limit offset");
_Static_assert(offsetof(struct ks__vm_map, data_limit) == 0x58, "ks__vm_map.data_limit offset");
_Static_assert(offsetof(struct ks__vm_map, user_wire_limit) == 0x60, "ks__vm_map.user_wire_limit offset");
_Static_assert(offsetof(struct ks__vm_map, user_wire_size) == 0x68, "ks__vm_map.user_wire_size offset");
_Static_assert(offsetof(struct ks__vm_map, map_refcnt) == 0x70, "ks__vm_map.map_refcnt offset");
_Static_assert(offsetof(struct ks__vm_map, vmu1) == 0x78, "ks__vm_map.vmu1 offset");
_Static_assert(offsetof(struct ks__vm_map, hint) == 0x80, "ks__vm_map.hint offset");
_Static_assert(offsetof(struct ks__vm_map, vmmap_u_1) == 0x88, "ks__vm_map.vmmap_u_1 offset");
_Static_assert(offsetof(struct ks__vm_map, f_s) == 0x90, "ks__vm_map.f_s offset");
_Static_assert(offsetof(struct ks__vm_map, timestamp) == 0xA0, "ks__vm_map.timestamp offset");
_Static_assert(offsetof(struct ks__vm_map, owning_task) == 0xA8, "ks__vm_map.owning_task offset");
_Static_assert(offsetof(struct ks__vm_map, serial_id) == 0xB0, "ks__vm_map.serial_id offset");
_Static_assert(sizeof(struct ks__vm_map) == 0xB8, "ks__vm_map size");

/* refs: 2 */
struct ks__vm_object_query_data_ {
    unsigned long long object_id;
    unsigned long long virtual_size;
    unsigned long long resident_size;
    unsigned long long wired_size;
    unsigned long long reusable_size;
    unsigned long long compressed_size;
    struct {
        unsigned long long vo_no_footprint : 1; /* bit offset 0 */
        unsigned long long vo_ledger_tag : 3; /* bit offset 1 */
        unsigned long long purgable : 2; /* bit offset 4 */
    };
};
_Static_assert(offsetof(struct ks__vm_object_query_data_, object_id) == 0x0, "ks__vm_object_query_data_.object_id offset");
_Static_assert(offsetof(struct ks__vm_object_query_data_, virtual_size) == 0x8, "ks__vm_object_query_data_.virtual_size offset");
_Static_assert(offsetof(struct ks__vm_object_query_data_, resident_size) == 0x10, "ks__vm_object_query_data_.resident_size offset");
_Static_assert(offsetof(struct ks__vm_object_query_data_, wired_size) == 0x18, "ks__vm_object_query_data_.wired_size offset");
_Static_assert(offsetof(struct ks__vm_object_query_data_, reusable_size) == 0x20, "ks__vm_object_query_data_.reusable_size offset");
_Static_assert(offsetof(struct ks__vm_object_query_data_, compressed_size) == 0x28, "ks__vm_object_query_data_.compressed_size offset");
_Static_assert(sizeof(struct ks__vm_object_query_data_) == 0x38, "ks__vm_object_query_data_ size");

/* refs: 2 */
struct ks__vmobject_list_output_ {
    unsigned long long entries;
    struct ks__vm_object_query_data_ data[0];
};
_Static_assert(offsetof(struct ks__vmobject_list_output_, entries) == 0x0, "ks__vmobject_list_output_.entries offset");
_Static_assert(offsetof(struct ks__vmobject_list_output_, data) == 0x8, "ks__vmobject_list_output_.data offset");
_Static_assert(sizeof(struct ks__vmobject_list_output_) == 0x8, "ks__vmobject_list_output_ size");

/* refs: 1 */
struct ks__wait4_data {
    struct ks_wait4_nocancel_args *args;
    int *retval;
};
_Static_assert(offsetof(struct ks__wait4_data, args) == 0x0, "ks__wait4_data.args offset");
_Static_assert(offsetof(struct ks__wait4_data, retval) == 0x8, "ks__wait4_data.retval offset");
_Static_assert(sizeof(struct ks__wait4_data) == 0x10, "ks__wait4_data size");

/* refs: 1 */
struct ks__waitid_data {
    struct ks_waitid_nocancel_args *args;
    int *retval;
};
_Static_assert(offsetof(struct ks__waitid_data, args) == 0x0, "ks__waitid_data.args offset");
_Static_assert(offsetof(struct ks__waitid_data, retval) == 0x8, "ks__waitid_data.retval offset");
_Static_assert(sizeof(struct ks__waitid_data) == 0x10, "ks__waitid_data size");

/* refs: 1 */
struct ks__workq_park_data {
    unsigned long long idle_stamp;
    unsigned long long workloop_params;
    unsigned int fulfilled_snapshot;
    unsigned int yields;
    void *thread_request;
    unsigned int upcall_flags;
    _Bool has_stack;
    unsigned char qos;
};
_Static_assert(offsetof(struct ks__workq_park_data, idle_stamp) == 0x0, "ks__workq_park_data.idle_stamp offset");
_Static_assert(offsetof(struct ks__workq_park_data, workloop_params) == 0x8, "ks__workq_park_data.workloop_params offset");
_Static_assert(offsetof(struct ks__workq_park_data, fulfilled_snapshot) == 0x10, "ks__workq_park_data.fulfilled_snapshot offset");
_Static_assert(offsetof(struct ks__workq_park_data, yields) == 0x14, "ks__workq_park_data.yields offset");
_Static_assert(offsetof(struct ks__workq_park_data, thread_request) == 0x18, "ks__workq_park_data.thread_request offset");
_Static_assert(offsetof(struct ks__workq_park_data, upcall_flags) == 0x20, "ks__workq_park_data.upcall_flags offset");
_Static_assert(offsetof(struct ks__workq_park_data, has_stack) == 0x24, "ks__workq_park_data.has_stack offset");
_Static_assert(offsetof(struct ks__workq_park_data, qos) == 0x25, "ks__workq_park_data.qos offset");
_Static_assert(sizeof(struct ks__workq_park_data) == 0x28, "ks__workq_park_data size");

/* refs: 2 */
struct ks_cccbc_ctx {
    unsigned char b[0x10];
} __attribute__((aligned(16)));
_Static_assert(offsetof(struct ks_cccbc_ctx, b) == 0x0, "ks_cccbc_ctx.b offset");
_Static_assert(sizeof(struct ks_cccbc_ctx) == 0x10, "ks_cccbc_ctx size");

/* refs: 2 */
struct ks_aes_encrypt_ctx {
    struct ks_cccbc_ctx ctx[0x12] __attribute__((aligned(16)));
};
_Static_assert(offsetof(struct ks_aes_encrypt_ctx, ctx) == 0x0, "ks_aes_encrypt_ctx.ctx offset");
_Static_assert(sizeof(struct ks_aes_encrypt_ctx) == 0x120, "ks_aes_encrypt_ctx size");

/* refs: 49 */
struct ks_queue_entry {
    struct ks_queue_entry *next;
    struct ks_queue_entry *prev;
};
_Static_assert(offsetof(struct ks_queue_entry, next) == 0x0, "ks_queue_entry.next offset");
_Static_assert(offsetof(struct ks_queue_entry, prev) == 0x8, "ks_queue_entry.prev offset");
_Static_assert(sizeof(struct ks_queue_entry) == 0x10, "ks_queue_entry size");

/* refs: 1 */
struct ks_affinity_space {
    struct ks_lck_mtx_s aspc_lock;
    unsigned int aspc_task_count;
    struct ks_queue_entry aspc_affinities;
};
_Static_assert(offsetof(struct ks_affinity_space, aspc_lock) == 0x0, "ks_affinity_space.aspc_lock offset");
_Static_assert(offsetof(struct ks_affinity_space, aspc_task_count) == 0x10, "ks_affinity_space.aspc_task_count offset");
_Static_assert(offsetof(struct ks_affinity_space, aspc_affinities) == 0x18, "ks_affinity_space.aspc_affinities offset");
_Static_assert(sizeof(struct ks_affinity_space) == 0x28, "ks_affinity_space size");

/* refs: 24 */
struct ks_os_refcnt {
    unsigned int ref_count;
};
_Static_assert(offsetof(struct ks_os_refcnt, ref_count) == 0x0, "ks_os_refcnt.ref_count offset");
_Static_assert(sizeof(struct ks_os_refcnt) == 0x4, "ks_os_refcnt size");

/* refs: 1 */
union ks_user_sigval {
    struct {
        unsigned int pad;
        int sival_int;
    } size_equivalent;
    unsigned long long sival_ptr;
};
_Static_assert(offsetof(union ks_user_sigval, size_equivalent) == 0x0, "ks_user_sigval.size_equivalent offset");
_Static_assert(offsetof(union ks_user_sigval, sival_ptr) == 0x0, "ks_user_sigval.sival_ptr offset");

/* refs: 1 */
struct ks_user_sigevent {
    int sigev_notify;
    int sigev_signo;
    union ks_user_sigval sigev_value;
    unsigned long long sigev_notify_function;
    unsigned long long sigev_notify_attributes;
};
_Static_assert(offsetof(struct ks_user_sigevent, sigev_notify) == 0x0, "ks_user_sigevent.sigev_notify offset");
_Static_assert(offsetof(struct ks_user_sigevent, sigev_signo) == 0x4, "ks_user_sigevent.sigev_signo offset");
_Static_assert(offsetof(struct ks_user_sigevent, sigev_value) == 0x8, "ks_user_sigevent.sigev_value offset");
_Static_assert(offsetof(struct ks_user_sigevent, sigev_notify_function) == 0x10, "ks_user_sigevent.sigev_notify_function offset");
_Static_assert(offsetof(struct ks_user_sigevent, sigev_notify_attributes) == 0x18, "ks_user_sigevent.sigev_notify_attributes offset");
_Static_assert(sizeof(struct ks_user_sigevent) == 0x20, "ks_user_sigevent size");

/* refs: 1 */
struct ks_user_aiocb {
    int aio_fildes;
    long long aio_offset;
    unsigned long long aio_buf;
    unsigned long long aio_nbytes;
    int aio_reqprio;
    struct ks_user_sigevent aio_sigevent;
    int aio_lio_opcode;
};
_Static_assert(offsetof(struct ks_user_aiocb, aio_fildes) == 0x0, "ks_user_aiocb.aio_fildes offset");
_Static_assert(offsetof(struct ks_user_aiocb, aio_offset) == 0x8, "ks_user_aiocb.aio_offset offset");
_Static_assert(offsetof(struct ks_user_aiocb, aio_buf) == 0x10, "ks_user_aiocb.aio_buf offset");
_Static_assert(offsetof(struct ks_user_aiocb, aio_nbytes) == 0x18, "ks_user_aiocb.aio_nbytes offset");
_Static_assert(offsetof(struct ks_user_aiocb, aio_reqprio) == 0x20, "ks_user_aiocb.aio_reqprio offset");
_Static_assert(offsetof(struct ks_user_aiocb, aio_sigevent) == 0x28, "ks_user_aiocb.aio_sigevent offset");
_Static_assert(offsetof(struct ks_user_aiocb, aio_lio_opcode) == 0x48, "ks_user_aiocb.aio_lio_opcode offset");
_Static_assert(sizeof(struct ks_user_aiocb) == 0x50, "ks_user_aiocb size");

/* refs: 4 */
struct ks_vfs_context {
    struct ks_thread *vc_thread;
    struct ks_ucred *vc_ucred;
};
_Static_assert(offsetof(struct ks_vfs_context, vc_thread) == 0x0, "ks_vfs_context.vc_thread offset");
_Static_assert(offsetof(struct ks_vfs_context, vc_ucred) == 0x8, "ks_vfs_context.vc_ucred offset");
_Static_assert(sizeof(struct ks_vfs_context) == 0x10, "ks_vfs_context size");

/* refs: 10 */
struct ks_aio_workq_entry {
    struct {
        struct ks_aio_workq_entry *tqe_next;
        struct ks_aio_workq_entry **tqe_prev;
    } aio_workq_link;
    struct {
        struct ks_aio_workq_entry *tqe_next;
        struct ks_aio_workq_entry **tqe_prev;
    } aio_proc_link;
    long long returnval;
    int errorval;
    struct ks_os_refcnt aio_refcount;
    unsigned int flags;
    int lio_pending;
    struct ks_aio_workq_entry *lio_leader;
    struct ks_proc *procp;
    unsigned long long uaiocbp;
    struct ks_user_aiocb aiocb;
    struct ks_vfs_context context;
    struct ks__vm_map *aio_map;
};
_Static_assert(offsetof(struct ks_aio_workq_entry, aio_workq_link) == 0x0, "ks_aio_workq_entry.aio_workq_link offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, aio_proc_link) == 0x10, "ks_aio_workq_entry.aio_proc_link offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, returnval) == 0x20, "ks_aio_workq_entry.returnval offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, errorval) == 0x28, "ks_aio_workq_entry.errorval offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, aio_refcount) == 0x2C, "ks_aio_workq_entry.aio_refcount offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, flags) == 0x30, "ks_aio_workq_entry.flags offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, lio_pending) == 0x34, "ks_aio_workq_entry.lio_pending offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, lio_leader) == 0x38, "ks_aio_workq_entry.lio_leader offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, procp) == 0x40, "ks_aio_workq_entry.procp offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, uaiocbp) == 0x48, "ks_aio_workq_entry.uaiocbp offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, aiocb) == 0x50, "ks_aio_workq_entry.aiocb offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, context) == 0xA0, "ks_aio_workq_entry.context offset");
_Static_assert(offsetof(struct ks_aio_workq_entry, aio_map) == 0xB0, "ks_aio_workq_entry.aio_map offset");
_Static_assert(sizeof(struct ks_aio_workq_entry) == 0xB8, "ks_aio_workq_entry size");

/* refs: 2 */
struct ks_arm64_uexc_region_t {
    unsigned long long start;
    unsigned long long end;
    unsigned long long handler;
    unsigned long long refcon;
};
_Static_assert(offsetof(struct ks_arm64_uexc_region_t, start) == 0x0, "ks_arm64_uexc_region_t.start offset");
_Static_assert(offsetof(struct ks_arm64_uexc_region_t, end) == 0x8, "ks_arm64_uexc_region_t.end offset");
_Static_assert(offsetof(struct ks_arm64_uexc_region_t, handler) == 0x10, "ks_arm64_uexc_region_t.handler offset");
_Static_assert(offsetof(struct ks_arm64_uexc_region_t, refcon) == 0x18, "ks_arm64_uexc_region_t.refcon offset");
_Static_assert(sizeof(struct ks_arm64_uexc_region_t) == 0x20, "ks_arm64_uexc_region_t size");

/* refs: 2 */
struct ks_au_evclass_map {
    unsigned short ec_number;
    unsigned int ec_class;
};
_Static_assert(offsetof(struct ks_au_evclass_map, ec_number) == 0x0, "ks_au_evclass_map.ec_number offset");
_Static_assert(offsetof(struct ks_au_evclass_map, ec_class) == 0x4, "ks_au_evclass_map.ec_class offset");
_Static_assert(sizeof(struct ks_au_evclass_map) == 0x8, "ks_au_evclass_map size");

/* refs: 2 */
struct ks_au_expire_after {
    long age;
    unsigned long size;
    unsigned char op_type;
};
_Static_assert(offsetof(struct ks_au_expire_after, age) == 0x0, "ks_au_expire_after.age offset");
_Static_assert(offsetof(struct ks_au_expire_after, size) == 0x8, "ks_au_expire_after.size offset");
_Static_assert(offsetof(struct ks_au_expire_after, op_type) == 0x10, "ks_au_expire_after.op_type offset");
_Static_assert(sizeof(struct ks_au_expire_after) == 0x18, "ks_au_expire_after size");

/* refs: 1 */
struct ks_au_identity_info {
    unsigned int signer_type;
    char *signing_id;
    unsigned char signing_id_trunc;
    char *team_id;
    unsigned char team_id_trunc;
    unsigned char *cdhash;
    unsigned short cdhash_len;
};
_Static_assert(offsetof(struct ks_au_identity_info, signer_type) == 0x0, "ks_au_identity_info.signer_type offset");
_Static_assert(offsetof(struct ks_au_identity_info, signing_id) == 0x8, "ks_au_identity_info.signing_id offset");
_Static_assert(offsetof(struct ks_au_identity_info, signing_id_trunc) == 0x10, "ks_au_identity_info.signing_id_trunc offset");
_Static_assert(offsetof(struct ks_au_identity_info, team_id) == 0x18, "ks_au_identity_info.team_id offset");
_Static_assert(offsetof(struct ks_au_identity_info, team_id_trunc) == 0x20, "ks_au_identity_info.team_id_trunc offset");
_Static_assert(offsetof(struct ks_au_identity_info, cdhash) == 0x28, "ks_au_identity_info.cdhash offset");
_Static_assert(offsetof(struct ks_au_identity_info, cdhash_len) == 0x30, "ks_au_identity_info.cdhash_len offset");
_Static_assert(sizeof(struct ks_au_identity_info) == 0x38, "ks_au_identity_info size");

/* refs: 9 */
struct ks_au_mask {
    unsigned int am_success;
    unsigned int am_failure;
};
_Static_assert(offsetof(struct ks_au_mask, am_success) == 0x0, "ks_au_mask.am_success offset");
_Static_assert(offsetof(struct ks_au_mask, am_failure) == 0x4, "ks_au_mask.am_failure offset");
_Static_assert(sizeof(struct ks_au_mask) == 0x8, "ks_au_mask size");

/* refs: 2 */
struct ks_au_qctrl {
    int aq_hiwater;
    int aq_lowater;
    int aq_bufsz;
    int aq_delay;
    int aq_minfree;
};
_Static_assert(offsetof(struct ks_au_qctrl, aq_hiwater) == 0x0, "ks_au_qctrl.aq_hiwater offset");
_Static_assert(offsetof(struct ks_au_qctrl, aq_lowater) == 0x4, "ks_au_qctrl.aq_lowater offset");
_Static_assert(offsetof(struct ks_au_qctrl, aq_bufsz) == 0x8, "ks_au_qctrl.aq_bufsz offset");
_Static_assert(offsetof(struct ks_au_qctrl, aq_delay) == 0xC, "ks_au_qctrl.aq_delay offset");
_Static_assert(offsetof(struct ks_au_qctrl, aq_minfree) == 0x10, "ks_au_qctrl.aq_minfree offset");
_Static_assert(sizeof(struct ks_au_qctrl) == 0x14, "ks_au_qctrl size");

/* refs: 2 */
struct ks_au_qctrl64 {
    unsigned long long aq64_hiwater;
    unsigned long long aq64_lowater;
    unsigned long long aq64_bufsz;
    unsigned long long aq64_delay;
    long long aq64_minfree;
};
_Static_assert(offsetof(struct ks_au_qctrl64, aq64_hiwater) == 0x0, "ks_au_qctrl64.aq64_hiwater offset");
_Static_assert(offsetof(struct ks_au_qctrl64, aq64_lowater) == 0x8, "ks_au_qctrl64.aq64_lowater offset");
_Static_assert(offsetof(struct ks_au_qctrl64, aq64_bufsz) == 0x10, "ks_au_qctrl64.aq64_bufsz offset");
_Static_assert(offsetof(struct ks_au_qctrl64, aq64_delay) == 0x18, "ks_au_qctrl64.aq64_delay offset");
_Static_assert(offsetof(struct ks_au_qctrl64, aq64_minfree) == 0x20, "ks_au_qctrl64.aq64_minfree offset");
_Static_assert(sizeof(struct ks_au_qctrl64) == 0x28, "ks_au_qctrl64 size");

/* refs: 1 */
struct ks_au_session {
    struct ks_auditinfo_addr *as_aia_p;
    struct ks_au_mask as_mask;
};
_Static_assert(offsetof(struct ks_au_session, as_aia_p) == 0x0, "ks_au_session.as_aia_p offset");
_Static_assert(offsetof(struct ks_au_session, as_mask) == 0x8, "ks_au_session.as_mask offset");
_Static_assert(sizeof(struct ks_au_session) == 0x10, "ks_au_session size");

/* refs: 5 */
struct ks_au_tid {
    int port;
    unsigned int machine;
};
_Static_assert(offsetof(struct ks_au_tid, port) == 0x0, "ks_au_tid.port offset");
_Static_assert(offsetof(struct ks_au_tid, machine) == 0x4, "ks_au_tid.machine offset");
_Static_assert(sizeof(struct ks_au_tid) == 0x8, "ks_au_tid size");

/* refs: 5 */
struct ks_au_tid_addr {
    int at_port;
    unsigned int at_type;
    unsigned int at_addr[4];
};
_Static_assert(offsetof(struct ks_au_tid_addr, at_port) == 0x0, "ks_au_tid_addr.at_port offset");
_Static_assert(offsetof(struct ks_au_tid_addr, at_type) == 0x4, "ks_au_tid_addr.at_type offset");
_Static_assert(offsetof(struct ks_au_tid_addr, at_addr) == 0x8, "ks_au_tid_addr.at_addr offset");
_Static_assert(sizeof(struct ks_au_tid_addr) == 0x18, "ks_au_tid_addr size");

/* refs: 2 */
struct ks_audit_fstat {
    unsigned long long af_filesz;
    unsigned long long af_currsz;
};
_Static_assert(offsetof(struct ks_audit_fstat, af_filesz) == 0x0, "ks_audit_fstat.af_filesz offset");
_Static_assert(offsetof(struct ks_audit_fstat, af_currsz) == 0x8, "ks_audit_fstat.af_currsz offset");
_Static_assert(sizeof(struct ks_audit_fstat) == 0x10, "ks_audit_fstat size");

/* refs: 1 */
struct ks_groupset {
    unsigned int gidset[0x10];
    unsigned int gidset_size;
};
_Static_assert(offsetof(struct ks_groupset, gidset) == 0x0, "ks_groupset.gidset offset");
_Static_assert(offsetof(struct ks_groupset, gidset_size) == 0x40, "ks_groupset.gidset_size offset");
_Static_assert(sizeof(struct ks_groupset) == 0x44, "ks_groupset size");

/* refs: 1 */
struct ks_ipc_perm {
    unsigned int uid;
    unsigned int gid;
    unsigned int cuid;
    unsigned int cgid;
    unsigned short mode;
    unsigned short _seq;
    int _key;
} __attribute__((aligned(4)));
_Static_assert(offsetof(struct ks_ipc_perm, uid) == 0x0, "ks_ipc_perm.uid offset");
_Static_assert(offsetof(struct ks_ipc_perm, gid) == 0x4, "ks_ipc_perm.gid offset");
_Static_assert(offsetof(struct ks_ipc_perm, cuid) == 0x8, "ks_ipc_perm.cuid offset");
_Static_assert(offsetof(struct ks_ipc_perm, cgid) == 0xC, "ks_ipc_perm.cgid offset");
_Static_assert(offsetof(struct ks_ipc_perm, mode) == 0x10, "ks_ipc_perm.mode offset");
_Static_assert(offsetof(struct ks_ipc_perm, _seq) == 0x12, "ks_ipc_perm._seq offset");
_Static_assert(offsetof(struct ks_ipc_perm, _key) == 0x14, "ks_ipc_perm._key offset");
_Static_assert(sizeof(struct ks_ipc_perm) == 0x18, "ks_ipc_perm size");

/* refs: 1 */
struct ks_posix_ipc_perm {
    unsigned int pipc_uid;
    unsigned int pipc_gid;
    unsigned short pipc_mode;
};
_Static_assert(offsetof(struct ks_posix_ipc_perm, pipc_uid) == 0x0, "ks_posix_ipc_perm.pipc_uid offset");
_Static_assert(offsetof(struct ks_posix_ipc_perm, pipc_gid) == 0x4, "ks_posix_ipc_perm.pipc_gid offset");
_Static_assert(offsetof(struct ks_posix_ipc_perm, pipc_mode) == 0x8, "ks_posix_ipc_perm.pipc_mode offset");
_Static_assert(sizeof(struct ks_posix_ipc_perm) == 0xC, "ks_posix_ipc_perm size");

/* refs: 3 */
struct ks_sockaddr_storage {
    unsigned char ss_len;
    unsigned char ss_family;
    char __ss_pad1[6];
    long long __ss_align;
    char __ss_pad2[0x70];
};
_Static_assert(offsetof(struct ks_sockaddr_storage, ss_len) == 0x0, "ks_sockaddr_storage.ss_len offset");
_Static_assert(offsetof(struct ks_sockaddr_storage, ss_family) == 0x1, "ks_sockaddr_storage.ss_family offset");
_Static_assert(offsetof(struct ks_sockaddr_storage, __ss_pad1) == 0x2, "ks_sockaddr_storage.__ss_pad1 offset");
_Static_assert(offsetof(struct ks_sockaddr_storage, __ss_align) == 0x8, "ks_sockaddr_storage.__ss_align offset");
_Static_assert(offsetof(struct ks_sockaddr_storage, __ss_pad2) == 0x10, "ks_sockaddr_storage.__ss_pad2 offset");
_Static_assert(sizeof(struct ks_sockaddr_storage) == 0x80, "ks_sockaddr_storage size");

/* refs: 1 */
struct ks_socket_au_info {
    int sai_domain;
    int sai_type;
    int sai_protocol;
    struct ks_sockaddr_storage sai_faddr;
    struct ks_sockaddr_storage sai_laddr;
};
_Static_assert(offsetof(struct ks_socket_au_info, sai_domain) == 0x0, "ks_socket_au_info.sai_domain offset");
_Static_assert(offsetof(struct ks_socket_au_info, sai_type) == 0x4, "ks_socket_au_info.sai_type offset");
_Static_assert(offsetof(struct ks_socket_au_info, sai_protocol) == 0x8, "ks_socket_au_info.sai_protocol offset");
_Static_assert(offsetof(struct ks_socket_au_info, sai_faddr) == 0x10, "ks_socket_au_info.sai_faddr offset");
_Static_assert(offsetof(struct ks_socket_au_info, sai_laddr) == 0x90, "ks_socket_au_info.sai_laddr offset");
_Static_assert(sizeof(struct ks_socket_au_info) == 0x110, "ks_socket_au_info size");

/* refs: 21 */
struct ks_timespec {
    long tv_sec;
    long tv_nsec;
};
_Static_assert(offsetof(struct ks_timespec, tv_sec) == 0x0, "ks_timespec.tv_sec offset");
_Static_assert(offsetof(struct ks_timespec, tv_nsec) == 0x8, "ks_timespec.tv_nsec offset");
_Static_assert(sizeof(struct ks_timespec) == 0x10, "ks_timespec size");

/* refs: 2 */
struct ks_vnode_au_info {
    unsigned short vn_mode;
    unsigned int vn_uid;
    unsigned int vn_gid;
    int vn_dev;
    long vn_fsid;
    long vn_fileid;
    long vn_gen;
};
_Static_assert(offsetof(struct ks_vnode_au_info, vn_mode) == 0x0, "ks_vnode_au_info.vn_mode offset");
_Static_assert(offsetof(struct ks_vnode_au_info, vn_uid) == 0x4, "ks_vnode_au_info.vn_uid offset");
_Static_assert(offsetof(struct ks_vnode_au_info, vn_gid) == 0x8, "ks_vnode_au_info.vn_gid offset");
_Static_assert(offsetof(struct ks_vnode_au_info, vn_dev) == 0xC, "ks_vnode_au_info.vn_dev offset");
_Static_assert(offsetof(struct ks_vnode_au_info, vn_fsid) == 0x10, "ks_vnode_au_info.vn_fsid offset");
_Static_assert(offsetof(struct ks_vnode_au_info, vn_fileid) == 0x18, "ks_vnode_au_info.vn_fileid offset");
_Static_assert(offsetof(struct ks_vnode_au_info, vn_gen) == 0x20, "ks_vnode_au_info.vn_gen offset");
_Static_assert(sizeof(struct ks_vnode_au_info) == 0x28, "ks_vnode_au_info size");

/* refs: 1 */
struct ks_xucred {
    unsigned int cr_version;
    unsigned int cr_uid;
    short cr_ngroups;
    unsigned int cr_groups[0x10];
};
_Static_assert(offsetof(struct ks_xucred, cr_version) == 0x0, "ks_xucred.cr_version offset");
_Static_assert(offsetof(struct ks_xucred, cr_uid) == 0x4, "ks_xucred.cr_uid offset");
_Static_assert(offsetof(struct ks_xucred, cr_ngroups) == 0x8, "ks_xucred.cr_ngroups offset");
_Static_assert(offsetof(struct ks_xucred, cr_groups) == 0xC, "ks_xucred.cr_groups offset");
_Static_assert(sizeof(struct ks_xucred) == 0x4C, "ks_xucred size");

/* refs: 2 */
struct ks_audit_stat {
    unsigned int as_version;
    unsigned int as_numevent;
    int as_generated;
    int as_nonattrib;
    int as_kernel;
    int as_audit;
    int as_auditctl;
    int as_enqueue;
    int as_written;
    int as_wblocked;
    int as_rblocked;
    int as_dropped;
    int as_totalsize;
    unsigned int as_memused;
};
_Static_assert(offsetof(struct ks_audit_stat, as_version) == 0x0, "ks_audit_stat.as_version offset");
_Static_assert(offsetof(struct ks_audit_stat, as_numevent) == 0x4, "ks_audit_stat.as_numevent offset");
_Static_assert(offsetof(struct ks_audit_stat, as_generated) == 0x8, "ks_audit_stat.as_generated offset");
_Static_assert(offsetof(struct ks_audit_stat, as_nonattrib) == 0xC, "ks_audit_stat.as_nonattrib offset");
_Static_assert(offsetof(struct ks_audit_stat, as_kernel) == 0x10, "ks_audit_stat.as_kernel offset");
_Static_assert(offsetof(struct ks_audit_stat, as_audit) == 0x14, "ks_audit_stat.as_audit offset");
_Static_assert(offsetof(struct ks_audit_stat, as_auditctl) == 0x18, "ks_audit_stat.as_auditctl offset");
_Static_assert(offsetof(struct ks_audit_stat, as_enqueue) == 0x1C, "ks_audit_stat.as_enqueue offset");
_Static_assert(offsetof(struct ks_audit_stat, as_written) == 0x20, "ks_audit_stat.as_written offset");
_Static_assert(offsetof(struct ks_audit_stat, as_wblocked) == 0x24, "ks_audit_stat.as_wblocked offset");
_Static_assert(offsetof(struct ks_audit_stat, as_rblocked) == 0x28, "ks_audit_stat.as_rblocked offset");
_Static_assert(offsetof(struct ks_audit_stat, as_dropped) == 0x2C, "ks_audit_stat.as_dropped offset");
_Static_assert(offsetof(struct ks_audit_stat, as_totalsize) == 0x30, "ks_audit_stat.as_totalsize offset");
_Static_assert(offsetof(struct ks_audit_stat, as_memused) == 0x34, "ks_audit_stat.as_memused offset");
_Static_assert(sizeof(struct ks_audit_stat) == 0x38, "ks_audit_stat size");

/* refs: 2 */
struct ks_auditinfo {
    unsigned int ai_auid;
    struct ks_au_mask ai_mask;
    struct ks_au_tid ai_termid;
    int ai_asid;
};
_Static_assert(offsetof(struct ks_auditinfo, ai_auid) == 0x0, "ks_auditinfo.ai_auid offset");
_Static_assert(offsetof(struct ks_auditinfo, ai_mask) == 0x4, "ks_auditinfo.ai_mask offset");
_Static_assert(offsetof(struct ks_auditinfo, ai_termid) == 0xC, "ks_auditinfo.ai_termid offset");
_Static_assert(offsetof(struct ks_auditinfo, ai_asid) == 0x14, "ks_auditinfo.ai_asid offset");
_Static_assert(sizeof(struct ks_auditinfo) == 0x18, "ks_auditinfo size");

/* refs: 3 */
struct ks_auditinfo_addr {
    unsigned int ai_auid;
    struct ks_au_mask ai_mask;
    struct ks_au_tid_addr ai_termid;
    int ai_asid;
    unsigned long long ai_flags __attribute__((aligned(8)));
};
_Static_assert(offsetof(struct ks_auditinfo_addr, ai_auid) == 0x0, "ks_auditinfo_addr.ai_auid offset");
_Static_assert(offsetof(struct ks_auditinfo_addr, ai_mask) == 0x4, "ks_auditinfo_addr.ai_mask offset");
_Static_assert(offsetof(struct ks_auditinfo_addr, ai_termid) == 0xC, "ks_auditinfo_addr.ai_termid offset");
_Static_assert(offsetof(struct ks_auditinfo_addr, ai_asid) == 0x24, "ks_auditinfo_addr.ai_asid offset");
_Static_assert(offsetof(struct ks_auditinfo_addr, ai_flags) == 0x28, "ks_auditinfo_addr.ai_flags offset");
_Static_assert(sizeof(struct ks_auditinfo_addr) == 0x30, "ks_auditinfo_addr size");

/* refs: 2 */
struct ks_auditpinfo {
    int ap_pid;
    unsigned int ap_auid;
    struct ks_au_mask ap_mask;
    struct ks_au_tid ap_termid;
    int ap_asid;
};
_Static_assert(offsetof(struct ks_auditpinfo, ap_pid) == 0x0, "ks_auditpinfo.ap_pid offset");
_Static_assert(offsetof(struct ks_auditpinfo, ap_auid) == 0x4, "ks_auditpinfo.ap_auid offset");
_Static_assert(offsetof(struct ks_auditpinfo, ap_mask) == 0x8, "ks_auditpinfo.ap_mask offset");
_Static_assert(offsetof(struct ks_auditpinfo, ap_termid) == 0x10, "ks_auditpinfo.ap_termid offset");
_Static_assert(offsetof(struct ks_auditpinfo, ap_asid) == 0x18, "ks_auditpinfo.ap_asid offset");
_Static_assert(sizeof(struct ks_auditpinfo) == 0x1C, "ks_auditpinfo size");

/* refs: 2 */
struct ks_auditpinfo_addr {
    int ap_pid;
    unsigned int ap_auid;
    struct ks_au_mask ap_mask;
    struct ks_au_tid_addr ap_termid;
    int ap_asid;
    unsigned long long ap_flags __attribute__((aligned(8)));
};
_Static_assert(offsetof(struct ks_auditpinfo_addr, ap_pid) == 0x0, "ks_auditpinfo_addr.ap_pid offset");
_Static_assert(offsetof(struct ks_auditpinfo_addr, ap_auid) == 0x4, "ks_auditpinfo_addr.ap_auid offset");
_Static_assert(offsetof(struct ks_auditpinfo_addr, ap_mask) == 0x8, "ks_auditpinfo_addr.ap_mask offset");
_Static_assert(offsetof(struct ks_auditpinfo_addr, ap_termid) == 0x10, "ks_auditpinfo_addr.ap_termid offset");
_Static_assert(offsetof(struct ks_auditpinfo_addr, ap_asid) == 0x28, "ks_auditpinfo_addr.ap_asid offset");
_Static_assert(offsetof(struct ks_auditpinfo_addr, ap_flags) == 0x30, "ks_auditpinfo_addr.ap_flags offset");
_Static_assert(sizeof(struct ks_auditpinfo_addr) == 0x38, "ks_auditpinfo_addr size");

/* refs: 1 */
union ks_auditon_udata {
    char *au_path;
    int au_cond;
    int au_policy;
    long long au_cond64;
    long long au_policy64;
    int au_trigger;
    struct ks_au_evclass_map au_evclass;
    struct ks_au_mask au_mask;
    unsigned long long au_flags __attribute__((aligned(8)));
    struct ks_auditinfo au_auinfo;
    struct ks_auditpinfo au_aupinfo;
    struct ks_auditpinfo_addr au_aupinfo_addr;
    struct ks_au_qctrl au_qctrl;
    struct ks_au_qctrl64 au_qctrl64;
    struct ks_audit_stat au_stat;
    struct ks_audit_fstat au_fstat;
    struct ks_auditinfo_addr au_kau_info;
    unsigned char au_ctl_mode;
    struct ks_au_expire_after au_expire_after;
};
_Static_assert(offsetof(union ks_auditon_udata, au_path) == 0x0, "ks_auditon_udata.au_path offset");
_Static_assert(offsetof(union ks_auditon_udata, au_cond) == 0x0, "ks_auditon_udata.au_cond offset");
_Static_assert(offsetof(union ks_auditon_udata, au_policy) == 0x0, "ks_auditon_udata.au_policy offset");
_Static_assert(offsetof(union ks_auditon_udata, au_cond64) == 0x0, "ks_auditon_udata.au_cond64 offset");
_Static_assert(offsetof(union ks_auditon_udata, au_policy64) == 0x0, "ks_auditon_udata.au_policy64 offset");
_Static_assert(offsetof(union ks_auditon_udata, au_trigger) == 0x0, "ks_auditon_udata.au_trigger offset");
_Static_assert(offsetof(union ks_auditon_udata, au_evclass) == 0x0, "ks_auditon_udata.au_evclass offset");
_Static_assert(offsetof(union ks_auditon_udata, au_mask) == 0x0, "ks_auditon_udata.au_mask offset");
_Static_assert(offsetof(union ks_auditon_udata, au_flags) == 0x0, "ks_auditon_udata.au_flags offset");
_Static_assert(offsetof(union ks_auditon_udata, au_auinfo) == 0x0, "ks_auditon_udata.au_auinfo offset");
_Static_assert(offsetof(union ks_auditon_udata, au_aupinfo) == 0x0, "ks_auditon_udata.au_aupinfo offset");
_Static_assert(offsetof(union ks_auditon_udata, au_aupinfo_addr) == 0x0, "ks_auditon_udata.au_aupinfo_addr offset");
_Static_assert(offsetof(union ks_auditon_udata, au_qctrl) == 0x0, "ks_auditon_udata.au_qctrl offset");
_Static_assert(offsetof(union ks_auditon_udata, au_qctrl64) == 0x0, "ks_auditon_udata.au_qctrl64 offset");
_Static_assert(offsetof(union ks_auditon_udata, au_stat) == 0x0, "ks_auditon_udata.au_stat offset");
_Static_assert(offsetof(union ks_auditon_udata, au_fstat) == 0x0, "ks_auditon_udata.au_fstat offset");
_Static_assert(offsetof(union ks_auditon_udata, au_kau_info) == 0x0, "ks_auditon_udata.au_kau_info offset");
_Static_assert(offsetof(union ks_auditon_udata, au_ctl_mode) == 0x0, "ks_auditon_udata.au_ctl_mode offset");
_Static_assert(offsetof(union ks_auditon_udata, au_expire_after) == 0x0, "ks_auditon_udata.au_expire_after offset");

/* refs: 1 */
struct ks_audit_record {
    unsigned int ar_magic;
    int ar_event;
    int ar_retval;
    int ar_errno;
    struct ks_timespec ar_starttime;
    struct ks_timespec ar_endtime;
    unsigned long long ar_valid_arg;
    struct ks_xucred ar_subj_cred;
    unsigned int ar_subj_ruid;
    unsigned int ar_subj_rgid;
    unsigned int ar_subj_egid;
    unsigned int ar_subj_auid;
    int ar_subj_asid;
    int ar_subj_pid;
    struct ks_au_tid ar_subj_term;
    struct ks_au_tid_addr ar_subj_term_addr;
    struct ks_au_mask ar_subj_amask;
    unsigned int ar_arg_euid;
    unsigned int ar_arg_ruid;
    unsigned int ar_arg_suid;
    unsigned int ar_arg_egid;
    unsigned int ar_arg_rgid;
    unsigned int ar_arg_sgid;
    int ar_arg_pid;
    int ar_arg_asid;
    struct ks_au_tid ar_arg_termid;
    struct ks_au_tid_addr ar_arg_termid_addr;
    unsigned int ar_arg_uid;
    unsigned int ar_arg_auid;
    unsigned int ar_arg_gid;
    struct ks_groupset ar_arg_groups;
    int ar_arg_fd;
    int ar_arg_fflags;
    unsigned short ar_arg_mode;
    unsigned int ar_arg_value32;
    unsigned long long ar_arg_value64;
    unsigned long long ar_arg_addr;
    unsigned long long ar_arg_len;
    int ar_arg_mask;
    unsigned int ar_arg_signum;
    char ar_arg_login[0xFF];
    int ar_arg_ctlname[12];
    struct ks_socket_au_info ar_arg_sockinfo;
    char *ar_arg_upath1;
    char *ar_arg_upath2;
    char *ar_arg_kpath1;
    char *ar_arg_kpath2;
    char *ar_vnode1_mac_labels;
    char *ar_vnode2_mac_labels;
    char *ar_cred_mac_labels;
    char *ar_arg_mac_string;
    char *ar_arg_text;
    void *ar_arg_opaque;
    void *ar_arg_data;
    unsigned short ar_arg_opq_size;
    unsigned char ar_arg_data_type;
    unsigned char ar_arg_data_count;
    struct ks_au_mask ar_arg_amask;
    struct ks_vnode_au_info ar_arg_vnode1;
    struct ks_vnode_au_info ar_arg_vnode2;
    int ar_arg_cmd;
    int ar_arg_svipc_cmd;
    struct ks_ipc_perm ar_arg_svipc_perm __attribute__((aligned(4)));
    int ar_arg_svipc_id;
    unsigned long long ar_arg_svipc_addr;
    struct ks_posix_ipc_perm ar_arg_pipc_perm;
    unsigned int ar_arg_mach_port1;
    unsigned int ar_arg_mach_port2;
    union ks_auditon_udata ar_arg_auditon;
    char *ar_arg_argv;
    int ar_arg_argc;
    char *ar_arg_envv;
    int ar_arg_envc;
    int ar_arg_exitstatus;
    int ar_arg_exitretval;
    struct ks_sockaddr_storage ar_arg_sockaddr;
    int ar_arg_fd2;
    struct ks_mac_audit_record_list_t *ar_mac_records;
    int ar_forced_by_mac;
    struct ks_au_identity_info ar_arg_identity;
};
_Static_assert(offsetof(struct ks_audit_record, ar_magic) == 0x0, "ks_audit_record.ar_magic offset");
_Static_assert(offsetof(struct ks_audit_record, ar_event) == 0x4, "ks_audit_record.ar_event offset");
_Static_assert(offsetof(struct ks_audit_record, ar_retval) == 0x8, "ks_audit_record.ar_retval offset");
_Static_assert(offsetof(struct ks_audit_record, ar_errno) == 0xC, "ks_audit_record.ar_errno offset");
_Static_assert(offsetof(struct ks_audit_record, ar_starttime) == 0x10, "ks_audit_record.ar_starttime offset");
_Static_assert(offsetof(struct ks_audit_record, ar_endtime) == 0x20, "ks_audit_record.ar_endtime offset");
_Static_assert(offsetof(struct ks_audit_record, ar_valid_arg) == 0x30, "ks_audit_record.ar_valid_arg offset");
_Static_assert(offsetof(struct ks_audit_record, ar_subj_cred) == 0x38, "ks_audit_record.ar_subj_cred offset");
_Static_assert(offsetof(struct ks_audit_record, ar_subj_ruid) == 0x84, "ks_audit_record.ar_subj_ruid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_subj_rgid) == 0x88, "ks_audit_record.ar_subj_rgid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_subj_egid) == 0x8C, "ks_audit_record.ar_subj_egid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_subj_auid) == 0x90, "ks_audit_record.ar_subj_auid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_subj_asid) == 0x94, "ks_audit_record.ar_subj_asid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_subj_pid) == 0x98, "ks_audit_record.ar_subj_pid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_subj_term) == 0x9C, "ks_audit_record.ar_subj_term offset");
_Static_assert(offsetof(struct ks_audit_record, ar_subj_term_addr) == 0xA4, "ks_audit_record.ar_subj_term_addr offset");
_Static_assert(offsetof(struct ks_audit_record, ar_subj_amask) == 0xBC, "ks_audit_record.ar_subj_amask offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_euid) == 0xC4, "ks_audit_record.ar_arg_euid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_ruid) == 0xC8, "ks_audit_record.ar_arg_ruid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_suid) == 0xCC, "ks_audit_record.ar_arg_suid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_egid) == 0xD0, "ks_audit_record.ar_arg_egid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_rgid) == 0xD4, "ks_audit_record.ar_arg_rgid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_sgid) == 0xD8, "ks_audit_record.ar_arg_sgid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_pid) == 0xDC, "ks_audit_record.ar_arg_pid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_asid) == 0xE0, "ks_audit_record.ar_arg_asid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_termid) == 0xE4, "ks_audit_record.ar_arg_termid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_termid_addr) == 0xEC, "ks_audit_record.ar_arg_termid_addr offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_uid) == 0x104, "ks_audit_record.ar_arg_uid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_auid) == 0x108, "ks_audit_record.ar_arg_auid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_gid) == 0x10C, "ks_audit_record.ar_arg_gid offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_groups) == 0x110, "ks_audit_record.ar_arg_groups offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_fd) == 0x154, "ks_audit_record.ar_arg_fd offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_fflags) == 0x158, "ks_audit_record.ar_arg_fflags offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_mode) == 0x15C, "ks_audit_record.ar_arg_mode offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_value32) == 0x160, "ks_audit_record.ar_arg_value32 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_value64) == 0x168, "ks_audit_record.ar_arg_value64 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_addr) == 0x170, "ks_audit_record.ar_arg_addr offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_len) == 0x178, "ks_audit_record.ar_arg_len offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_mask) == 0x180, "ks_audit_record.ar_arg_mask offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_signum) == 0x184, "ks_audit_record.ar_arg_signum offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_login) == 0x188, "ks_audit_record.ar_arg_login offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_ctlname) == 0x288, "ks_audit_record.ar_arg_ctlname offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_sockinfo) == 0x2B8, "ks_audit_record.ar_arg_sockinfo offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_upath1) == 0x3C8, "ks_audit_record.ar_arg_upath1 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_upath2) == 0x3D0, "ks_audit_record.ar_arg_upath2 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_kpath1) == 0x3D8, "ks_audit_record.ar_arg_kpath1 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_kpath2) == 0x3E0, "ks_audit_record.ar_arg_kpath2 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_vnode1_mac_labels) == 0x3E8, "ks_audit_record.ar_vnode1_mac_labels offset");
_Static_assert(offsetof(struct ks_audit_record, ar_vnode2_mac_labels) == 0x3F0, "ks_audit_record.ar_vnode2_mac_labels offset");
_Static_assert(offsetof(struct ks_audit_record, ar_cred_mac_labels) == 0x3F8, "ks_audit_record.ar_cred_mac_labels offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_mac_string) == 0x400, "ks_audit_record.ar_arg_mac_string offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_text) == 0x408, "ks_audit_record.ar_arg_text offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_opaque) == 0x410, "ks_audit_record.ar_arg_opaque offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_data) == 0x418, "ks_audit_record.ar_arg_data offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_opq_size) == 0x420, "ks_audit_record.ar_arg_opq_size offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_data_type) == 0x422, "ks_audit_record.ar_arg_data_type offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_data_count) == 0x423, "ks_audit_record.ar_arg_data_count offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_amask) == 0x424, "ks_audit_record.ar_arg_amask offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_vnode1) == 0x430, "ks_audit_record.ar_arg_vnode1 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_vnode2) == 0x458, "ks_audit_record.ar_arg_vnode2 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_cmd) == 0x480, "ks_audit_record.ar_arg_cmd offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_svipc_cmd) == 0x484, "ks_audit_record.ar_arg_svipc_cmd offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_svipc_perm) == 0x488, "ks_audit_record.ar_arg_svipc_perm offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_svipc_id) == 0x4A0, "ks_audit_record.ar_arg_svipc_id offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_svipc_addr) == 0x4A8, "ks_audit_record.ar_arg_svipc_addr offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_pipc_perm) == 0x4B0, "ks_audit_record.ar_arg_pipc_perm offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_mach_port1) == 0x4BC, "ks_audit_record.ar_arg_mach_port1 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_mach_port2) == 0x4C0, "ks_audit_record.ar_arg_mach_port2 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_auditon) == 0x4C8, "ks_audit_record.ar_arg_auditon offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_argv) == 0x500, "ks_audit_record.ar_arg_argv offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_argc) == 0x508, "ks_audit_record.ar_arg_argc offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_envv) == 0x510, "ks_audit_record.ar_arg_envv offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_envc) == 0x518, "ks_audit_record.ar_arg_envc offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_exitstatus) == 0x51C, "ks_audit_record.ar_arg_exitstatus offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_exitretval) == 0x520, "ks_audit_record.ar_arg_exitretval offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_sockaddr) == 0x528, "ks_audit_record.ar_arg_sockaddr offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_fd2) == 0x5A8, "ks_audit_record.ar_arg_fd2 offset");
_Static_assert(offsetof(struct ks_audit_record, ar_mac_records) == 0x5B0, "ks_audit_record.ar_mac_records offset");
_Static_assert(offsetof(struct ks_audit_record, ar_forced_by_mac) == 0x5B8, "ks_audit_record.ar_forced_by_mac offset");
_Static_assert(offsetof(struct ks_audit_record, ar_arg_identity) == 0x5C0, "ks_audit_record.ar_arg_identity offset");
_Static_assert(sizeof(struct ks_audit_record) == 0x5F8, "ks_audit_record size");

/* refs: 2 */
struct ks_audit_token_t {
    unsigned int val[8];
} __attribute__((aligned(4)));
_Static_assert(offsetof(struct ks_audit_token_t, val) == 0x0, "ks_audit_token_t.val offset");
_Static_assert(sizeof(struct ks_audit_token_t) == 0x20, "ks_audit_token_t size");

/* refs: 1 */
struct ks_bandwidth {
    unsigned long long rate;
    unsigned long long prev_time_to_send;
};
_Static_assert(offsetof(struct ks_bandwidth, rate) == 0x0, "ks_bandwidth.rate offset");
_Static_assert(offsetof(struct ks_bandwidth, prev_time_to_send) == 0x8, "ks_bandwidth.prev_time_to_send offset");
_Static_assert(sizeof(struct ks_bandwidth) == 0x10, "ks_bandwidth size");

/* refs: 1 */
struct ks_bank_element {
    unsigned int be_type : 31; /* bit offset 0 */
    unsigned int be_voucher_ref : 1; /* bit offset 31 */
    unsigned int be_refs;
    unsigned int be_made;
};
_Static_assert(offsetof(struct ks_bank_element, be_refs) == 0x4, "ks_bank_element.be_refs offset");
_Static_assert(offsetof(struct ks_bank_element, be_made) == 0x8, "ks_bank_element.be_made offset");
_Static_assert(sizeof(struct ks_bank_element) == 0xC, "ks_bank_element size");

/* refs: 1 */
struct ks_proc_persona_info {
    unsigned long long unique_pid;
    int pid;
    unsigned int flags;
    unsigned int pidversion;
    unsigned int persona_id;
    unsigned int uid;
    unsigned int gid;
    unsigned char macho_uuid[0x10];
};
_Static_assert(offsetof(struct ks_proc_persona_info, unique_pid) == 0x0, "ks_proc_persona_info.unique_pid offset");
_Static_assert(offsetof(struct ks_proc_persona_info, pid) == 0x8, "ks_proc_persona_info.pid offset");
_Static_assert(offsetof(struct ks_proc_persona_info, flags) == 0xC, "ks_proc_persona_info.flags offset");
_Static_assert(offsetof(struct ks_proc_persona_info, pidversion) == 0x10, "ks_proc_persona_info.pidversion offset");
_Static_assert(offsetof(struct ks_proc_persona_info, persona_id) == 0x14, "ks_proc_persona_info.persona_id offset");
_Static_assert(offsetof(struct ks_proc_persona_info, uid) == 0x18, "ks_proc_persona_info.uid offset");
_Static_assert(offsetof(struct ks_proc_persona_info, gid) == 0x1C, "ks_proc_persona_info.gid offset");
_Static_assert(offsetof(struct ks_proc_persona_info, macho_uuid) == 0x20, "ks_proc_persona_info.macho_uuid offset");
_Static_assert(sizeof(struct ks_proc_persona_info) == 0x30, "ks_proc_persona_info size");

/* refs: 1 */
struct ks_bank_task {
    struct ks_bank_element bt_elem;
    struct ks_proc_persona_info bt_proc_persona;
    struct ks_ledger *bt_ledger;
    struct ks_queue_entry bt_accounts_to_pay;
    struct ks_queue_entry bt_accounts_to_charge;
    struct ks_lck_mtx_s bt_acc_to_pay_lock;
    struct ks_lck_mtx_s bt_acc_to_charge_lock;
    unsigned int bt_persona_uid;
    unsigned int bt_hasentitlement : 1; /* bit offset 1120 */
    unsigned long long bt_rsrc_coal_id;
    struct ks_thread_group *bt_thread_group;
};
_Static_assert(offsetof(struct ks_bank_task, bt_elem) == 0x0, "ks_bank_task.bt_elem offset");
_Static_assert(offsetof(struct ks_bank_task, bt_proc_persona) == 0x10, "ks_bank_task.bt_proc_persona offset");
_Static_assert(offsetof(struct ks_bank_task, bt_ledger) == 0x40, "ks_bank_task.bt_ledger offset");
_Static_assert(offsetof(struct ks_bank_task, bt_accounts_to_pay) == 0x48, "ks_bank_task.bt_accounts_to_pay offset");
_Static_assert(offsetof(struct ks_bank_task, bt_accounts_to_charge) == 0x58, "ks_bank_task.bt_accounts_to_charge offset");
_Static_assert(offsetof(struct ks_bank_task, bt_acc_to_pay_lock) == 0x68, "ks_bank_task.bt_acc_to_pay_lock offset");
_Static_assert(offsetof(struct ks_bank_task, bt_acc_to_charge_lock) == 0x78, "ks_bank_task.bt_acc_to_charge_lock offset");
_Static_assert(offsetof(struct ks_bank_task, bt_persona_uid) == 0x88, "ks_bank_task.bt_persona_uid offset");
_Static_assert(offsetof(struct ks_bank_task, bt_rsrc_coal_id) == 0x90, "ks_bank_task.bt_rsrc_coal_id offset");
_Static_assert(offsetof(struct ks_bank_task, bt_thread_group) == 0x98, "ks_bank_task.bt_thread_group offset");
_Static_assert(sizeof(struct ks_bank_task) == 0xA0, "ks_bank_task size");

/* refs: 1 */
struct ks_bool_gen {
    unsigned int seed[4];
    unsigned int state;
    struct ks_lck_spin_s lock;
};
_Static_assert(offsetof(struct ks_bool_gen, seed) == 0x0, "ks_bool_gen.seed offset");
_Static_assert(offsetof(struct ks_bool_gen, state) == 0x10, "ks_bool_gen.state offset");
_Static_assert(offsetof(struct ks_bool_gen, lock) == 0x18, "ks_bool_gen.lock offset");
_Static_assert(sizeof(struct ks_bool_gen) == 0x28, "ks_bool_gen size");

/* refs: 1 */
struct ks_bpf_comp_stats {
    unsigned long long bcs_total_read;
    unsigned long long bcs_total_size;
    unsigned long long bcs_total_hdr_size;
    unsigned long long bcs_count_no_common_prefix;
    unsigned long long bcs_count_compressed_prefix;
    unsigned long long bcs_total_compressed_prefix_size;
    unsigned long long bcs_max_compressed_prefix_size;
};
_Static_assert(offsetof(struct ks_bpf_comp_stats, bcs_total_read) == 0x0, "ks_bpf_comp_stats.bcs_total_read offset");
_Static_assert(offsetof(struct ks_bpf_comp_stats, bcs_total_size) == 0x8, "ks_bpf_comp_stats.bcs_total_size offset");
_Static_assert(offsetof(struct ks_bpf_comp_stats, bcs_total_hdr_size) == 0x10, "ks_bpf_comp_stats.bcs_total_hdr_size offset");
_Static_assert(offsetof(struct ks_bpf_comp_stats, bcs_count_no_common_prefix) == 0x18, "ks_bpf_comp_stats.bcs_count_no_common_prefix offset");
_Static_assert(offsetof(struct ks_bpf_comp_stats, bcs_count_compressed_prefix) == 0x20, "ks_bpf_comp_stats.bcs_count_compressed_prefix offset");
_Static_assert(offsetof(struct ks_bpf_comp_stats, bcs_total_compressed_prefix_size) == 0x28, "ks_bpf_comp_stats.bcs_total_compressed_prefix_size offset");
_Static_assert(offsetof(struct ks_bpf_comp_stats, bcs_max_compressed_prefix_size) == 0x30, "ks_bpf_comp_stats.bcs_max_compressed_prefix_size offset");
_Static_assert(sizeof(struct ks_bpf_comp_stats) == 0x38, "ks_bpf_comp_stats size");

/* refs: 1 */
struct ks_bpf_d {
    struct ks_bpf_d *bd_next;
    struct ks___bounds_safety__wide_ptr_bidi_indexable_4 bd_sbuf;
    struct ks___bounds_safety__wide_ptr_bidi_indexable_4 bd_hbuf;
    struct ks___bounds_safety__wide_ptr_bidi_indexable_4 bd_fbuf;
    unsigned int bd_slen;
    unsigned int bd_hlen;
    unsigned int bd_scnt;
    unsigned int bd_hcnt;
    unsigned int bd_bufsize;
    _Bool bd_hbuf_read;
    _Bool bd_hbuf_write;
    _Bool bd_headdrop;
    unsigned int bd_write_size_max;
    unsigned int bd_rtout;
    struct ks_bpf_if *bd_bif;
    struct ks_bpf_insn *bd_filter;
    unsigned int bd_filter_len;
    unsigned long long bd_rcount;
    unsigned long long bd_dcount;
    unsigned long long bd_fcount;
    unsigned long long bd_wcount;
    unsigned long long bd_wdcount;
    unsigned char bd_promisc;
    unsigned char bd_state;
    unsigned char bd_immediate;
    unsigned int bd_dev_minor;
    int bd_async;
    int bd_sig;
    int bd_sigio;
    struct ks_selinfo bd_sel;
    int bd_hdrcmplt;
    unsigned int bd_direction;
    int bd_oflags;
    struct ks_thread_call *bd_thread_call;
    int bd_traffic_class;
    int bd_flags;
    int bd_tstamp;
    int bd_refcnt;
    void *bd_ref_lr[4];
    void *bd_unref_lr[4];
    int bd_next_ref_lr;
    int bd_next_unref_lr;
    struct ks_proc *bd_opened_by;
    unsigned char bd_uuid[0x10];
    int bd_pid;
    unsigned char bd_prev_slen;
    struct ks___bounds_safety__wide_ptr_bidi_indexable_4 bd_prev_sbuf;
    struct ks___bounds_safety__wide_ptr_bidi_indexable_4 bd_prev_fbuf;
    struct ks_bpf_comp_stats bd_bcs;
};
_Static_assert(offsetof(struct ks_bpf_d, bd_next) == 0x0, "ks_bpf_d.bd_next offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_sbuf) == 0x8, "ks_bpf_d.bd_sbuf offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_hbuf) == 0x20, "ks_bpf_d.bd_hbuf offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_fbuf) == 0x38, "ks_bpf_d.bd_fbuf offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_slen) == 0x50, "ks_bpf_d.bd_slen offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_hlen) == 0x54, "ks_bpf_d.bd_hlen offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_scnt) == 0x58, "ks_bpf_d.bd_scnt offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_hcnt) == 0x5C, "ks_bpf_d.bd_hcnt offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_bufsize) == 0x60, "ks_bpf_d.bd_bufsize offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_hbuf_read) == 0x64, "ks_bpf_d.bd_hbuf_read offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_hbuf_write) == 0x65, "ks_bpf_d.bd_hbuf_write offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_headdrop) == 0x66, "ks_bpf_d.bd_headdrop offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_write_size_max) == 0x68, "ks_bpf_d.bd_write_size_max offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_rtout) == 0x6C, "ks_bpf_d.bd_rtout offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_bif) == 0x70, "ks_bpf_d.bd_bif offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_filter) == 0x78, "ks_bpf_d.bd_filter offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_filter_len) == 0x80, "ks_bpf_d.bd_filter_len offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_rcount) == 0x88, "ks_bpf_d.bd_rcount offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_dcount) == 0x90, "ks_bpf_d.bd_dcount offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_fcount) == 0x98, "ks_bpf_d.bd_fcount offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_wcount) == 0xA0, "ks_bpf_d.bd_wcount offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_wdcount) == 0xA8, "ks_bpf_d.bd_wdcount offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_promisc) == 0xB0, "ks_bpf_d.bd_promisc offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_state) == 0xB1, "ks_bpf_d.bd_state offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_immediate) == 0xB2, "ks_bpf_d.bd_immediate offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_dev_minor) == 0xB4, "ks_bpf_d.bd_dev_minor offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_async) == 0xB8, "ks_bpf_d.bd_async offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_sig) == 0xBC, "ks_bpf_d.bd_sig offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_sigio) == 0xC0, "ks_bpf_d.bd_sigio offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_sel) == 0xC8, "ks_bpf_d.bd_sel offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_hdrcmplt) == 0x100, "ks_bpf_d.bd_hdrcmplt offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_direction) == 0x104, "ks_bpf_d.bd_direction offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_oflags) == 0x108, "ks_bpf_d.bd_oflags offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_thread_call) == 0x110, "ks_bpf_d.bd_thread_call offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_traffic_class) == 0x118, "ks_bpf_d.bd_traffic_class offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_flags) == 0x11C, "ks_bpf_d.bd_flags offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_tstamp) == 0x120, "ks_bpf_d.bd_tstamp offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_refcnt) == 0x124, "ks_bpf_d.bd_refcnt offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_ref_lr) == 0x128, "ks_bpf_d.bd_ref_lr offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_unref_lr) == 0x148, "ks_bpf_d.bd_unref_lr offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_next_ref_lr) == 0x168, "ks_bpf_d.bd_next_ref_lr offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_next_unref_lr) == 0x16C, "ks_bpf_d.bd_next_unref_lr offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_opened_by) == 0x170, "ks_bpf_d.bd_opened_by offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_uuid) == 0x178, "ks_bpf_d.bd_uuid offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_pid) == 0x188, "ks_bpf_d.bd_pid offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_prev_slen) == 0x18C, "ks_bpf_d.bd_prev_slen offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_prev_sbuf) == 0x190, "ks_bpf_d.bd_prev_sbuf offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_prev_fbuf) == 0x1A8, "ks_bpf_d.bd_prev_fbuf offset");
_Static_assert(offsetof(struct ks_bpf_d, bd_bcs) == 0x1C0, "ks_bpf_d.bd_bcs offset");
_Static_assert(sizeof(struct ks_bpf_d) == 0x1F8, "ks_bpf_d size");

/* refs: 2 */
struct ks_bpf_if {
    struct ks_bpf_if *bif_next;
    struct ks_bpf_d *bif_dlist;
    unsigned int bif_dlt;
    unsigned int bif_hdrlen;
    unsigned int bif_exthdrlen;
    unsigned int bif_comphdrlen;
    struct ks_ifnet *bif_ifp;
    int *bif_send;
    int *bif_tap;
};
_Static_assert(offsetof(struct ks_bpf_if, bif_next) == 0x0, "ks_bpf_if.bif_next offset");
_Static_assert(offsetof(struct ks_bpf_if, bif_dlist) == 0x8, "ks_bpf_if.bif_dlist offset");
_Static_assert(offsetof(struct ks_bpf_if, bif_dlt) == 0x10, "ks_bpf_if.bif_dlt offset");
_Static_assert(offsetof(struct ks_bpf_if, bif_hdrlen) == 0x14, "ks_bpf_if.bif_hdrlen offset");
_Static_assert(offsetof(struct ks_bpf_if, bif_exthdrlen) == 0x18, "ks_bpf_if.bif_exthdrlen offset");
_Static_assert(offsetof(struct ks_bpf_if, bif_comphdrlen) == 0x1C, "ks_bpf_if.bif_comphdrlen offset");
_Static_assert(offsetof(struct ks_bpf_if, bif_ifp) == 0x20, "ks_bpf_if.bif_ifp offset");
_Static_assert(offsetof(struct ks_bpf_if, bif_send) == 0x28, "ks_bpf_if.bif_send offset");
_Static_assert(offsetof(struct ks_bpf_if, bif_tap) == 0x30, "ks_bpf_if.bif_tap offset");
_Static_assert(sizeof(struct ks_bpf_if) == 0x38, "ks_bpf_if size");

/* refs: 2 */
struct ks_bpf_insn {
    unsigned short code;
    unsigned char jt;
    unsigned char jf;
    unsigned int k;
};
_Static_assert(offsetof(struct ks_bpf_insn, code) == 0x0, "ks_bpf_insn.code offset");
_Static_assert(offsetof(struct ks_bpf_insn, jt) == 0x2, "ks_bpf_insn.jt offset");
_Static_assert(offsetof(struct ks_bpf_insn, jf) == 0x3, "ks_bpf_insn.jf offset");
_Static_assert(offsetof(struct ks_bpf_insn, k) == 0x4, "ks_bpf_insn.k offset");
_Static_assert(sizeof(struct ks_bpf_insn) == 0x8, "ks_bpf_insn size");

/* refs: 1 */
struct ks_bufattr {
    struct ks_cpx *ba_cpx;
    unsigned long long ba_cp_file_off;
    unsigned long long ba_flags;
    void *ba_un;
    unsigned int ba_verify_type;
};
_Static_assert(offsetof(struct ks_bufattr, ba_cpx) == 0x0, "ks_bufattr.ba_cpx offset");
_Static_assert(offsetof(struct ks_bufattr, ba_cp_file_off) == 0x8, "ks_bufattr.ba_cp_file_off offset");
_Static_assert(offsetof(struct ks_bufattr, ba_flags) == 0x10, "ks_bufattr.ba_flags offset");
_Static_assert(offsetof(struct ks_bufattr, ba_un) == 0x18, "ks_bufattr.ba_un offset");
_Static_assert(offsetof(struct ks_bufattr, ba_verify_type) == 0x20, "ks_bufattr.ba_verify_type offset");
_Static_assert(sizeof(struct ks_bufattr) == 0x28, "ks_bufattr size");

/* refs: 21 */
struct ks_timeval {
    long tv_sec;
    int tv_usec;
};
_Static_assert(offsetof(struct ks_timeval, tv_sec) == 0x0, "ks_timeval.tv_sec offset");
_Static_assert(offsetof(struct ks_timeval, tv_usec) == 0x8, "ks_timeval.tv_usec offset");
_Static_assert(sizeof(struct ks_timeval) == 0x10, "ks_timeval size");

/* refs: 10 */
struct ks_buf {
    struct {
        struct ks_buf *le_next;
        struct ks_buf **le_prev;
    } b_hash;
    struct {
        struct ks_buf *le_next;
        struct ks_buf **le_prev;
    } b_vnbufs;
    struct {
        struct ks_buf *tqe_next;
        struct ks_buf **tqe_prev;
    } b_freelist;
    int b_timestamp;
    struct ks_timeval b_timestamp_tv;
    int b_whichq;
    unsigned int b_flags;
    unsigned int b_lflags;
    int b_error;
    int b_bufsize;
    int b_bcount;
    int b_resid;
    int b_dev;
    unsigned long b_datap;
    long long b_lblkno;
    long long b_blkno;
    void *b_iodone;
    struct ks_vnode *b_vp;
    struct ks_ucred *b_rcred;
    struct ks_ucred *b_wcred;
    void *b_upl;
    struct ks_buf *b_real_bp;
    struct {
        struct ks_buf *tqe_next;
        struct ks_buf **tqe_prev;
    } b_act;
    void *b_drvdata;
    void *b_fsprivate;
    void *b_transaction;
    int b_dirtyoff;
    int b_dirtyend;
    int b_validoff;
    int b_validend;
    unsigned int b_redundancy_flags;
    struct ks_proc *b_proc;
    struct ks_bufattr b_attr;
    long long b_lblksize;
    struct ks_vnode *b_vnop_vp;
};
_Static_assert(offsetof(struct ks_buf, b_hash) == 0x0, "ks_buf.b_hash offset");
_Static_assert(offsetof(struct ks_buf, b_vnbufs) == 0x10, "ks_buf.b_vnbufs offset");
_Static_assert(offsetof(struct ks_buf, b_freelist) == 0x20, "ks_buf.b_freelist offset");
_Static_assert(offsetof(struct ks_buf, b_timestamp) == 0x30, "ks_buf.b_timestamp offset");
_Static_assert(offsetof(struct ks_buf, b_timestamp_tv) == 0x38, "ks_buf.b_timestamp_tv offset");
_Static_assert(offsetof(struct ks_buf, b_whichq) == 0x48, "ks_buf.b_whichq offset");
_Static_assert(offsetof(struct ks_buf, b_flags) == 0x4C, "ks_buf.b_flags offset");
_Static_assert(offsetof(struct ks_buf, b_lflags) == 0x50, "ks_buf.b_lflags offset");
_Static_assert(offsetof(struct ks_buf, b_error) == 0x54, "ks_buf.b_error offset");
_Static_assert(offsetof(struct ks_buf, b_bufsize) == 0x58, "ks_buf.b_bufsize offset");
_Static_assert(offsetof(struct ks_buf, b_bcount) == 0x5C, "ks_buf.b_bcount offset");
_Static_assert(offsetof(struct ks_buf, b_resid) == 0x60, "ks_buf.b_resid offset");
_Static_assert(offsetof(struct ks_buf, b_dev) == 0x64, "ks_buf.b_dev offset");
_Static_assert(offsetof(struct ks_buf, b_datap) == 0x68, "ks_buf.b_datap offset");
_Static_assert(offsetof(struct ks_buf, b_lblkno) == 0x70, "ks_buf.b_lblkno offset");
_Static_assert(offsetof(struct ks_buf, b_blkno) == 0x78, "ks_buf.b_blkno offset");
_Static_assert(offsetof(struct ks_buf, b_iodone) == 0x80, "ks_buf.b_iodone offset");
_Static_assert(offsetof(struct ks_buf, b_vp) == 0x88, "ks_buf.b_vp offset");
_Static_assert(offsetof(struct ks_buf, b_rcred) == 0x90, "ks_buf.b_rcred offset");
_Static_assert(offsetof(struct ks_buf, b_wcred) == 0x98, "ks_buf.b_wcred offset");
_Static_assert(offsetof(struct ks_buf, b_upl) == 0xA0, "ks_buf.b_upl offset");
_Static_assert(offsetof(struct ks_buf, b_real_bp) == 0xA8, "ks_buf.b_real_bp offset");
_Static_assert(offsetof(struct ks_buf, b_act) == 0xB0, "ks_buf.b_act offset");
_Static_assert(offsetof(struct ks_buf, b_drvdata) == 0xC0, "ks_buf.b_drvdata offset");
_Static_assert(offsetof(struct ks_buf, b_fsprivate) == 0xC8, "ks_buf.b_fsprivate offset");
_Static_assert(offsetof(struct ks_buf, b_transaction) == 0xD0, "ks_buf.b_transaction offset");
_Static_assert(offsetof(struct ks_buf, b_dirtyoff) == 0xD8, "ks_buf.b_dirtyoff offset");
_Static_assert(offsetof(struct ks_buf, b_dirtyend) == 0xDC, "ks_buf.b_dirtyend offset");
_Static_assert(offsetof(struct ks_buf, b_validoff) == 0xE0, "ks_buf.b_validoff offset");
_Static_assert(offsetof(struct ks_buf, b_validend) == 0xE4, "ks_buf.b_validend offset");
_Static_assert(offsetof(struct ks_buf, b_redundancy_flags) == 0xE8, "ks_buf.b_redundancy_flags offset");
_Static_assert(offsetof(struct ks_buf, b_proc) == 0xF0, "ks_buf.b_proc offset");
_Static_assert(offsetof(struct ks_buf, b_attr) == 0xF8, "ks_buf.b_attr offset");
_Static_assert(offsetof(struct ks_buf, b_lblksize) == 0x120, "ks_buf.b_lblksize offset");
_Static_assert(offsetof(struct ks_buf, b_vnop_vp) == 0x128, "ks_buf.b_vnop_vp offset");
_Static_assert(sizeof(struct ks_buf) == 0x130, "ks_buf size");

/* refs: 2 */
struct ks_buflists {
    struct ks_buf *lh_first;
};
_Static_assert(offsetof(struct ks_buflists, lh_first) == 0x0, "ks_buflists.lh_first offset");
_Static_assert(sizeof(struct ks_buflists) == 0x8, "ks_buflists size");

/* refs: 1 */
struct ks_necp_mtag_ {
    unsigned int necp_policy_id;
    unsigned int necp_skip_policy_id;
    unsigned int necp_route_rule_id;
    unsigned short necp_last_interface_index;
    unsigned short necp_app_id;
};
_Static_assert(offsetof(struct ks_necp_mtag_, necp_policy_id) == 0x0, "ks_necp_mtag_.necp_policy_id offset");
_Static_assert(offsetof(struct ks_necp_mtag_, necp_skip_policy_id) == 0x4, "ks_necp_mtag_.necp_skip_policy_id offset");
_Static_assert(offsetof(struct ks_necp_mtag_, necp_route_rule_id) == 0x8, "ks_necp_mtag_.necp_route_rule_id offset");
_Static_assert(offsetof(struct ks_necp_mtag_, necp_last_interface_index) == 0xC, "ks_necp_mtag_.necp_last_interface_index offset");
_Static_assert(offsetof(struct ks_necp_mtag_, necp_app_id) == 0xE, "ks_necp_mtag_.necp_app_id offset");
_Static_assert(sizeof(struct ks_necp_mtag_) == 0x10, "ks_necp_mtag_ size");

/* refs: 1 */
struct ks_pf_mtag {
    unsigned short pftag_flags;
    unsigned short pftag_rtableid;
    unsigned short pftag_tag;
    unsigned short pftag_routed;
};
_Static_assert(offsetof(struct ks_pf_mtag, pftag_flags) == 0x0, "ks_pf_mtag.pftag_flags offset");
_Static_assert(offsetof(struct ks_pf_mtag, pftag_rtableid) == 0x2, "ks_pf_mtag.pftag_rtableid offset");
_Static_assert(offsetof(struct ks_pf_mtag, pftag_tag) == 0x4, "ks_pf_mtag.pftag_tag offset");
_Static_assert(offsetof(struct ks_pf_mtag, pftag_routed) == 0x6, "ks_pf_mtag.pftag_routed offset");
_Static_assert(sizeof(struct ks_pf_mtag) == 0x8, "ks_pf_mtag size");

/* refs: 1 */
struct ks_rawip_mtag {
    int _pid;
    int _e_pid;
};
_Static_assert(offsetof(struct ks_rawip_mtag, _pid) == 0x0, "ks_rawip_mtag._pid offset");
_Static_assert(offsetof(struct ks_rawip_mtag, _e_pid) == 0x4, "ks_rawip_mtag._e_pid offset");
_Static_assert(sizeof(struct ks_rawip_mtag) == 0x8, "ks_rawip_mtag size");

/* refs: 1 */
struct ks_mptcp_pktinfo {
    unsigned long long mtpi_dsn;
    unsigned int mtpi_rel_seq;
    unsigned short mtpi_length;
    unsigned short mtpi_csum;
};
_Static_assert(offsetof(struct ks_mptcp_pktinfo, mtpi_dsn) == 0x0, "ks_mptcp_pktinfo.mtpi_dsn offset");
_Static_assert(offsetof(struct ks_mptcp_pktinfo, mtpi_rel_seq) == 0x8, "ks_mptcp_pktinfo.mtpi_rel_seq offset");
_Static_assert(offsetof(struct ks_mptcp_pktinfo, mtpi_length) == 0xC, "ks_mptcp_pktinfo.mtpi_length offset");
_Static_assert(offsetof(struct ks_mptcp_pktinfo, mtpi_csum) == 0xE, "ks_mptcp_pktinfo.mtpi_csum offset");
_Static_assert(sizeof(struct ks_mptcp_pktinfo) == 0x10, "ks_mptcp_pktinfo size");

/* refs: 1 */
struct ks_tcp_pktinfo {
    union {
        struct {
            unsigned short seg_size;
            unsigned short hdr_len;
            unsigned int start_seq;
            int pid;
            int e_pid;
        } __tx;
        struct {
            unsigned char seg_cnt;
        } __rx;
    } __offload;
};
_Static_assert(offsetof(struct ks_tcp_pktinfo, __offload) == 0x0, "ks_tcp_pktinfo.__offload offset");
_Static_assert(sizeof(struct ks_tcp_pktinfo) == 0x10, "ks_tcp_pktinfo size");

/* refs: 1 */
struct ks_tcp_mtag {
    union {
        struct ks_tcp_pktinfo tm_tcp;
        struct ks_mptcp_pktinfo tm_mptcp;
    };
};
_Static_assert(sizeof(struct ks_tcp_mtag) == 0x10, "ks_tcp_mtag size");

/* refs: 1 */
struct ks_udp_mtag {
    int _pid;
    int _e_pid;
};
_Static_assert(offsetof(struct ks_udp_mtag, _pid) == 0x0, "ks_udp_mtag._pid offset");
_Static_assert(offsetof(struct ks_udp_mtag, _e_pid) == 0x4, "ks_udp_mtag._e_pid offset");
_Static_assert(sizeof(struct ks_udp_mtag) == 0x8, "ks_udp_mtag size");

/* refs: 1 */
struct ks_proto_mtag_ {
    union {
        struct ks_tcp_mtag tcp;
        struct ks_udp_mtag udp;
        struct ks_rawip_mtag rawip;
    } __pr_u;
};
_Static_assert(offsetof(struct ks_proto_mtag_, __pr_u) == 0x0, "ks_proto_mtag_.__pr_u offset");
_Static_assert(sizeof(struct ks_proto_mtag_) == 0x10, "ks_proto_mtag_ size");

/* refs: 1 */
struct ks_ccdigest_info {
    unsigned long output_size;
    unsigned long state_size;
    unsigned long block_size;
    unsigned long oid_size;
    const unsigned char *oid;
    const void *initial_state;
    void *compress;
    void *final;
    unsigned int impl;
    void *compress_parallel;
};
_Static_assert(offsetof(struct ks_ccdigest_info, output_size) == 0x0, "ks_ccdigest_info.output_size offset");
_Static_assert(offsetof(struct ks_ccdigest_info, state_size) == 0x8, "ks_ccdigest_info.state_size offset");
_Static_assert(offsetof(struct ks_ccdigest_info, block_size) == 0x10, "ks_ccdigest_info.block_size offset");
_Static_assert(offsetof(struct ks_ccdigest_info, oid_size) == 0x18, "ks_ccdigest_info.oid_size offset");
_Static_assert(offsetof(struct ks_ccdigest_info, oid) == 0x20, "ks_ccdigest_info.oid offset");
_Static_assert(offsetof(struct ks_ccdigest_info, initial_state) == 0x28, "ks_ccdigest_info.initial_state offset");
_Static_assert(offsetof(struct ks_ccdigest_info, compress) == 0x30, "ks_ccdigest_info.compress offset");
_Static_assert(offsetof(struct ks_ccdigest_info, final) == 0x38, "ks_ccdigest_info.final offset");
_Static_assert(offsetof(struct ks_ccdigest_info, impl) == 0x40, "ks_ccdigest_info.impl offset");
_Static_assert(offsetof(struct ks_ccdigest_info, compress_parallel) == 0x48, "ks_ccdigest_info.compress_parallel offset");
_Static_assert(sizeof(struct ks_ccdigest_info) == 0x50, "ks_ccdigest_info size");

/* refs: 1 */
struct ks_cfil_mqhead {
    struct ks_mbuf *mq_first;
    struct ks_mbuf **mq_last;
};
_Static_assert(offsetof(struct ks_cfil_mqhead, mq_first) == 0x0, "ks_cfil_mqhead.mq_first offset");
_Static_assert(offsetof(struct ks_cfil_mqhead, mq_last) == 0x8, "ks_cfil_mqhead.mq_last offset");
_Static_assert(sizeof(struct ks_cfil_mqhead) == 0x10, "ks_cfil_mqhead size");

/* refs: 3 */
struct ks_cfil_queue {
    unsigned long long q_start;
    unsigned long long q_end;
    struct ks_cfil_mqhead q_mq;
};
_Static_assert(offsetof(struct ks_cfil_queue, q_start) == 0x0, "ks_cfil_queue.q_start offset");
_Static_assert(offsetof(struct ks_cfil_queue, q_end) == 0x8, "ks_cfil_queue.q_end offset");
_Static_assert(offsetof(struct ks_cfil_queue, q_mq) == 0x10, "ks_cfil_queue.q_mq offset");
_Static_assert(sizeof(struct ks_cfil_queue) == 0x20, "ks_cfil_queue size");

/* refs: 2 */
struct ks_cfe_buf {
    struct ks_cfil_queue cfe_pending_q;
    struct ks_cfil_queue cfe_ctl_q;
    unsigned long long cfe_pass_offset;
    unsigned long long cfe_peek_offset;
    unsigned long long cfe_peeked;
};
_Static_assert(offsetof(struct ks_cfe_buf, cfe_pending_q) == 0x0, "ks_cfe_buf.cfe_pending_q offset");
_Static_assert(offsetof(struct ks_cfe_buf, cfe_ctl_q) == 0x20, "ks_cfe_buf.cfe_ctl_q offset");
_Static_assert(offsetof(struct ks_cfe_buf, cfe_pass_offset) == 0x40, "ks_cfe_buf.cfe_pass_offset offset");
_Static_assert(offsetof(struct ks_cfe_buf, cfe_peek_offset) == 0x48, "ks_cfe_buf.cfe_peek_offset offset");
_Static_assert(offsetof(struct ks_cfe_buf, cfe_peeked) == 0x50, "ks_cfe_buf.cfe_peeked offset");
_Static_assert(sizeof(struct ks_cfe_buf) == 0x58, "ks_cfe_buf size");

/* refs: 2 */
struct ks_cfi_buf {
    unsigned long long cfi_pending_first;
    unsigned long long cfi_pending_last;
    unsigned int cfi_pending_mbcnt;
    unsigned int cfi_pending_mbnum;
    unsigned int cfi_tail_drop_cnt;
    unsigned long long cfi_pass_offset;
    struct ks_cfil_queue cfi_inject_q;
};
_Static_assert(offsetof(struct ks_cfi_buf, cfi_pending_first) == 0x0, "ks_cfi_buf.cfi_pending_first offset");
_Static_assert(offsetof(struct ks_cfi_buf, cfi_pending_last) == 0x8, "ks_cfi_buf.cfi_pending_last offset");
_Static_assert(offsetof(struct ks_cfi_buf, cfi_pending_mbcnt) == 0x10, "ks_cfi_buf.cfi_pending_mbcnt offset");
_Static_assert(offsetof(struct ks_cfi_buf, cfi_pending_mbnum) == 0x14, "ks_cfi_buf.cfi_pending_mbnum offset");
_Static_assert(offsetof(struct ks_cfi_buf, cfi_tail_drop_cnt) == 0x18, "ks_cfi_buf.cfi_tail_drop_cnt offset");
_Static_assert(offsetof(struct ks_cfi_buf, cfi_pass_offset) == 0x20, "ks_cfi_buf.cfi_pass_offset offset");
_Static_assert(offsetof(struct ks_cfi_buf, cfi_inject_q) == 0x28, "ks_cfi_buf.cfi_inject_q offset");
_Static_assert(sizeof(struct ks_cfi_buf) == 0x48, "ks_cfi_buf size");

/* refs: 1 */
struct ks_cfil_crypto_state {
    const struct ks_ccdigest_info *digest_info;
    unsigned char key[0x20];
};
_Static_assert(offsetof(struct ks_cfil_crypto_state, digest_info) == 0x0, "ks_cfil_crypto_state.digest_info offset");
_Static_assert(offsetof(struct ks_cfil_crypto_state, key) == 0x8, "ks_cfil_crypto_state.key offset");
_Static_assert(sizeof(struct ks_cfil_crypto_state) == 0x28, "ks_cfil_crypto_state size");

/* refs: 7 */
struct ks_cfil_entry {
    struct {
        struct ks_cfil_entry *tqe_next;
        struct ks_cfil_entry **tqe_prev;
    } cfe_link;
    struct {
        struct ks_cfil_entry *sle_next;
    } cfe_order_link;
    struct ks_content_filter *cfe_filter;
    struct ks_cfil_info *cfe_cfil_info;
    unsigned int cfe_flags;
    unsigned int cfe_necp_control_unit;
    struct ks_timeval cfe_last_event;
    struct ks_timeval cfe_last_action;
    unsigned long long cfe_byte_inbound_count_reported;
    unsigned long long cfe_byte_outbound_count_reported;
    struct ks_timeval cfe_stats_report_ts;
    unsigned int cfe_stats_report_frequency;
    int cfe_laddr_sent;
    struct ks_cfe_buf cfe_snd;
    struct ks_cfe_buf cfe_rcv;
};
_Static_assert(offsetof(struct ks_cfil_entry, cfe_link) == 0x0, "ks_cfil_entry.cfe_link offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_order_link) == 0x10, "ks_cfil_entry.cfe_order_link offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_filter) == 0x18, "ks_cfil_entry.cfe_filter offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_cfil_info) == 0x20, "ks_cfil_entry.cfe_cfil_info offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_flags) == 0x28, "ks_cfil_entry.cfe_flags offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_necp_control_unit) == 0x2C, "ks_cfil_entry.cfe_necp_control_unit offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_last_event) == 0x30, "ks_cfil_entry.cfe_last_event offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_last_action) == 0x40, "ks_cfil_entry.cfe_last_action offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_byte_inbound_count_reported) == 0x50, "ks_cfil_entry.cfe_byte_inbound_count_reported offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_byte_outbound_count_reported) == 0x58, "ks_cfil_entry.cfe_byte_outbound_count_reported offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_stats_report_ts) == 0x60, "ks_cfil_entry.cfe_stats_report_ts offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_stats_report_frequency) == 0x70, "ks_cfil_entry.cfe_stats_report_frequency offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_laddr_sent) == 0x74, "ks_cfil_entry.cfe_laddr_sent offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_snd) == 0x78, "ks_cfil_entry.cfe_snd offset");
_Static_assert(offsetof(struct ks_cfil_entry, cfe_rcv) == 0xD0, "ks_cfil_entry.cfe_rcv offset");
_Static_assert(sizeof(struct ks_cfil_entry) == 0x128, "ks_cfil_entry size");

/* refs: 1 */
struct ks_timeval64 {
    long long tv_sec;
    long long tv_usec;
};
_Static_assert(offsetof(struct ks_timeval64, tv_sec) == 0x0, "ks_timeval64.tv_sec offset");
_Static_assert(offsetof(struct ks_timeval64, tv_usec) == 0x8, "ks_timeval64.tv_usec offset");
_Static_assert(sizeof(struct ks_timeval64) == 0x10, "ks_timeval64 size");

/* refs: 9 */
struct ks_sockaddr {
    unsigned char sa_len;
    unsigned char sa_family;
    char sa_data[14];
};
_Static_assert(offsetof(struct ks_sockaddr, sa_len) == 0x0, "ks_sockaddr.sa_len offset");
_Static_assert(offsetof(struct ks_sockaddr, sa_family) == 0x1, "ks_sockaddr.sa_family offset");
_Static_assert(offsetof(struct ks_sockaddr, sa_data) == 0x2, "ks_sockaddr.sa_data offset");
_Static_assert(sizeof(struct ks_sockaddr) == 0x10, "ks_sockaddr size");

/* refs: 1 */
struct ks_sockaddr_in {
    unsigned char sin_len;
    unsigned char sin_family;
    unsigned short sin_port;
    struct ks_in_addr sin_addr;
    char sin_zero[8];
};
_Static_assert(offsetof(struct ks_sockaddr_in, sin_len) == 0x0, "ks_sockaddr_in.sin_len offset");
_Static_assert(offsetof(struct ks_sockaddr_in, sin_family) == 0x1, "ks_sockaddr_in.sin_family offset");
_Static_assert(offsetof(struct ks_sockaddr_in, sin_port) == 0x2, "ks_sockaddr_in.sin_port offset");
_Static_assert(offsetof(struct ks_sockaddr_in, sin_addr) == 0x4, "ks_sockaddr_in.sin_addr offset");
_Static_assert(offsetof(struct ks_sockaddr_in, sin_zero) == 0x8, "ks_sockaddr_in.sin_zero offset");
_Static_assert(sizeof(struct ks_sockaddr_in) == 0x10, "ks_sockaddr_in size");

/* refs: 2 */
struct ks_sockaddr_in6 {
    unsigned char sin6_len;
    unsigned char sin6_family;
    unsigned short sin6_port;
    unsigned int sin6_flowinfo;
    struct ks_in6_addr sin6_addr;
    unsigned int sin6_scope_id;
};
_Static_assert(offsetof(struct ks_sockaddr_in6, sin6_len) == 0x0, "ks_sockaddr_in6.sin6_len offset");
_Static_assert(offsetof(struct ks_sockaddr_in6, sin6_family) == 0x1, "ks_sockaddr_in6.sin6_family offset");
_Static_assert(offsetof(struct ks_sockaddr_in6, sin6_port) == 0x2, "ks_sockaddr_in6.sin6_port offset");
_Static_assert(offsetof(struct ks_sockaddr_in6, sin6_flowinfo) == 0x4, "ks_sockaddr_in6.sin6_flowinfo offset");
_Static_assert(offsetof(struct ks_sockaddr_in6, sin6_addr) == 0x8, "ks_sockaddr_in6.sin6_addr offset");
_Static_assert(offsetof(struct ks_sockaddr_in6, sin6_scope_id) == 0x18, "ks_sockaddr_in6.sin6_scope_id offset");
_Static_assert(sizeof(struct ks_sockaddr_in6) == 0x1C, "ks_sockaddr_in6 size");

/* refs: 7 */
union ks_sockaddr_in_4_6 {
    struct ks_sockaddr sa;
    struct ks___sockaddr_header sah;
    struct ks_sockaddr_in sin;
    struct ks_sockaddr_in6 sin6;
};
_Static_assert(offsetof(union ks_sockaddr_in_4_6, sa) == 0x0, "ks_sockaddr_in_4_6.sa offset");
_Static_assert(offsetof(union ks_sockaddr_in_4_6, sah) == 0x0, "ks_sockaddr_in_4_6.sah offset");
_Static_assert(offsetof(union ks_sockaddr_in_4_6, sin) == 0x0, "ks_sockaddr_in_4_6.sin offset");
_Static_assert(offsetof(union ks_sockaddr_in_4_6, sin6) == 0x0, "ks_sockaddr_in_4_6.sin6 offset");

/* refs: 6 */
struct ks_cfil_info {
    struct {
        struct ks_cfil_info *tqe_next;
        struct ks_cfil_info **tqe_prev;
    } cfi_link;
    struct {
        struct ks_cfil_info *tqe_next;
        struct ks_cfil_info **tqe_prev;
    } cfi_link_stats;
    struct ks_socket *cfi_so;
    unsigned long long cfi_flags;
    unsigned long long cfi_sock_id;
    struct ks_timeval64 cfi_first_event;
    unsigned int cfi_op_list_ctr;
    unsigned int cfi_op_time[6];
    unsigned char cfi_op_list[6];
    union ks_sockaddr_in_4_6 cfi_so_attach_faddr;
    union ks_sockaddr_in_4_6 cfi_so_attach_laddr;
    int cfi_dir;
    unsigned long long cfi_byte_inbound_count;
    unsigned long long cfi_byte_outbound_count;
    struct ks_timeval cfi_timestamp;
    int cfi_isSignatureLatest;
    unsigned int cfi_filter_control_unit;
    unsigned int cfi_filter_policy_gencount;
    unsigned int cfi_debug;
    struct ks_cfi_buf cfi_snd;
    struct ks_cfi_buf cfi_rcv;
    struct ks_cfil_entry cfi_entries[8];
    struct ks_soflow_hash_entry *cfi_hash_entry;
    struct {
        struct ks_cfil_entry *slh_first;
    } cfi_ordered_entries;
    struct ks_os_refcnt cfi_ref_count;
} __attribute__((aligned(8)));
_Static_assert(offsetof(struct ks_cfil_info, cfi_link) == 0x0, "ks_cfil_info.cfi_link offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_link_stats) == 0x10, "ks_cfil_info.cfi_link_stats offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_so) == 0x20, "ks_cfil_info.cfi_so offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_flags) == 0x28, "ks_cfil_info.cfi_flags offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_sock_id) == 0x30, "ks_cfil_info.cfi_sock_id offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_first_event) == 0x38, "ks_cfil_info.cfi_first_event offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_op_list_ctr) == 0x48, "ks_cfil_info.cfi_op_list_ctr offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_op_time) == 0x4C, "ks_cfil_info.cfi_op_time offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_op_list) == 0x64, "ks_cfil_info.cfi_op_list offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_so_attach_faddr) == 0x6C, "ks_cfil_info.cfi_so_attach_faddr offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_so_attach_laddr) == 0x88, "ks_cfil_info.cfi_so_attach_laddr offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_dir) == 0xA4, "ks_cfil_info.cfi_dir offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_byte_inbound_count) == 0xA8, "ks_cfil_info.cfi_byte_inbound_count offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_byte_outbound_count) == 0xB0, "ks_cfil_info.cfi_byte_outbound_count offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_timestamp) == 0xB8, "ks_cfil_info.cfi_timestamp offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_isSignatureLatest) == 0xC8, "ks_cfil_info.cfi_isSignatureLatest offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_filter_control_unit) == 0xCC, "ks_cfil_info.cfi_filter_control_unit offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_filter_policy_gencount) == 0xD0, "ks_cfil_info.cfi_filter_policy_gencount offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_debug) == 0xD4, "ks_cfil_info.cfi_debug offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_snd) == 0xD8, "ks_cfil_info.cfi_snd offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_rcv) == 0x120, "ks_cfil_info.cfi_rcv offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_entries) == 0x168, "ks_cfil_info.cfi_entries offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_hash_entry) == 0xAA8, "ks_cfil_info.cfi_hash_entry offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_ordered_entries) == 0xAB0, "ks_cfil_info.cfi_ordered_entries offset");
_Static_assert(offsetof(struct ks_cfil_info, cfi_ref_count) == 0xAB8, "ks_cfil_info.cfi_ref_count offset");
_Static_assert(sizeof(struct ks_cfil_info) == 0xAC0, "ks_cfil_info size");

/* refs: 1 */
struct ks_cl_readahead {
    struct ks_lck_mtx_s cl_lockr;
    long long cl_lastr;
    long long cl_maxra;
    int cl_ralen;
};
_Static_assert(offsetof(struct ks_cl_readahead, cl_lockr) == 0x0, "ks_cl_readahead.cl_lockr offset");
_Static_assert(offsetof(struct ks_cl_readahead, cl_lastr) == 0x10, "ks_cl_readahead.cl_lastr offset");
_Static_assert(offsetof(struct ks_cl_readahead, cl_maxra) == 0x18, "ks_cl_readahead.cl_maxra offset");
_Static_assert(offsetof(struct ks_cl_readahead, cl_ralen) == 0x20, "ks_cl_readahead.cl_ralen offset");
_Static_assert(sizeof(struct ks_cl_readahead) == 0x28, "ks_cl_readahead size");

/* refs: 1 */
struct ks_cl_wextent {
    long long b_addr;
    long long e_addr;
    int io_flags;
};
_Static_assert(offsetof(struct ks_cl_wextent, b_addr) == 0x0, "ks_cl_wextent.b_addr offset");
_Static_assert(offsetof(struct ks_cl_wextent, e_addr) == 0x8, "ks_cl_wextent.e_addr offset");
_Static_assert(offsetof(struct ks_cl_wextent, io_flags) == 0x10, "ks_cl_wextent.io_flags offset");
_Static_assert(sizeof(struct ks_cl_wextent) == 0x18, "ks_cl_wextent size");

/* refs: 1 */
struct ks_cl_writebehind {
    struct ks_lck_mtx_s cl_lockw;
    void *cl_scmap;
    long long cl_last_write;
    long long cl_seq_written;
    int cl_sparse_pushes;
    int cl_sparse_wait;
    int cl_number;
    struct ks_cl_wextent cl_clusters[8];
};
_Static_assert(offsetof(struct ks_cl_writebehind, cl_lockw) == 0x0, "ks_cl_writebehind.cl_lockw offset");
_Static_assert(offsetof(struct ks_cl_writebehind, cl_scmap) == 0x10, "ks_cl_writebehind.cl_scmap offset");
_Static_assert(offsetof(struct ks_cl_writebehind, cl_last_write) == 0x18, "ks_cl_writebehind.cl_last_write offset");
_Static_assert(offsetof(struct ks_cl_writebehind, cl_seq_written) == 0x20, "ks_cl_writebehind.cl_seq_written offset");
_Static_assert(offsetof(struct ks_cl_writebehind, cl_sparse_pushes) == 0x28, "ks_cl_writebehind.cl_sparse_pushes offset");
_Static_assert(offsetof(struct ks_cl_writebehind, cl_sparse_wait) == 0x2C, "ks_cl_writebehind.cl_sparse_wait offset");
_Static_assert(offsetof(struct ks_cl_writebehind, cl_number) == 0x30, "ks_cl_writebehind.cl_number offset");
_Static_assert(offsetof(struct ks_cl_writebehind, cl_clusters) == 0x38, "ks_cl_writebehind.cl_clusters offset");
_Static_assert(sizeof(struct ks_cl_writebehind) == 0xF8, "ks_cl_writebehind size");

/* refs: 3 */
struct ks_clist {
    int c_cc;
    int c_cn;
    unsigned char *c_cf;
    unsigned char *c_cl;
    unsigned char *c_cs;
    unsigned char *c_ce;
    unsigned char *c_cq;
};
_Static_assert(offsetof(struct ks_clist, c_cc) == 0x0, "ks_clist.c_cc offset");
_Static_assert(offsetof(struct ks_clist, c_cn) == 0x4, "ks_clist.c_cn offset");
_Static_assert(offsetof(struct ks_clist, c_cf) == 0x8, "ks_clist.c_cf offset");
_Static_assert(offsetof(struct ks_clist, c_cl) == 0x10, "ks_clist.c_cl offset");
_Static_assert(offsetof(struct ks_clist, c_cs) == 0x18, "ks_clist.c_cs offset");
_Static_assert(offsetof(struct ks_clist, c_ce) == 0x20, "ks_clist.c_ce offset");
_Static_assert(offsetof(struct ks_clist, c_cq) == 0x28, "ks_clist.c_cq offset");
_Static_assert(sizeof(struct ks_clist) == 0x30, "ks_clist size");

/* refs: 1 */
struct ks_coalition_effective_policy {
    unsigned long long cep_darwinbg : 1; /* bit offset 0 */
    unsigned long long cep_reserved : 63; /* bit offset 1 */
};
_Static_assert(sizeof(struct ks_coalition_effective_policy) == 0x8, "ks_coalition_effective_policy size");

/* refs: 1 */
struct ks_coalition_requested_policy {
    unsigned long long crp_darwinbg : 1; /* bit offset 0 */
    unsigned long long crp_reserved : 63; /* bit offset 1 */
};
_Static_assert(sizeof(struct ks_coalition_requested_policy) == 0x8, "ks_coalition_requested_policy size");

/* refs: 1 */
struct ks_i_jetsam_coalition {
    struct ks_task *leader;
    struct ks_queue_entry extensions;
    struct ks_queue_entry services;
    struct ks_queue_entry other;
    struct ks_thread_group *thread_group;
    _Bool swap_enabled;
    struct ks_coalition_requested_policy c_requested_policy __attribute__((aligned(8)));
    struct ks_coalition_effective_policy c_effective_policy;
};
_Static_assert(offsetof(struct ks_i_jetsam_coalition, leader) == 0x0, "ks_i_jetsam_coalition.leader offset");
_Static_assert(offsetof(struct ks_i_jetsam_coalition, extensions) == 0x8, "ks_i_jetsam_coalition.extensions offset");
_Static_assert(offsetof(struct ks_i_jetsam_coalition, services) == 0x18, "ks_i_jetsam_coalition.services offset");
_Static_assert(offsetof(struct ks_i_jetsam_coalition, other) == 0x28, "ks_i_jetsam_coalition.other offset");
_Static_assert(offsetof(struct ks_i_jetsam_coalition, thread_group) == 0x38, "ks_i_jetsam_coalition.thread_group offset");
_Static_assert(offsetof(struct ks_i_jetsam_coalition, swap_enabled) == 0x40, "ks_i_jetsam_coalition.swap_enabled offset");
_Static_assert(offsetof(struct ks_i_jetsam_coalition, c_requested_policy) == 0x48, "ks_i_jetsam_coalition.c_requested_policy offset");
_Static_assert(offsetof(struct ks_i_jetsam_coalition, c_effective_policy) == 0x50, "ks_i_jetsam_coalition.c_effective_policy offset");
_Static_assert(sizeof(struct ks_i_jetsam_coalition) == 0x58, "ks_i_jetsam_coalition size");

/* refs: 1 */
struct ks_recount_coalition {
    struct ks_recount_usage *rco_exited;
};
_Static_assert(offsetof(struct ks_recount_coalition, rco_exited) == 0x0, "ks_recount_coalition.rco_exited offset");
_Static_assert(sizeof(struct ks_recount_coalition) == 0x8, "ks_recount_coalition size");

/* refs: 1 */
struct ks_i_resource_coalition {
    struct ks_ledger *ledger;
    unsigned long long bytesread;
    unsigned long long byteswritten;
    unsigned long long energy;
    unsigned long long gpu_time;
    unsigned long long logical_immediate_writes;
    unsigned long long logical_deferred_writes;
    unsigned long long logical_invalidated_writes;
    unsigned long long logical_metadata_writes;
    unsigned long long logical_immediate_writes_to_external;
    unsigned long long logical_deferred_writes_to_external;
    unsigned long long logical_invalidated_writes_to_external;
    unsigned long long logical_metadata_writes_to_external;
    unsigned long long cpu_time_eqos[7];
    unsigned long long cpu_time_rqos[7];
    unsigned long long cpu_instructions;
    unsigned long long cpu_cycles;
    unsigned long long ane_mach_time;
    unsigned long long ane_energy_nj;
    unsigned long long gpu_energy_nj;
    unsigned long long gpu_energy_nj_billed_to_me;
    unsigned long long gpu_energy_nj_billed_to_others;
    struct ks_recount_coalition co_recount;
    unsigned long long task_count;
    unsigned long long dead_task_count;
    unsigned long long last_became_nonempty_time;
    unsigned long long time_nonempty;
    struct ks_queue_entry tasks;
    struct ks_ledger *resource_monitor_ledger;
    unsigned long long fs_metadata_writes;
};
_Static_assert(offsetof(struct ks_i_resource_coalition, ledger) == 0x0, "ks_i_resource_coalition.ledger offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, bytesread) == 0x8, "ks_i_resource_coalition.bytesread offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, byteswritten) == 0x10, "ks_i_resource_coalition.byteswritten offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, energy) == 0x18, "ks_i_resource_coalition.energy offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, gpu_time) == 0x20, "ks_i_resource_coalition.gpu_time offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, logical_immediate_writes) == 0x28, "ks_i_resource_coalition.logical_immediate_writes offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, logical_deferred_writes) == 0x30, "ks_i_resource_coalition.logical_deferred_writes offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, logical_invalidated_writes) == 0x38, "ks_i_resource_coalition.logical_invalidated_writes offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, logical_metadata_writes) == 0x40, "ks_i_resource_coalition.logical_metadata_writes offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, logical_immediate_writes_to_external) == 0x48, "ks_i_resource_coalition.logical_immediate_writes_to_external offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, logical_deferred_writes_to_external) == 0x50, "ks_i_resource_coalition.logical_deferred_writes_to_external offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, logical_invalidated_writes_to_external) == 0x58, "ks_i_resource_coalition.logical_invalidated_writes_to_external offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, logical_metadata_writes_to_external) == 0x60, "ks_i_resource_coalition.logical_metadata_writes_to_external offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, cpu_time_eqos) == 0x68, "ks_i_resource_coalition.cpu_time_eqos offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, cpu_time_rqos) == 0xA0, "ks_i_resource_coalition.cpu_time_rqos offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, cpu_instructions) == 0xD8, "ks_i_resource_coalition.cpu_instructions offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, cpu_cycles) == 0xE0, "ks_i_resource_coalition.cpu_cycles offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, ane_mach_time) == 0xE8, "ks_i_resource_coalition.ane_mach_time offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, ane_energy_nj) == 0xF0, "ks_i_resource_coalition.ane_energy_nj offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, gpu_energy_nj) == 0xF8, "ks_i_resource_coalition.gpu_energy_nj offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, gpu_energy_nj_billed_to_me) == 0x100, "ks_i_resource_coalition.gpu_energy_nj_billed_to_me offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, gpu_energy_nj_billed_to_others) == 0x108, "ks_i_resource_coalition.gpu_energy_nj_billed_to_others offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, co_recount) == 0x110, "ks_i_resource_coalition.co_recount offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, task_count) == 0x118, "ks_i_resource_coalition.task_count offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, dead_task_count) == 0x120, "ks_i_resource_coalition.dead_task_count offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, last_became_nonempty_time) == 0x128, "ks_i_resource_coalition.last_became_nonempty_time offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, time_nonempty) == 0x130, "ks_i_resource_coalition.time_nonempty offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, tasks) == 0x138, "ks_i_resource_coalition.tasks offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, resource_monitor_ledger) == 0x148, "ks_i_resource_coalition.resource_monitor_ledger offset");
_Static_assert(offsetof(struct ks_i_resource_coalition, fs_metadata_writes) == 0x150, "ks_i_resource_coalition.fs_metadata_writes offset");
_Static_assert(sizeof(struct ks_i_resource_coalition) == 0x158, "ks_i_resource_coalition size");

/* refs: 5 */
struct ks_smr_node {
    struct ks_smr_node *smrn_next;
    void *smrn_cb;
};
_Static_assert(offsetof(struct ks_smr_node, smrn_next) == 0x0, "ks_smr_node.smrn_next offset");
_Static_assert(offsetof(struct ks_smr_node, smrn_cb) == 0x8, "ks_smr_node.smrn_cb offset");
_Static_assert(sizeof(struct ks_smr_node) == 0x10, "ks_smr_node size");

/* refs: 5 */
struct ks_smrq_slink {
    struct ks___smrq_slink_t next;
};
_Static_assert(offsetof(struct ks_smrq_slink, next) == 0x0, "ks_smrq_slink.next offset");
_Static_assert(sizeof(struct ks_smrq_slink) == 0x8, "ks_smrq_slink size");

/* refs: 2 */
struct ks_coalition {
    unsigned long long id;
    unsigned int type;
    unsigned int role;
    unsigned int ref_count;
    unsigned int active_count;
    unsigned int focal_task_count;
    unsigned int nonfocal_task_count;
    unsigned int game_task_count;
    unsigned int carplay_task_count;
    unsigned int privileged : 1; /* bit offset 320 */
    unsigned int termrequested : 1; /* bit offset 321 */
    unsigned int terminated : 1; /* bit offset 322 */
    unsigned int reaped : 1; /* bit offset 323 */
    unsigned int notified : 1; /* bit offset 324 */
    unsigned int efficient : 1; /* bit offset 325 */
    struct ks_smrq_slink link;
    union {
        struct ks_lck_mtx_s lock;
        struct ks_smr_node smr_node;
    };
    union {
        struct ks_i_resource_coalition r;
        struct ks_i_jetsam_coalition j;
    };
};
_Static_assert(offsetof(struct ks_coalition, id) == 0x0, "ks_coalition.id offset");
_Static_assert(offsetof(struct ks_coalition, type) == 0x8, "ks_coalition.type offset");
_Static_assert(offsetof(struct ks_coalition, role) == 0xC, "ks_coalition.role offset");
_Static_assert(offsetof(struct ks_coalition, ref_count) == 0x10, "ks_coalition.ref_count offset");
_Static_assert(offsetof(struct ks_coalition, active_count) == 0x14, "ks_coalition.active_count offset");
_Static_assert(offsetof(struct ks_coalition, focal_task_count) == 0x18, "ks_coalition.focal_task_count offset");
_Static_assert(offsetof(struct ks_coalition, nonfocal_task_count) == 0x1C, "ks_coalition.nonfocal_task_count offset");
_Static_assert(offsetof(struct ks_coalition, game_task_count) == 0x20, "ks_coalition.game_task_count offset");
_Static_assert(offsetof(struct ks_coalition, carplay_task_count) == 0x24, "ks_coalition.carplay_task_count offset");
_Static_assert(offsetof(struct ks_coalition, link) == 0x30, "ks_coalition.link offset");
_Static_assert(sizeof(struct ks_coalition) == 0x1A0, "ks_coalition size");

/* refs: 1 */
struct ks_componentname {
    unsigned int cn_nameiop;
    unsigned int cn_flags;
    struct ks_vfs_context *cn_context;
    struct ks_nameidata *cn_ndp;
    char *cn_pnbuf;
    int cn_pnlen;
    char *cn_nameptr;
    int cn_namelen;
    unsigned int cn_hash;
    unsigned int cn_consume;
};
_Static_assert(offsetof(struct ks_componentname, cn_nameiop) == 0x0, "ks_componentname.cn_nameiop offset");
_Static_assert(offsetof(struct ks_componentname, cn_flags) == 0x4, "ks_componentname.cn_flags offset");
_Static_assert(offsetof(struct ks_componentname, cn_context) == 0x8, "ks_componentname.cn_context offset");
_Static_assert(offsetof(struct ks_componentname, cn_ndp) == 0x10, "ks_componentname.cn_ndp offset");
_Static_assert(offsetof(struct ks_componentname, cn_pnbuf) == 0x18, "ks_componentname.cn_pnbuf offset");
_Static_assert(offsetof(struct ks_componentname, cn_pnlen) == 0x20, "ks_componentname.cn_pnlen offset");
_Static_assert(offsetof(struct ks_componentname, cn_nameptr) == 0x28, "ks_componentname.cn_nameptr offset");
_Static_assert(offsetof(struct ks_componentname, cn_namelen) == 0x30, "ks_componentname.cn_namelen offset");
_Static_assert(offsetof(struct ks_componentname, cn_hash) == 0x34, "ks_componentname.cn_hash offset");
_Static_assert(offsetof(struct ks_componentname, cn_consume) == 0x38, "ks_componentname.cn_consume offset");
_Static_assert(sizeof(struct ks_componentname) == 0x40, "ks_componentname size");

/* refs: 1 */
struct ks_content_filter {
    void *cf_kcref;
    unsigned int cf_kcunit;
    unsigned int cf_flags;
    unsigned int cf_necp_control_unit;
    unsigned int cf_sock_count;
    struct {
        struct ks_cfil_entry *tqh_first;
        struct ks_cfil_entry **tqh_last;
    } cf_sock_entries;
    struct ks_cfil_crypto_state *cf_crypto_state;
};
_Static_assert(offsetof(struct ks_content_filter, cf_kcref) == 0x0, "ks_content_filter.cf_kcref offset");
_Static_assert(offsetof(struct ks_content_filter, cf_kcunit) == 0x8, "ks_content_filter.cf_kcunit offset");
_Static_assert(offsetof(struct ks_content_filter, cf_flags) == 0xC, "ks_content_filter.cf_flags offset");
_Static_assert(offsetof(struct ks_content_filter, cf_necp_control_unit) == 0x10, "ks_content_filter.cf_necp_control_unit offset");
_Static_assert(offsetof(struct ks_content_filter, cf_sock_count) == 0x14, "ks_content_filter.cf_sock_count offset");
_Static_assert(offsetof(struct ks_content_filter, cf_sock_entries) == 0x18, "ks_content_filter.cf_sock_entries offset");
_Static_assert(offsetof(struct ks_content_filter, cf_crypto_state) == 0x28, "ks_content_filter.cf_crypto_state offset");
_Static_assert(sizeof(struct ks_content_filter) == 0x30, "ks_content_filter size");

/* refs: 1 */
struct ks_corruption {
    unsigned int corruption_p;
};
_Static_assert(offsetof(struct ks_corruption, corruption_p) == 0x0, "ks_corruption.corruption_p offset");
_Static_assert(sizeof(struct ks_corruption) == 0x4, "ks_corruption size");

/* refs: 1 */
struct ks_cpx {
    struct ks_aes_encrypt_ctx *cpx_iv_aes_ctx_ptr;
    unsigned int cpx_flags;
    unsigned short cpx_max_key_len;
    unsigned short cpx_key_len;
    unsigned char cpx_cached_key[];
};
_Static_assert(offsetof(struct ks_cpx, cpx_iv_aes_ctx_ptr) == 0x0, "ks_cpx.cpx_iv_aes_ctx_ptr offset");
_Static_assert(offsetof(struct ks_cpx, cpx_flags) == 0x8, "ks_cpx.cpx_flags offset");
_Static_assert(offsetof(struct ks_cpx, cpx_max_key_len) == 0xC, "ks_cpx.cpx_max_key_len offset");
_Static_assert(offsetof(struct ks_cpx, cpx_key_len) == 0xE, "ks_cpx.cpx_key_len offset");
_Static_assert(offsetof(struct ks_cpx, cpx_cached_key) == 0x10, "ks_cpx.cpx_cached_key offset");
_Static_assert(sizeof(struct ks_cpx) == 0x10, "ks_cpx size");

/* refs: 1 */
struct ks_cs_blob_platform_flags {
    unsigned int csb_platform_binary : 1; /* bit offset 0 */
    unsigned int csb_platform_path : 1; /* bit offset 1 */
};
_Static_assert(sizeof(struct ks_cs_blob_platform_flags) == 0x4, "ks_cs_blob_platform_flags size");

/* refs: 1 */
struct ks_cs_cpu_info {
    int csb_cpu_type;
    int csb_cpu_subtype;
};
_Static_assert(offsetof(struct ks_cs_cpu_info, csb_cpu_type) == 0x0, "ks_cs_cpu_info.csb_cpu_type offset");
_Static_assert(offsetof(struct ks_cs_cpu_info, csb_cpu_subtype) == 0x4, "ks_cs_cpu_info.csb_cpu_subtype offset");
_Static_assert(sizeof(struct ks_cs_cpu_info) == 0x8, "ks_cs_cpu_info size");

/* refs: 1 */
struct ks_cs_signer_info {
    unsigned int csb_flags;
    unsigned int csb_signer_type;
};
_Static_assert(offsetof(struct ks_cs_signer_info, csb_flags) == 0x0, "ks_cs_signer_info.csb_flags offset");
_Static_assert(offsetof(struct ks_cs_signer_info, csb_signer_type) == 0x4, "ks_cs_signer_info.csb_signer_type offset");
_Static_assert(sizeof(struct ks_cs_signer_info) == 0x8, "ks_cs_signer_info size");

/* refs: 2 */
struct ks_cs_blob {
    struct ks_cs_blob *csb_next;
    struct ks_vnode *csb_vnode;
    void *csb_ro_addr;
    struct ks_cs_cpu_info csb_cpu_info;
    struct ks_cs_signer_info csb_signer_info;
    long long csb_base_offset;
    long long csb_start_offset;
    long long csb_end_offset;
    unsigned long csb_mem_size;
    unsigned long csb_mem_offset;
    void *csb_mem_kaddr;
    unsigned char csb_cdhash[0x14];
    const struct ks_cs_hash *csb_hashtype;
    unsigned char csb_linkage[0x14];
    const struct ks_cs_hash *csb_linkage_hashtype;
    int csb_hash_pageshift;
    int csb_hash_firstlevel_pageshift;
    struct ks___CodeDirectory *csb_cd;
    const char *csb_teamid;
    char *csb_supplement_teamid;
    struct ks___SC_GenericBlob *csb_entitlements_blob;
    struct ks___SC_GenericBlob *csb_der_entitlements_blob;
    void *csb_entitlements;
    unsigned int csb_reconstituted;
    struct ks_cs_blob_platform_flags csb_platform_flags;
    unsigned int csb_validation_category;
    unsigned long long csb_auxiliary_info;
    void *csb_csm_obj;
    _Bool csb_csm_managed;
    unsigned int csb_csm_trust_level;
};
_Static_assert(offsetof(struct ks_cs_blob, csb_next) == 0x0, "ks_cs_blob.csb_next offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_vnode) == 0x8, "ks_cs_blob.csb_vnode offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_ro_addr) == 0x10, "ks_cs_blob.csb_ro_addr offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_cpu_info) == 0x18, "ks_cs_blob.csb_cpu_info offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_signer_info) == 0x20, "ks_cs_blob.csb_signer_info offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_base_offset) == 0x28, "ks_cs_blob.csb_base_offset offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_start_offset) == 0x30, "ks_cs_blob.csb_start_offset offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_end_offset) == 0x38, "ks_cs_blob.csb_end_offset offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_mem_size) == 0x40, "ks_cs_blob.csb_mem_size offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_mem_offset) == 0x48, "ks_cs_blob.csb_mem_offset offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_mem_kaddr) == 0x50, "ks_cs_blob.csb_mem_kaddr offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_cdhash) == 0x58, "ks_cs_blob.csb_cdhash offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_hashtype) == 0x70, "ks_cs_blob.csb_hashtype offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_linkage) == 0x78, "ks_cs_blob.csb_linkage offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_linkage_hashtype) == 0x90, "ks_cs_blob.csb_linkage_hashtype offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_hash_pageshift) == 0x98, "ks_cs_blob.csb_hash_pageshift offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_hash_firstlevel_pageshift) == 0x9C, "ks_cs_blob.csb_hash_firstlevel_pageshift offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_cd) == 0xA0, "ks_cs_blob.csb_cd offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_teamid) == 0xA8, "ks_cs_blob.csb_teamid offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_supplement_teamid) == 0xB0, "ks_cs_blob.csb_supplement_teamid offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_entitlements_blob) == 0xB8, "ks_cs_blob.csb_entitlements_blob offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_der_entitlements_blob) == 0xC0, "ks_cs_blob.csb_der_entitlements_blob offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_entitlements) == 0xC8, "ks_cs_blob.csb_entitlements offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_reconstituted) == 0xD0, "ks_cs_blob.csb_reconstituted offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_platform_flags) == 0xD4, "ks_cs_blob.csb_platform_flags offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_validation_category) == 0xD8, "ks_cs_blob.csb_validation_category offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_auxiliary_info) == 0xE0, "ks_cs_blob.csb_auxiliary_info offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_csm_obj) == 0xE8, "ks_cs_blob.csb_csm_obj offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_csm_managed) == 0xF0, "ks_cs_blob.csb_csm_managed offset");
_Static_assert(offsetof(struct ks_cs_blob, csb_csm_trust_level) == 0xF4, "ks_cs_blob.csb_csm_trust_level offset");
_Static_assert(sizeof(struct ks_cs_blob) == 0xF8, "ks_cs_blob size");

/* refs: 2 */
struct ks_cs_hash {
    unsigned char cs_type;
    unsigned long cs_size;
    unsigned long cs_digest_size;
    void *cs_init;
    void *cs_update;
    void *cs_final;
};
_Static_assert(offsetof(struct ks_cs_hash, cs_type) == 0x0, "ks_cs_hash.cs_type offset");
_Static_assert(offsetof(struct ks_cs_hash, cs_size) == 0x8, "ks_cs_hash.cs_size offset");
_Static_assert(offsetof(struct ks_cs_hash, cs_digest_size) == 0x10, "ks_cs_hash.cs_digest_size offset");
_Static_assert(offsetof(struct ks_cs_hash, cs_init) == 0x18, "ks_cs_hash.cs_init offset");
_Static_assert(offsetof(struct ks_cs_hash, cs_update) == 0x20, "ks_cs_hash.cs_update offset");
_Static_assert(offsetof(struct ks_cs_hash, cs_final) == 0x28, "ks_cs_hash.cs_final offset");
_Static_assert(sizeof(struct ks_cs_hash) == 0x30, "ks_cs_hash size");

/* refs: 1 */
struct ks_data_stats {
    unsigned long long rxpackets;
    unsigned long long rxbytes;
    unsigned long long txpackets;
    unsigned long long txbytes;
};
_Static_assert(offsetof(struct ks_data_stats, rxpackets) == 0x0, "ks_data_stats.rxpackets offset");
_Static_assert(offsetof(struct ks_data_stats, rxbytes) == 0x8, "ks_data_stats.rxbytes offset");
_Static_assert(offsetof(struct ks_data_stats, txpackets) == 0x10, "ks_data_stats.txpackets offset");
_Static_assert(offsetof(struct ks_data_stats, txbytes) == 0x18, "ks_data_stats.txbytes offset");
_Static_assert(sizeof(struct ks_data_stats) == 0x20, "ks_data_stats size");

/* refs: 1 */
struct ks_ifnet_stat_increment_param {
    unsigned int packets_in;
    unsigned int bytes_in;
    unsigned int errors_in;
    unsigned int packets_out;
    unsigned int bytes_out;
    unsigned int errors_out;
    unsigned int collisions;
    unsigned int dropped;
};
_Static_assert(offsetof(struct ks_ifnet_stat_increment_param, packets_in) == 0x0, "ks_ifnet_stat_increment_param.packets_in offset");
_Static_assert(offsetof(struct ks_ifnet_stat_increment_param, bytes_in) == 0x4, "ks_ifnet_stat_increment_param.bytes_in offset");
_Static_assert(offsetof(struct ks_ifnet_stat_increment_param, errors_in) == 0x8, "ks_ifnet_stat_increment_param.errors_in offset");
_Static_assert(offsetof(struct ks_ifnet_stat_increment_param, packets_out) == 0xC, "ks_ifnet_stat_increment_param.packets_out offset");
_Static_assert(offsetof(struct ks_ifnet_stat_increment_param, bytes_out) == 0x10, "ks_ifnet_stat_increment_param.bytes_out offset");
_Static_assert(offsetof(struct ks_ifnet_stat_increment_param, errors_out) == 0x14, "ks_ifnet_stat_increment_param.errors_out offset");
_Static_assert(offsetof(struct ks_ifnet_stat_increment_param, collisions) == 0x18, "ks_ifnet_stat_increment_param.collisions offset");
_Static_assert(offsetof(struct ks_ifnet_stat_increment_param, dropped) == 0x1C, "ks_ifnet_stat_increment_param.dropped offset");
_Static_assert(sizeof(struct ks_ifnet_stat_increment_param) == 0x20, "ks_ifnet_stat_increment_param size");

/* refs: 1 */
struct ks_dlil_threading_info {
    struct ks_lck_mtx_s dlth_lock;
    struct ks__class_queue_ dlth_pkts;
    struct ks_ifnet *dlth_ifp;
    struct ks_ifnet_stat_increment_param dlth_stats;
    unsigned int dlth_flags;
    unsigned int dlth_wtot;
    int *dlth_strategy;
    int dlth_affinity;
    unsigned int dlth_affinity_tag;
    struct ks_thread *dlth_thread;
    struct ks_thread *dlth_driver_thread;
    struct ks_thread *dlth_poller_thread;
    struct ks__lck_grp_ *dlth_lock_grp;
    char dlth_name_storage[0x20];
    const char *dlth_name;
    unsigned int dlth_trim_cnt;
    unsigned int dlth_trim_pkts_dropped;
    unsigned long long dlth_pkts_cnt;
};
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_lock) == 0x0, "ks_dlil_threading_info.dlth_lock offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_pkts) == 0x10, "ks_dlil_threading_info.dlth_pkts offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_ifp) == 0x48, "ks_dlil_threading_info.dlth_ifp offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_stats) == 0x50, "ks_dlil_threading_info.dlth_stats offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_flags) == 0x70, "ks_dlil_threading_info.dlth_flags offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_wtot) == 0x74, "ks_dlil_threading_info.dlth_wtot offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_strategy) == 0x78, "ks_dlil_threading_info.dlth_strategy offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_affinity) == 0x80, "ks_dlil_threading_info.dlth_affinity offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_affinity_tag) == 0x84, "ks_dlil_threading_info.dlth_affinity_tag offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_thread) == 0x88, "ks_dlil_threading_info.dlth_thread offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_driver_thread) == 0x90, "ks_dlil_threading_info.dlth_driver_thread offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_poller_thread) == 0x98, "ks_dlil_threading_info.dlth_poller_thread offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_lock_grp) == 0xA0, "ks_dlil_threading_info.dlth_lock_grp offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_name_storage) == 0xA8, "ks_dlil_threading_info.dlth_name_storage offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_name) == 0xC8, "ks_dlil_threading_info.dlth_name offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_trim_cnt) == 0xD0, "ks_dlil_threading_info.dlth_trim_cnt offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_trim_pkts_dropped) == 0xD4, "ks_dlil_threading_info.dlth_trim_pkts_dropped offset");
_Static_assert(offsetof(struct ks_dlil_threading_info, dlth_pkts_cnt) == 0xD8, "ks_dlil_threading_info.dlth_pkts_cnt offset");
_Static_assert(sizeof(struct ks_dlil_threading_info) == 0xE0, "ks_dlil_threading_info size");

/* refs: 1 */
struct ks_doc_tombstone {
    struct ks_vnode *t_lastop_parent;
    struct ks_vnode *t_lastop_item;
    unsigned int t_lastop_parent_vid;
    unsigned int t_lastop_item_vid;
    unsigned long long t_lastop_fileid;
    unsigned long long t_lastop_document_id;
    unsigned char t_lastop_filename[0x100];
};
_Static_assert(offsetof(struct ks_doc_tombstone, t_lastop_parent) == 0x0, "ks_doc_tombstone.t_lastop_parent offset");
_Static_assert(offsetof(struct ks_doc_tombstone, t_lastop_item) == 0x8, "ks_doc_tombstone.t_lastop_item offset");
_Static_assert(offsetof(struct ks_doc_tombstone, t_lastop_parent_vid) == 0x10, "ks_doc_tombstone.t_lastop_parent_vid offset");
_Static_assert(offsetof(struct ks_doc_tombstone, t_lastop_item_vid) == 0x14, "ks_doc_tombstone.t_lastop_item_vid offset");
_Static_assert(offsetof(struct ks_doc_tombstone, t_lastop_fileid) == 0x18, "ks_doc_tombstone.t_lastop_fileid offset");
_Static_assert(offsetof(struct ks_doc_tombstone, t_lastop_document_id) == 0x20, "ks_doc_tombstone.t_lastop_document_id offset");
_Static_assert(offsetof(struct ks_doc_tombstone, t_lastop_filename) == 0x28, "ks_doc_tombstone.t_lastop_filename offset");
_Static_assert(sizeof(struct ks_doc_tombstone) == 0x128, "ks_doc_tombstone size");

/* refs: 3 */
struct ks_dof_helper {
    char dofhp_mod[0x40];
    unsigned long long dofhp_addr;
    unsigned long long dofhp_dof;
};
_Static_assert(offsetof(struct ks_dof_helper, dofhp_mod) == 0x0, "ks_dof_helper.dofhp_mod offset");
_Static_assert(offsetof(struct ks_dof_helper, dofhp_addr) == 0x40, "ks_dof_helper.dofhp_addr offset");
_Static_assert(offsetof(struct ks_dof_helper, dofhp_dof) == 0x48, "ks_dof_helper.dofhp_dof offset");
_Static_assert(sizeof(struct ks_dof_helper) == 0x50, "ks_dof_helper size");

/* refs: 1 */
struct ks_dof_ioctl_data {
    unsigned long long dofiod_count;
    struct ks_dof_helper dofiod_helpers[1];
};
_Static_assert(offsetof(struct ks_dof_ioctl_data, dofiod_count) == 0x0, "ks_dof_ioctl_data.dofiod_count offset");
_Static_assert(offsetof(struct ks_dof_ioctl_data, dofiod_helpers) == 0x8, "ks_dof_ioctl_data.dofiod_helpers offset");
_Static_assert(sizeof(struct ks_dof_ioctl_data) == 0x58, "ks_dof_ioctl_data size");

/* refs: 4 */
struct ks_domain {
    int dom_family;
    unsigned int dom_flags;
    unsigned int dom_refs;
    struct ks_lck_mtx_s *dom_mtx;
    struct ks_lck_mtx_s dom_mtx_s;
    struct {
        struct ks_domain *tqe_next;
        struct ks_domain **tqe_prev;
    } dom_entry;
    struct {
        struct ks_protosw *tqh_first;
        struct ks_protosw **tqh_last;
    } dom_protosw;
    void *dom_init;
    int *dom_externalize;
    void *dom_dispose;
    int *dom_rtattach;
    int dom_rtoffset;
    int dom_maxrtkey;
    int dom_protohdrlen;
    const char *dom_name;
    struct ks_domain_old *dom_old;
};
_Static_assert(offsetof(struct ks_domain, dom_family) == 0x0, "ks_domain.dom_family offset");
_Static_assert(offsetof(struct ks_domain, dom_flags) == 0x4, "ks_domain.dom_flags offset");
_Static_assert(offsetof(struct ks_domain, dom_refs) == 0x8, "ks_domain.dom_refs offset");
_Static_assert(offsetof(struct ks_domain, dom_mtx) == 0x10, "ks_domain.dom_mtx offset");
_Static_assert(offsetof(struct ks_domain, dom_mtx_s) == 0x18, "ks_domain.dom_mtx_s offset");
_Static_assert(offsetof(struct ks_domain, dom_entry) == 0x28, "ks_domain.dom_entry offset");
_Static_assert(offsetof(struct ks_domain, dom_protosw) == 0x38, "ks_domain.dom_protosw offset");
_Static_assert(offsetof(struct ks_domain, dom_init) == 0x48, "ks_domain.dom_init offset");
_Static_assert(offsetof(struct ks_domain, dom_externalize) == 0x50, "ks_domain.dom_externalize offset");
_Static_assert(offsetof(struct ks_domain, dom_dispose) == 0x58, "ks_domain.dom_dispose offset");
_Static_assert(offsetof(struct ks_domain, dom_rtattach) == 0x60, "ks_domain.dom_rtattach offset");
_Static_assert(offsetof(struct ks_domain, dom_rtoffset) == 0x68, "ks_domain.dom_rtoffset offset");
_Static_assert(offsetof(struct ks_domain, dom_maxrtkey) == 0x6C, "ks_domain.dom_maxrtkey offset");
_Static_assert(offsetof(struct ks_domain, dom_protohdrlen) == 0x70, "ks_domain.dom_protohdrlen offset");
_Static_assert(offsetof(struct ks_domain, dom_name) == 0x78, "ks_domain.dom_name offset");
_Static_assert(offsetof(struct ks_domain, dom_old) == 0x80, "ks_domain.dom_old offset");
_Static_assert(sizeof(struct ks_domain) == 0x88, "ks_domain size");

/* refs: 1 */
#pragma pack(push, 4)
struct ks_domain_old {
    int dom_family;
    const char *dom_name;
    void *dom_init;
    int *dom_externalize;
    void *dom_dispose;
    struct ks_protosw_old *dom_protosw;
    struct ks_domain_old *dom_next;
    int *dom_rtattach;
    int dom_rtoffset;
    int dom_maxrtkey;
    int dom_protohdrlen;
    int dom_refs;
    struct ks_lck_mtx_s *dom_mtx;
    unsigned int dom_flags;
    unsigned int reserved[2];
};
#pragma pack(pop)
_Static_assert(offsetof(struct ks_domain_old, dom_family) == 0x0, "ks_domain_old.dom_family offset");
_Static_assert(offsetof(struct ks_domain_old, dom_name) == 0x4, "ks_domain_old.dom_name offset");
_Static_assert(offsetof(struct ks_domain_old, dom_init) == 0xC, "ks_domain_old.dom_init offset");
_Static_assert(offsetof(struct ks_domain_old, dom_externalize) == 0x14, "ks_domain_old.dom_externalize offset");
_Static_assert(offsetof(struct ks_domain_old, dom_dispose) == 0x1C, "ks_domain_old.dom_dispose offset");
_Static_assert(offsetof(struct ks_domain_old, dom_protosw) == 0x24, "ks_domain_old.dom_protosw offset");
_Static_assert(offsetof(struct ks_domain_old, dom_next) == 0x2C, "ks_domain_old.dom_next offset");
_Static_assert(offsetof(struct ks_domain_old, dom_rtattach) == 0x34, "ks_domain_old.dom_rtattach offset");
_Static_assert(offsetof(struct ks_domain_old, dom_rtoffset) == 0x3C, "ks_domain_old.dom_rtoffset offset");
_Static_assert(offsetof(struct ks_domain_old, dom_maxrtkey) == 0x40, "ks_domain_old.dom_maxrtkey offset");
_Static_assert(offsetof(struct ks_domain_old, dom_protohdrlen) == 0x44, "ks_domain_old.dom_protohdrlen offset");
_Static_assert(offsetof(struct ks_domain_old, dom_refs) == 0x48, "ks_domain_old.dom_refs offset");
_Static_assert(offsetof(struct ks_domain_old, dom_mtx) == 0x4C, "ks_domain_old.dom_mtx offset");
_Static_assert(offsetof(struct ks_domain_old, dom_flags) == 0x54, "ks_domain_old.dom_flags offset");
_Static_assert(offsetof(struct ks_domain_old, reserved) == 0x58, "ks_domain_old.reserved offset");
_Static_assert(sizeof(struct ks_domain_old) == 0x60, "ks_domain_old size");

/* refs: 1 */
struct ks_driver_mtag_ {
    unsigned long _drv_tx_compl_arg;
    unsigned long _drv_tx_compl_data;
    int _drv_tx_status;
    unsigned short _drv_flowid;
};
_Static_assert(offsetof(struct ks_driver_mtag_, _drv_tx_compl_arg) == 0x0, "ks_driver_mtag_._drv_tx_compl_arg offset");
_Static_assert(offsetof(struct ks_driver_mtag_, _drv_tx_compl_data) == 0x8, "ks_driver_mtag_._drv_tx_compl_data offset");
_Static_assert(offsetof(struct ks_driver_mtag_, _drv_tx_status) == 0x10, "ks_driver_mtag_._drv_tx_status offset");
_Static_assert(offsetof(struct ks_driver_mtag_, _drv_flowid) == 0x14, "ks_driver_mtag_._drv_flowid offset");
_Static_assert(sizeof(struct ks_driver_mtag_) == 0x18, "ks_driver_mtag_ size");

/* refs: 2 */
struct ks_dtrace_recdesc {
    unsigned short dtrd_action;
    unsigned int dtrd_size;
    unsigned int dtrd_offset;
    unsigned short dtrd_alignment;
    unsigned short dtrd_format;
    unsigned long long dtrd_arg;
    unsigned long long dtrd_uarg;
};
_Static_assert(offsetof(struct ks_dtrace_recdesc, dtrd_action) == 0x0, "ks_dtrace_recdesc.dtrd_action offset");
_Static_assert(offsetof(struct ks_dtrace_recdesc, dtrd_size) == 0x4, "ks_dtrace_recdesc.dtrd_size offset");
_Static_assert(offsetof(struct ks_dtrace_recdesc, dtrd_offset) == 0x8, "ks_dtrace_recdesc.dtrd_offset offset");
_Static_assert(offsetof(struct ks_dtrace_recdesc, dtrd_alignment) == 0xC, "ks_dtrace_recdesc.dtrd_alignment offset");
_Static_assert(offsetof(struct ks_dtrace_recdesc, dtrd_format) == 0xE, "ks_dtrace_recdesc.dtrd_format offset");
_Static_assert(offsetof(struct ks_dtrace_recdesc, dtrd_arg) == 0x10, "ks_dtrace_recdesc.dtrd_arg offset");
_Static_assert(offsetof(struct ks_dtrace_recdesc, dtrd_uarg) == 0x18, "ks_dtrace_recdesc.dtrd_uarg offset");
_Static_assert(sizeof(struct ks_dtrace_recdesc) == 0x20, "ks_dtrace_recdesc size");

/* refs: 5 */
struct ks_dtrace_action {
    unsigned short dta_kind;
    unsigned short dta_intuple;
    unsigned int dta_refcnt;
    struct ks_dtrace_difo *dta_difo;
    struct ks_dtrace_recdesc dta_rec;
    struct ks_dtrace_action *dta_prev;
    struct ks_dtrace_action *dta_next;
};
_Static_assert(offsetof(struct ks_dtrace_action, dta_kind) == 0x0, "ks_dtrace_action.dta_kind offset");
_Static_assert(offsetof(struct ks_dtrace_action, dta_intuple) == 0x2, "ks_dtrace_action.dta_intuple offset");
_Static_assert(offsetof(struct ks_dtrace_action, dta_refcnt) == 0x4, "ks_dtrace_action.dta_refcnt offset");
_Static_assert(offsetof(struct ks_dtrace_action, dta_difo) == 0x8, "ks_dtrace_action.dta_difo offset");
_Static_assert(offsetof(struct ks_dtrace_action, dta_rec) == 0x10, "ks_dtrace_action.dta_rec offset");
_Static_assert(offsetof(struct ks_dtrace_action, dta_prev) == 0x30, "ks_dtrace_action.dta_prev offset");
_Static_assert(offsetof(struct ks_dtrace_action, dta_next) == 0x38, "ks_dtrace_action.dta_next offset");
_Static_assert(sizeof(struct ks_dtrace_action) == 0x40, "ks_dtrace_action size");

/* refs: 2 */
struct ks_dtrace_aggregation {
    struct ks_dtrace_action dtag_action;
    unsigned int dtag_id;
    struct ks_dtrace_ecb *dtag_ecb;
    struct ks_dtrace_action *dtag_first;
    unsigned int dtag_base;
    unsigned char dtag_hasarg;
    unsigned long long dtag_initial;
    void *dtag_aggregate;
};
_Static_assert(offsetof(struct ks_dtrace_aggregation, dtag_action) == 0x0, "ks_dtrace_aggregation.dtag_action offset");
_Static_assert(offsetof(struct ks_dtrace_aggregation, dtag_id) == 0x40, "ks_dtrace_aggregation.dtag_id offset");
_Static_assert(offsetof(struct ks_dtrace_aggregation, dtag_ecb) == 0x48, "ks_dtrace_aggregation.dtag_ecb offset");
_Static_assert(offsetof(struct ks_dtrace_aggregation, dtag_first) == 0x50, "ks_dtrace_aggregation.dtag_first offset");
_Static_assert(offsetof(struct ks_dtrace_aggregation, dtag_base) == 0x58, "ks_dtrace_aggregation.dtag_base offset");
_Static_assert(offsetof(struct ks_dtrace_aggregation, dtag_hasarg) == 0x5C, "ks_dtrace_aggregation.dtag_hasarg offset");
_Static_assert(offsetof(struct ks_dtrace_aggregation, dtag_initial) == 0x60, "ks_dtrace_aggregation.dtag_initial offset");
_Static_assert(offsetof(struct ks_dtrace_aggregation, dtag_aggregate) == 0x68, "ks_dtrace_aggregation.dtag_aggregate offset");
_Static_assert(sizeof(struct ks_dtrace_aggregation) == 0x70, "ks_dtrace_aggregation size");

/* refs: 6 */
struct ks_dtrace_attribute {
    unsigned char dtat_name;
    unsigned char dtat_data;
    unsigned char dtat_class;
};
_Static_assert(offsetof(struct ks_dtrace_attribute, dtat_name) == 0x0, "ks_dtrace_attribute.dtat_name offset");
_Static_assert(offsetof(struct ks_dtrace_attribute, dtat_data) == 0x1, "ks_dtrace_attribute.dtat_data offset");
_Static_assert(offsetof(struct ks_dtrace_attribute, dtat_class) == 0x2, "ks_dtrace_attribute.dtat_class offset");
_Static_assert(sizeof(struct ks_dtrace_attribute) == 0x3, "ks_dtrace_attribute size");

/* refs: 4 */
struct ks_dtrace_buffer {
    unsigned long long dtb_offset;
    unsigned long long dtb_cur_limit;
    unsigned long long dtb_limit;
    unsigned long long dtb_size;
    unsigned int dtb_flags;
    unsigned int dtb_drops;
    char *dtb_tomax;
    char *dtb_xamot;
    unsigned int dtb_xamot_flags;
    unsigned int dtb_xamot_drops;
    unsigned long long dtb_xamot_offset;
    unsigned int dtb_errors;
    unsigned int dtb_xamot_errors;
    unsigned long long dtb_switched;
    unsigned long long dtb_interval;
    unsigned long long dtb_pad2[4];
};
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_offset) == 0x0, "ks_dtrace_buffer.dtb_offset offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_cur_limit) == 0x8, "ks_dtrace_buffer.dtb_cur_limit offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_limit) == 0x10, "ks_dtrace_buffer.dtb_limit offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_size) == 0x18, "ks_dtrace_buffer.dtb_size offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_flags) == 0x20, "ks_dtrace_buffer.dtb_flags offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_drops) == 0x24, "ks_dtrace_buffer.dtb_drops offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_tomax) == 0x28, "ks_dtrace_buffer.dtb_tomax offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_xamot) == 0x30, "ks_dtrace_buffer.dtb_xamot offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_xamot_flags) == 0x38, "ks_dtrace_buffer.dtb_xamot_flags offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_xamot_drops) == 0x3C, "ks_dtrace_buffer.dtb_xamot_drops offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_xamot_offset) == 0x40, "ks_dtrace_buffer.dtb_xamot_offset offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_errors) == 0x48, "ks_dtrace_buffer.dtb_errors offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_xamot_errors) == 0x4C, "ks_dtrace_buffer.dtb_xamot_errors offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_switched) == 0x50, "ks_dtrace_buffer.dtb_switched offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_interval) == 0x58, "ks_dtrace_buffer.dtb_interval offset");
_Static_assert(offsetof(struct ks_dtrace_buffer, dtb_pad2) == 0x60, "ks_dtrace_buffer.dtb_pad2 offset");
_Static_assert(sizeof(struct ks_dtrace_buffer) == 0x80, "ks_dtrace_buffer size");

/* refs: 2 */
struct ks_dtrace_cred {
    struct ks_ucred *dcr_cred;
    unsigned char dcr_destructive;
    unsigned char dcr_visible;
    unsigned short dcr_action;
};
_Static_assert(offsetof(struct ks_dtrace_cred, dcr_cred) == 0x0, "ks_dtrace_cred.dcr_cred offset");
_Static_assert(offsetof(struct ks_dtrace_cred, dcr_destructive) == 0x8, "ks_dtrace_cred.dcr_destructive offset");
_Static_assert(offsetof(struct ks_dtrace_cred, dcr_visible) == 0x9, "ks_dtrace_cred.dcr_visible offset");
_Static_assert(offsetof(struct ks_dtrace_cred, dcr_action) == 0xA, "ks_dtrace_cred.dcr_action offset");
_Static_assert(sizeof(struct ks_dtrace_cred) == 0x10, "ks_dtrace_cred size");

/* refs: 3 */
struct ks_dtrace_diftype {
    unsigned char dtdt_kind;
    unsigned char dtdt_ckind;
    unsigned char dtdt_flags;
    unsigned char dtdt_pad;
    unsigned int dtdt_size;
};
_Static_assert(offsetof(struct ks_dtrace_diftype, dtdt_kind) == 0x0, "ks_dtrace_diftype.dtdt_kind offset");
_Static_assert(offsetof(struct ks_dtrace_diftype, dtdt_ckind) == 0x1, "ks_dtrace_diftype.dtdt_ckind offset");
_Static_assert(offsetof(struct ks_dtrace_diftype, dtdt_flags) == 0x2, "ks_dtrace_diftype.dtdt_flags offset");
_Static_assert(offsetof(struct ks_dtrace_diftype, dtdt_pad) == 0x3, "ks_dtrace_diftype.dtdt_pad offset");
_Static_assert(offsetof(struct ks_dtrace_diftype, dtdt_size) == 0x4, "ks_dtrace_diftype.dtdt_size offset");
_Static_assert(sizeof(struct ks_dtrace_diftype) == 0x8, "ks_dtrace_diftype size");

/* refs: 5 */
struct ks_dtrace_difo {
    unsigned int *dtdo_buf;
    unsigned long long *dtdo_inttab;
    char *dtdo_strtab;
    struct ks_dtrace_difv *dtdo_vartab;
    unsigned int dtdo_len;
    unsigned int dtdo_intlen;
    unsigned int dtdo_strlen;
    unsigned int dtdo_varlen;
    struct ks_dtrace_diftype dtdo_rtype;
    unsigned int dtdo_refcnt;
    unsigned int dtdo_destructive;
};
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_buf) == 0x0, "ks_dtrace_difo.dtdo_buf offset");
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_inttab) == 0x8, "ks_dtrace_difo.dtdo_inttab offset");
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_strtab) == 0x10, "ks_dtrace_difo.dtdo_strtab offset");
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_vartab) == 0x18, "ks_dtrace_difo.dtdo_vartab offset");
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_len) == 0x20, "ks_dtrace_difo.dtdo_len offset");
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_intlen) == 0x24, "ks_dtrace_difo.dtdo_intlen offset");
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_strlen) == 0x28, "ks_dtrace_difo.dtdo_strlen offset");
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_varlen) == 0x2C, "ks_dtrace_difo.dtdo_varlen offset");
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_rtype) == 0x30, "ks_dtrace_difo.dtdo_rtype offset");
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_refcnt) == 0x38, "ks_dtrace_difo.dtdo_refcnt offset");
_Static_assert(offsetof(struct ks_dtrace_difo, dtdo_destructive) == 0x3C, "ks_dtrace_difo.dtdo_destructive offset");
_Static_assert(sizeof(struct ks_dtrace_difo) == 0x40, "ks_dtrace_difo size");

/* refs: 4 */
struct ks_dtrace_difv {
    unsigned int dtdv_name;
    unsigned int dtdv_id;
    unsigned char dtdv_kind;
    unsigned char dtdv_scope;
    unsigned short dtdv_flags;
    struct ks_dtrace_diftype dtdv_type;
};
_Static_assert(offsetof(struct ks_dtrace_difv, dtdv_name) == 0x0, "ks_dtrace_difv.dtdv_name offset");
_Static_assert(offsetof(struct ks_dtrace_difv, dtdv_id) == 0x4, "ks_dtrace_difv.dtdv_id offset");
_Static_assert(offsetof(struct ks_dtrace_difv, dtdv_kind) == 0x8, "ks_dtrace_difv.dtdv_kind offset");
_Static_assert(offsetof(struct ks_dtrace_difv, dtdv_scope) == 0x9, "ks_dtrace_difv.dtdv_scope offset");
_Static_assert(offsetof(struct ks_dtrace_difv, dtdv_flags) == 0xA, "ks_dtrace_difv.dtdv_flags offset");
_Static_assert(offsetof(struct ks_dtrace_difv, dtdv_type) == 0xC, "ks_dtrace_difv.dtdv_type offset");
_Static_assert(sizeof(struct ks_dtrace_difv) == 0x14, "ks_dtrace_difv size");

/* refs: 2 */
struct ks_dtrace_dstate {
    void *dtds_base;
    unsigned long dtds_size;
    unsigned long dtds_hashsize;
    unsigned long dtds_chunksize;
    struct ks_dtrace_dynhash *dtds_hash;
    unsigned int dtds_state;
    struct ks_dtrace_dstate_percpu *dtds_percpu;
};
_Static_assert(offsetof(struct ks_dtrace_dstate, dtds_base) == 0x0, "ks_dtrace_dstate.dtds_base offset");
_Static_assert(offsetof(struct ks_dtrace_dstate, dtds_size) == 0x8, "ks_dtrace_dstate.dtds_size offset");
_Static_assert(offsetof(struct ks_dtrace_dstate, dtds_hashsize) == 0x10, "ks_dtrace_dstate.dtds_hashsize offset");
_Static_assert(offsetof(struct ks_dtrace_dstate, dtds_chunksize) == 0x18, "ks_dtrace_dstate.dtds_chunksize offset");
_Static_assert(offsetof(struct ks_dtrace_dstate, dtds_hash) == 0x20, "ks_dtrace_dstate.dtds_hash offset");
_Static_assert(offsetof(struct ks_dtrace_dstate, dtds_state) == 0x28, "ks_dtrace_dstate.dtds_state offset");
_Static_assert(offsetof(struct ks_dtrace_dstate, dtds_percpu) == 0x30, "ks_dtrace_dstate.dtds_percpu offset");
_Static_assert(sizeof(struct ks_dtrace_dstate) == 0x38, "ks_dtrace_dstate size");

/* refs: 2 */
struct ks_dtrace_dstate_percpu {
    struct ks_dtrace_dynvar *dtdsc_free;
    struct ks_dtrace_dynvar *dtdsc_dirty;
    struct ks_dtrace_dynvar *dtdsc_rinsing;
    struct ks_dtrace_dynvar *dtdsc_clean;
    unsigned long long dtdsc_drops;
    unsigned long long dtdsc_dirty_drops;
    unsigned long long dtdsc_rinsing_drops;
};
_Static_assert(offsetof(struct ks_dtrace_dstate_percpu, dtdsc_free) == 0x0, "ks_dtrace_dstate_percpu.dtdsc_free offset");
_Static_assert(offsetof(struct ks_dtrace_dstate_percpu, dtdsc_dirty) == 0x8, "ks_dtrace_dstate_percpu.dtdsc_dirty offset");
_Static_assert(offsetof(struct ks_dtrace_dstate_percpu, dtdsc_rinsing) == 0x10, "ks_dtrace_dstate_percpu.dtdsc_rinsing offset");
_Static_assert(offsetof(struct ks_dtrace_dstate_percpu, dtdsc_clean) == 0x18, "ks_dtrace_dstate_percpu.dtdsc_clean offset");
_Static_assert(offsetof(struct ks_dtrace_dstate_percpu, dtdsc_drops) == 0x20, "ks_dtrace_dstate_percpu.dtdsc_drops offset");
_Static_assert(offsetof(struct ks_dtrace_dstate_percpu, dtdsc_dirty_drops) == 0x28, "ks_dtrace_dstate_percpu.dtdsc_dirty_drops offset");
_Static_assert(offsetof(struct ks_dtrace_dstate_percpu, dtdsc_rinsing_drops) == 0x30, "ks_dtrace_dstate_percpu.dtdsc_rinsing_drops offset");
_Static_assert(sizeof(struct ks_dtrace_dstate_percpu) == 0x38, "ks_dtrace_dstate_percpu size");

/* refs: 2 */
struct ks_dtrace_dynhash {
    struct ks_dtrace_dynvar *dtdh_chain;
    unsigned long dtdh_lock;
    unsigned long dtdh_pad[6];
};
_Static_assert(offsetof(struct ks_dtrace_dynhash, dtdh_chain) == 0x0, "ks_dtrace_dynhash.dtdh_chain offset");
_Static_assert(offsetof(struct ks_dtrace_dynhash, dtdh_lock) == 0x8, "ks_dtrace_dynhash.dtdh_lock offset");
_Static_assert(offsetof(struct ks_dtrace_dynhash, dtdh_pad) == 0x10, "ks_dtrace_dynhash.dtdh_pad offset");
_Static_assert(sizeof(struct ks_dtrace_dynhash) == 0x40, "ks_dtrace_dynhash size");

/* refs: 2 */
struct ks_dtrace_key {
    unsigned long long dttk_value;
    unsigned long long dttk_size;
};
_Static_assert(offsetof(struct ks_dtrace_key, dttk_value) == 0x0, "ks_dtrace_key.dttk_value offset");
_Static_assert(offsetof(struct ks_dtrace_key, dttk_size) == 0x8, "ks_dtrace_key.dttk_size offset");
_Static_assert(sizeof(struct ks_dtrace_key) == 0x10, "ks_dtrace_key size");

/* refs: 2 */
struct ks_dtrace_tuple {
    unsigned int dtt_nkeys;
    unsigned int dtt_pad;
    struct ks_dtrace_key dtt_key[1];
};
_Static_assert(offsetof(struct ks_dtrace_tuple, dtt_nkeys) == 0x0, "ks_dtrace_tuple.dtt_nkeys offset");
_Static_assert(offsetof(struct ks_dtrace_tuple, dtt_pad) == 0x4, "ks_dtrace_tuple.dtt_pad offset");
_Static_assert(offsetof(struct ks_dtrace_tuple, dtt_key) == 0x8, "ks_dtrace_tuple.dtt_key offset");
_Static_assert(sizeof(struct ks_dtrace_tuple) == 0x18, "ks_dtrace_tuple size");

/* refs: 6 */
struct ks_dtrace_dynvar {
    unsigned long long dtdv_hashval;
    struct ks_dtrace_dynvar *dtdv_next;
    void *dtdv_data;
    struct ks_dtrace_tuple dtdv_tuple;
};
_Static_assert(offsetof(struct ks_dtrace_dynvar, dtdv_hashval) == 0x0, "ks_dtrace_dynvar.dtdv_hashval offset");
_Static_assert(offsetof(struct ks_dtrace_dynvar, dtdv_next) == 0x8, "ks_dtrace_dynvar.dtdv_next offset");
_Static_assert(offsetof(struct ks_dtrace_dynvar, dtdv_data) == 0x10, "ks_dtrace_dynvar.dtdv_data offset");
_Static_assert(offsetof(struct ks_dtrace_dynvar, dtdv_tuple) == 0x18, "ks_dtrace_dynvar.dtdv_tuple offset");
_Static_assert(sizeof(struct ks_dtrace_dynvar) == 0x30, "ks_dtrace_dynvar size");

/* refs: 5 */
struct ks_dtrace_ecb {
    unsigned int dte_epid;
    unsigned int dte_alignment;
    unsigned long dte_needed;
    unsigned long dte_size;
    struct ks_dtrace_predicate *dte_predicate;
    struct ks_dtrace_action *dte_action;
    struct ks_dtrace_ecb *dte_next;
    struct ks_dtrace_state *dte_state;
    unsigned int dte_cond;
    struct ks_dtrace_probe *dte_probe;
    struct ks_dtrace_action *dte_action_last;
    unsigned long long dte_uarg;
};
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_epid) == 0x0, "ks_dtrace_ecb.dte_epid offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_alignment) == 0x4, "ks_dtrace_ecb.dte_alignment offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_needed) == 0x8, "ks_dtrace_ecb.dte_needed offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_size) == 0x10, "ks_dtrace_ecb.dte_size offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_predicate) == 0x18, "ks_dtrace_ecb.dte_predicate offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_action) == 0x20, "ks_dtrace_ecb.dte_action offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_next) == 0x28, "ks_dtrace_ecb.dte_next offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_state) == 0x30, "ks_dtrace_ecb.dte_state offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_cond) == 0x38, "ks_dtrace_ecb.dte_cond offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_probe) == 0x40, "ks_dtrace_ecb.dte_probe offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_action_last) == 0x48, "ks_dtrace_ecb.dte_action_last offset");
_Static_assert(offsetof(struct ks_dtrace_ecb, dte_uarg) == 0x50, "ks_dtrace_ecb.dte_uarg offset");
_Static_assert(sizeof(struct ks_dtrace_ecb) == 0x58, "ks_dtrace_ecb size");

/* refs: 2 */
struct ks_dtrace_format {
    unsigned long long dtf_refcount;
    char dtf_str[];
};
_Static_assert(offsetof(struct ks_dtrace_format, dtf_refcount) == 0x0, "ks_dtrace_format.dtf_refcount offset");
_Static_assert(offsetof(struct ks_dtrace_format, dtf_str) == 0x8, "ks_dtrace_format.dtf_str offset");
_Static_assert(sizeof(struct ks_dtrace_format) == 0x8, "ks_dtrace_format size");

/* refs: 2 */
struct ks_dtrace_helper_action {
    int dtha_generation;
    int dtha_nactions;
    struct ks_dtrace_difo *dtha_predicate;
    struct ks_dtrace_difo **dtha_actions;
    struct ks_dtrace_helper_action *dtha_next;
};
_Static_assert(offsetof(struct ks_dtrace_helper_action, dtha_generation) == 0x0, "ks_dtrace_helper_action.dtha_generation offset");
_Static_assert(offsetof(struct ks_dtrace_helper_action, dtha_nactions) == 0x4, "ks_dtrace_helper_action.dtha_nactions offset");
_Static_assert(offsetof(struct ks_dtrace_helper_action, dtha_predicate) == 0x8, "ks_dtrace_helper_action.dtha_predicate offset");
_Static_assert(offsetof(struct ks_dtrace_helper_action, dtha_actions) == 0x10, "ks_dtrace_helper_action.dtha_actions offset");
_Static_assert(offsetof(struct ks_dtrace_helper_action, dtha_next) == 0x18, "ks_dtrace_helper_action.dtha_next offset");
_Static_assert(sizeof(struct ks_dtrace_helper_action) == 0x20, "ks_dtrace_helper_action size");

/* refs: 2 */
struct ks_dtrace_helper_provider {
    int dthp_generation;
    unsigned int dthp_ref;
    struct ks_dof_helper dthp_prov;
};
_Static_assert(offsetof(struct ks_dtrace_helper_provider, dthp_generation) == 0x0, "ks_dtrace_helper_provider.dthp_generation offset");
_Static_assert(offsetof(struct ks_dtrace_helper_provider, dthp_ref) == 0x4, "ks_dtrace_helper_provider.dthp_ref offset");
_Static_assert(offsetof(struct ks_dtrace_helper_provider, dthp_prov) == 0x8, "ks_dtrace_helper_provider.dthp_prov offset");
_Static_assert(sizeof(struct ks_dtrace_helper_provider) == 0x58, "ks_dtrace_helper_provider size");

/* refs: 3 */
struct ks_dtrace_vstate {
    struct ks_dtrace_state *dtvs_state;
    struct ks_dtrace_statvar **dtvs_globals;
    int dtvs_nglobals;
    struct ks_dtrace_difv *dtvs_tlocals;
    int dtvs_ntlocals;
    struct ks_dtrace_statvar **dtvs_locals;
    int dtvs_nlocals;
    struct ks_dtrace_dstate dtvs_dynvars;
};
_Static_assert(offsetof(struct ks_dtrace_vstate, dtvs_state) == 0x0, "ks_dtrace_vstate.dtvs_state offset");
_Static_assert(offsetof(struct ks_dtrace_vstate, dtvs_globals) == 0x8, "ks_dtrace_vstate.dtvs_globals offset");
_Static_assert(offsetof(struct ks_dtrace_vstate, dtvs_nglobals) == 0x10, "ks_dtrace_vstate.dtvs_nglobals offset");
_Static_assert(offsetof(struct ks_dtrace_vstate, dtvs_tlocals) == 0x18, "ks_dtrace_vstate.dtvs_tlocals offset");
_Static_assert(offsetof(struct ks_dtrace_vstate, dtvs_ntlocals) == 0x20, "ks_dtrace_vstate.dtvs_ntlocals offset");
_Static_assert(offsetof(struct ks_dtrace_vstate, dtvs_locals) == 0x28, "ks_dtrace_vstate.dtvs_locals offset");
_Static_assert(offsetof(struct ks_dtrace_vstate, dtvs_nlocals) == 0x30, "ks_dtrace_vstate.dtvs_nlocals offset");
_Static_assert(offsetof(struct ks_dtrace_vstate, dtvs_dynvars) == 0x38, "ks_dtrace_vstate.dtvs_dynvars offset");
_Static_assert(sizeof(struct ks_dtrace_vstate) == 0x70, "ks_dtrace_vstate size");

/* refs: 1 */
struct ks_dtrace_helpers {
    struct ks_dtrace_helper_action **dthps_actions;
    struct ks_dtrace_vstate dthps_vstate;
    struct ks_dtrace_helper_provider **dthps_provs;
    unsigned int dthps_nprovs;
    unsigned int dthps_maxprovs;
    int dthps_generation;
    int dthps_pid;
    int dthps_deferred;
    struct ks_dtrace_helpers *dthps_next;
    struct ks_dtrace_helpers *dthps_prev;
};
_Static_assert(offsetof(struct ks_dtrace_helpers, dthps_actions) == 0x0, "ks_dtrace_helpers.dthps_actions offset");
_Static_assert(offsetof(struct ks_dtrace_helpers, dthps_vstate) == 0x8, "ks_dtrace_helpers.dthps_vstate offset");
_Static_assert(offsetof(struct ks_dtrace_helpers, dthps_provs) == 0x78, "ks_dtrace_helpers.dthps_provs offset");
_Static_assert(offsetof(struct ks_dtrace_helpers, dthps_nprovs) == 0x80, "ks_dtrace_helpers.dthps_nprovs offset");
_Static_assert(offsetof(struct ks_dtrace_helpers, dthps_maxprovs) == 0x84, "ks_dtrace_helpers.dthps_maxprovs offset");
_Static_assert(offsetof(struct ks_dtrace_helpers, dthps_generation) == 0x88, "ks_dtrace_helpers.dthps_generation offset");
_Static_assert(offsetof(struct ks_dtrace_helpers, dthps_pid) == 0x8C, "ks_dtrace_helpers.dthps_pid offset");
_Static_assert(offsetof(struct ks_dtrace_helpers, dthps_deferred) == 0x90, "ks_dtrace_helpers.dthps_deferred offset");
_Static_assert(offsetof(struct ks_dtrace_helpers, dthps_next) == 0x98, "ks_dtrace_helpers.dthps_next offset");
_Static_assert(offsetof(struct ks_dtrace_helpers, dthps_prev) == 0xA0, "ks_dtrace_helpers.dthps_prev offset");
_Static_assert(sizeof(struct ks_dtrace_helpers) == 0xA8, "ks_dtrace_helpers size");

/* refs: 2 */
struct ks_dtrace_pattr {
    struct ks_dtrace_attribute dtpa_provider;
    struct ks_dtrace_attribute dtpa_mod;
    struct ks_dtrace_attribute dtpa_func;
    struct ks_dtrace_attribute dtpa_name;
    struct ks_dtrace_attribute dtpa_args;
};
_Static_assert(offsetof(struct ks_dtrace_pattr, dtpa_provider) == 0x0, "ks_dtrace_pattr.dtpa_provider offset");
_Static_assert(offsetof(struct ks_dtrace_pattr, dtpa_mod) == 0x3, "ks_dtrace_pattr.dtpa_mod offset");
_Static_assert(offsetof(struct ks_dtrace_pattr, dtpa_func) == 0x6, "ks_dtrace_pattr.dtpa_func offset");
_Static_assert(offsetof(struct ks_dtrace_pattr, dtpa_name) == 0x9, "ks_dtrace_pattr.dtpa_name offset");
_Static_assert(offsetof(struct ks_dtrace_pattr, dtpa_args) == 0xC, "ks_dtrace_pattr.dtpa_args offset");
_Static_assert(sizeof(struct ks_dtrace_pattr) == 0xF, "ks_dtrace_pattr size");

/* refs: 2 */
struct ks_dtrace_pops {
    void *dtps_provide;
    void *dtps_provide_module;
    int *dtps_enable;
    void *dtps_disable;
    void *dtps_suspend;
    void *dtps_resume;
    void *dtps_getargdesc;
    unsigned long long *dtps_getargval;
    int *dtps_usermode;
    void *dtps_destroy;
};
_Static_assert(offsetof(struct ks_dtrace_pops, dtps_provide) == 0x0, "ks_dtrace_pops.dtps_provide offset");
_Static_assert(offsetof(struct ks_dtrace_pops, dtps_provide_module) == 0x8, "ks_dtrace_pops.dtps_provide_module offset");
_Static_assert(offsetof(struct ks_dtrace_pops, dtps_enable) == 0x10, "ks_dtrace_pops.dtps_enable offset");
_Static_assert(offsetof(struct ks_dtrace_pops, dtps_disable) == 0x18, "ks_dtrace_pops.dtps_disable offset");
_Static_assert(offsetof(struct ks_dtrace_pops, dtps_suspend) == 0x20, "ks_dtrace_pops.dtps_suspend offset");
_Static_assert(offsetof(struct ks_dtrace_pops, dtps_resume) == 0x28, "ks_dtrace_pops.dtps_resume offset");
_Static_assert(offsetof(struct ks_dtrace_pops, dtps_getargdesc) == 0x30, "ks_dtrace_pops.dtps_getargdesc offset");
_Static_assert(offsetof(struct ks_dtrace_pops, dtps_getargval) == 0x38, "ks_dtrace_pops.dtps_getargval offset");
_Static_assert(offsetof(struct ks_dtrace_pops, dtps_usermode) == 0x40, "ks_dtrace_pops.dtps_usermode offset");
_Static_assert(offsetof(struct ks_dtrace_pops, dtps_destroy) == 0x48, "ks_dtrace_pops.dtps_destroy offset");
_Static_assert(sizeof(struct ks_dtrace_pops) == 0x50, "ks_dtrace_pops size");

/* refs: 2 */
struct ks_dtrace_ppriv {
    unsigned int dtpp_flags;
    unsigned int dtpp_uid;
    unsigned int dtpp_zoneid;
};
_Static_assert(offsetof(struct ks_dtrace_ppriv, dtpp_flags) == 0x0, "ks_dtrace_ppriv.dtpp_flags offset");
_Static_assert(offsetof(struct ks_dtrace_ppriv, dtpp_uid) == 0x4, "ks_dtrace_ppriv.dtpp_uid offset");
_Static_assert(offsetof(struct ks_dtrace_ppriv, dtpp_zoneid) == 0x8, "ks_dtrace_ppriv.dtpp_zoneid offset");
_Static_assert(sizeof(struct ks_dtrace_ppriv) == 0xC, "ks_dtrace_ppriv size");

/* refs: 2 */
struct ks_dtrace_predicate {
    struct ks_dtrace_difo *dtp_difo;
    unsigned int dtp_cacheid;
    int dtp_refcnt;
};
_Static_assert(offsetof(struct ks_dtrace_predicate, dtp_difo) == 0x0, "ks_dtrace_predicate.dtp_difo offset");
_Static_assert(offsetof(struct ks_dtrace_predicate, dtp_cacheid) == 0x8, "ks_dtrace_predicate.dtp_cacheid offset");
_Static_assert(offsetof(struct ks_dtrace_predicate, dtp_refcnt) == 0xC, "ks_dtrace_predicate.dtp_refcnt offset");
_Static_assert(sizeof(struct ks_dtrace_predicate) == 0x10, "ks_dtrace_predicate size");

/* refs: 2 */
struct ks_dtrace_probe {
    unsigned int dtpr_id;
    struct ks_dtrace_ecb *dtpr_ecb;
    struct ks_dtrace_ecb *dtpr_ecb_last;
    void *dtpr_arg;
    unsigned int dtpr_predcache;
    int dtpr_aframes;
    struct ks_dtrace_provider *dtpr_provider;
    char *dtpr_mod;
    char *dtpr_func;
    char *dtpr_name;
    struct ks_dtrace_probe *dtpr_nextprov;
    struct ks_dtrace_probe *dtpr_prevprov;
    struct ks_dtrace_probe *dtpr_nextmod;
    struct ks_dtrace_probe *dtpr_prevmod;
    struct ks_dtrace_probe *dtpr_nextfunc;
    struct ks_dtrace_probe *dtpr_prevfunc;
    struct ks_dtrace_probe *dtpr_nextname;
    struct ks_dtrace_probe *dtpr_prevname;
    unsigned long long dtpr_gen;
};
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_id) == 0x0, "ks_dtrace_probe.dtpr_id offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_ecb) == 0x8, "ks_dtrace_probe.dtpr_ecb offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_ecb_last) == 0x10, "ks_dtrace_probe.dtpr_ecb_last offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_arg) == 0x18, "ks_dtrace_probe.dtpr_arg offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_predcache) == 0x20, "ks_dtrace_probe.dtpr_predcache offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_aframes) == 0x24, "ks_dtrace_probe.dtpr_aframes offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_provider) == 0x28, "ks_dtrace_probe.dtpr_provider offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_mod) == 0x30, "ks_dtrace_probe.dtpr_mod offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_func) == 0x38, "ks_dtrace_probe.dtpr_func offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_name) == 0x40, "ks_dtrace_probe.dtpr_name offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_nextprov) == 0x48, "ks_dtrace_probe.dtpr_nextprov offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_prevprov) == 0x50, "ks_dtrace_probe.dtpr_prevprov offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_nextmod) == 0x58, "ks_dtrace_probe.dtpr_nextmod offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_prevmod) == 0x60, "ks_dtrace_probe.dtpr_prevmod offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_nextfunc) == 0x68, "ks_dtrace_probe.dtpr_nextfunc offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_prevfunc) == 0x70, "ks_dtrace_probe.dtpr_prevfunc offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_nextname) == 0x78, "ks_dtrace_probe.dtpr_nextname offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_prevname) == 0x80, "ks_dtrace_probe.dtpr_prevname offset");
_Static_assert(offsetof(struct ks_dtrace_probe, dtpr_gen) == 0x88, "ks_dtrace_probe.dtpr_gen offset");
_Static_assert(sizeof(struct ks_dtrace_probe) == 0x90, "ks_dtrace_probe size");

/* refs: 2 */
struct ks_dtrace_provider {
    struct ks_dtrace_pattr dtpv_attr;
    struct ks_dtrace_ppriv dtpv_priv;
    struct ks_dtrace_pops dtpv_pops;
    char *dtpv_name;
    void *dtpv_arg;
    unsigned int dtpv_defunct;
    struct ks_dtrace_provider *dtpv_next;
    unsigned long long dtpv_probe_count;
    unsigned long long dtpv_ecb_count;
};
_Static_assert(offsetof(struct ks_dtrace_provider, dtpv_attr) == 0x0, "ks_dtrace_provider.dtpv_attr offset");
_Static_assert(offsetof(struct ks_dtrace_provider, dtpv_priv) == 0x10, "ks_dtrace_provider.dtpv_priv offset");
_Static_assert(offsetof(struct ks_dtrace_provider, dtpv_pops) == 0x20, "ks_dtrace_provider.dtpv_pops offset");
_Static_assert(offsetof(struct ks_dtrace_provider, dtpv_name) == 0x70, "ks_dtrace_provider.dtpv_name offset");
_Static_assert(offsetof(struct ks_dtrace_provider, dtpv_arg) == 0x78, "ks_dtrace_provider.dtpv_arg offset");
_Static_assert(offsetof(struct ks_dtrace_provider, dtpv_defunct) == 0x80, "ks_dtrace_provider.dtpv_defunct offset");
_Static_assert(offsetof(struct ks_dtrace_provider, dtpv_next) == 0x88, "ks_dtrace_provider.dtpv_next offset");
_Static_assert(offsetof(struct ks_dtrace_provider, dtpv_probe_count) == 0x90, "ks_dtrace_provider.dtpv_probe_count offset");
_Static_assert(offsetof(struct ks_dtrace_provider, dtpv_ecb_count) == 0x98, "ks_dtrace_provider.dtpv_ecb_count offset");
_Static_assert(sizeof(struct ks_dtrace_provider) == 0xA0, "ks_dtrace_provider size");

/* refs: 3 */
struct ks_dtrace_ptss_page_entry {
    struct ks_dtrace_ptss_page_entry *next;
    unsigned long long addr;
    unsigned long long write_addr;
};
_Static_assert(offsetof(struct ks_dtrace_ptss_page_entry, next) == 0x0, "ks_dtrace_ptss_page_entry.next offset");
_Static_assert(offsetof(struct ks_dtrace_ptss_page_entry, addr) == 0x8, "ks_dtrace_ptss_page_entry.addr offset");
_Static_assert(offsetof(struct ks_dtrace_ptss_page_entry, write_addr) == 0x10, "ks_dtrace_ptss_page_entry.write_addr offset");
_Static_assert(sizeof(struct ks_dtrace_ptss_page_entry) == 0x18, "ks_dtrace_ptss_page_entry size");

/* refs: 1 */
struct ks_dtrace_ptss_page {
    struct ks_dtrace_ptss_page *next;
    struct ks_dtrace_ptss_page_entry entries[0x100];
};
_Static_assert(offsetof(struct ks_dtrace_ptss_page, next) == 0x0, "ks_dtrace_ptss_page.next offset");
_Static_assert(offsetof(struct ks_dtrace_ptss_page, entries) == 0x8, "ks_dtrace_ptss_page.entries offset");
_Static_assert(sizeof(struct ks_dtrace_ptss_page) == 0x1808, "ks_dtrace_ptss_page size");

/* refs: 2 */
struct ks_dtrace_speculation {
    unsigned int dtsp_state;
    int dtsp_cleaning;
    struct ks_dtrace_buffer *dtsp_buffer;
};
_Static_assert(offsetof(struct ks_dtrace_speculation, dtsp_state) == 0x0, "ks_dtrace_speculation.dtsp_state offset");
_Static_assert(offsetof(struct ks_dtrace_speculation, dtsp_cleaning) == 0x4, "ks_dtrace_speculation.dtsp_cleaning offset");
_Static_assert(offsetof(struct ks_dtrace_speculation, dtsp_buffer) == 0x8, "ks_dtrace_speculation.dtsp_buffer offset");
_Static_assert(sizeof(struct ks_dtrace_speculation) == 0x10, "ks_dtrace_speculation size");

/* refs: 3 */
struct ks_dtrace_state {
    int dts_dev;
    int dts_necbs;
    struct ks_dtrace_ecb **dts_ecbs;
    unsigned int dts_epid;
    unsigned long dts_needed;
    struct ks_dtrace_state *dts_anon;
    unsigned int dts_activity;
    struct ks_dtrace_vstate dts_vstate;
    struct ks_dtrace_buffer *dts_buffer;
    struct ks_dtrace_buffer *dts_aggbuffer;
    struct ks_dtrace_speculation *dts_speculations;
    int dts_nspeculations;
    int dts_naggregations;
    struct ks_dtrace_aggregation **dts_aggregations;
    struct ks_vmem *dts_aggid_arena;
    unsigned long long dts_errors;
    unsigned int dts_speculations_busy;
    unsigned int dts_speculations_unavail;
    unsigned int dts_stkstroverflows;
    unsigned int dts_dblerrors;
    unsigned int dts_reserve;
    long long dts_laststatus;
    unsigned long dts_cleaner;
    unsigned long dts_deadman;
    long long dts_alive;
    char dts_speculates;
    char dts_destructive;
    int dts_nformats;
    struct ks_dtrace_format **dts_formats;
    long long dts_options[0x21];
    struct ks_dtrace_cred dts_cred;
    unsigned long dts_nretained;
    unsigned long long dts_arg_error_illval;
    unsigned int dts_buf_over_limit;
    unsigned long long **dts_rstate;
};
_Static_assert(offsetof(struct ks_dtrace_state, dts_dev) == 0x0, "ks_dtrace_state.dts_dev offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_necbs) == 0x4, "ks_dtrace_state.dts_necbs offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_ecbs) == 0x8, "ks_dtrace_state.dts_ecbs offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_epid) == 0x10, "ks_dtrace_state.dts_epid offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_needed) == 0x18, "ks_dtrace_state.dts_needed offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_anon) == 0x20, "ks_dtrace_state.dts_anon offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_activity) == 0x28, "ks_dtrace_state.dts_activity offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_vstate) == 0x30, "ks_dtrace_state.dts_vstate offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_buffer) == 0xA0, "ks_dtrace_state.dts_buffer offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_aggbuffer) == 0xA8, "ks_dtrace_state.dts_aggbuffer offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_speculations) == 0xB0, "ks_dtrace_state.dts_speculations offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_nspeculations) == 0xB8, "ks_dtrace_state.dts_nspeculations offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_naggregations) == 0xBC, "ks_dtrace_state.dts_naggregations offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_aggregations) == 0xC0, "ks_dtrace_state.dts_aggregations offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_aggid_arena) == 0xC8, "ks_dtrace_state.dts_aggid_arena offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_errors) == 0xD0, "ks_dtrace_state.dts_errors offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_speculations_busy) == 0xD8, "ks_dtrace_state.dts_speculations_busy offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_speculations_unavail) == 0xDC, "ks_dtrace_state.dts_speculations_unavail offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_stkstroverflows) == 0xE0, "ks_dtrace_state.dts_stkstroverflows offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_dblerrors) == 0xE4, "ks_dtrace_state.dts_dblerrors offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_reserve) == 0xE8, "ks_dtrace_state.dts_reserve offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_laststatus) == 0xF0, "ks_dtrace_state.dts_laststatus offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_cleaner) == 0xF8, "ks_dtrace_state.dts_cleaner offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_deadman) == 0x100, "ks_dtrace_state.dts_deadman offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_alive) == 0x108, "ks_dtrace_state.dts_alive offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_speculates) == 0x110, "ks_dtrace_state.dts_speculates offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_destructive) == 0x111, "ks_dtrace_state.dts_destructive offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_nformats) == 0x114, "ks_dtrace_state.dts_nformats offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_formats) == 0x118, "ks_dtrace_state.dts_formats offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_options) == 0x120, "ks_dtrace_state.dts_options offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_cred) == 0x228, "ks_dtrace_state.dts_cred offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_nretained) == 0x238, "ks_dtrace_state.dts_nretained offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_arg_error_illval) == 0x240, "ks_dtrace_state.dts_arg_error_illval offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_buf_over_limit) == 0x248, "ks_dtrace_state.dts_buf_over_limit offset");
_Static_assert(offsetof(struct ks_dtrace_state, dts_rstate) == 0x250, "ks_dtrace_state.dts_rstate offset");
_Static_assert(sizeof(struct ks_dtrace_state) == 0x258, "ks_dtrace_state size");

/* refs: 3 */
struct ks_dtrace_statvar {
    unsigned long long dtsv_data;
    unsigned long dtsv_size;
    int dtsv_refcnt;
    struct ks_dtrace_difv dtsv_var;
};
_Static_assert(offsetof(struct ks_dtrace_statvar, dtsv_data) == 0x0, "ks_dtrace_statvar.dtsv_data offset");
_Static_assert(offsetof(struct ks_dtrace_statvar, dtsv_size) == 0x8, "ks_dtrace_statvar.dtsv_size offset");
_Static_assert(offsetof(struct ks_dtrace_statvar, dtsv_refcnt) == 0x10, "ks_dtrace_statvar.dtsv_refcnt offset");
_Static_assert(offsetof(struct ks_dtrace_statvar, dtsv_var) == 0x14, "ks_dtrace_statvar.dtsv_var offset");
_Static_assert(sizeof(struct ks_dtrace_statvar) == 0x28, "ks_dtrace_statvar size");

/* refs: 1 */
struct ks_duplication {
    unsigned int duplication_p;
};
_Static_assert(offsetof(struct ks_duplication, duplication_p) == 0x0, "ks_duplication.duplication_p offset");
_Static_assert(sizeof(struct ks_duplication) == 0x4, "ks_duplication size");

/* refs: 1 */
struct ks_dyld_uuid_info_64 {
    unsigned long long imageLoadAddress;
    unsigned char imageUUID[0x10];
};
_Static_assert(offsetof(struct ks_dyld_uuid_info_64, imageLoadAddress) == 0x0, "ks_dyld_uuid_info_64.imageLoadAddress offset");
_Static_assert(offsetof(struct ks_dyld_uuid_info_64, imageUUID) == 0x8, "ks_dyld_uuid_info_64.imageUUID offset");
_Static_assert(sizeof(struct ks_dyld_uuid_info_64) == 0x18, "ks_dyld_uuid_info_64 size");

/* refs: 1 */
struct ks_entry_template {
    char et_key[0x20];
    char et_group[0x20];
    char et_units[0x20];
    unsigned int et_flags;
    unsigned short et_size;
    unsigned short et_offset;
    struct ks_ledger_callback *et_callback;
};
_Static_assert(offsetof(struct ks_entry_template, et_key) == 0x0, "ks_entry_template.et_key offset");
_Static_assert(offsetof(struct ks_entry_template, et_group) == 0x20, "ks_entry_template.et_group offset");
_Static_assert(offsetof(struct ks_entry_template, et_units) == 0x40, "ks_entry_template.et_units offset");
_Static_assert(offsetof(struct ks_entry_template, et_flags) == 0x60, "ks_entry_template.et_flags offset");
_Static_assert(offsetof(struct ks_entry_template, et_size) == 0x64, "ks_entry_template.et_size offset");
_Static_assert(offsetof(struct ks_entry_template, et_offset) == 0x66, "ks_entry_template.et_offset offset");
_Static_assert(offsetof(struct ks_entry_template, et_callback) == 0x68, "ks_entry_template.et_callback offset");
_Static_assert(sizeof(struct ks_entry_template) == 0x70, "ks_entry_template size");

/* refs: 1 */
struct ks_eventhandler_entry_arg {
    unsigned char ee_fm_uuid[0x10];
    unsigned char ee_fr_uuid[0x10];
};
_Static_assert(offsetof(struct ks_eventhandler_entry_arg, ee_fm_uuid) == 0x0, "ks_eventhandler_entry_arg.ee_fm_uuid offset");
_Static_assert(offsetof(struct ks_eventhandler_entry_arg, ee_fr_uuid) == 0x10, "ks_eventhandler_entry_arg.ee_fr_uuid offset");
_Static_assert(sizeof(struct ks_eventhandler_entry_arg) == 0x20, "ks_eventhandler_entry_arg size");

/* refs: 4 */
struct ks_eventhandler_entry {
    struct {
        struct ks_eventhandler_entry *tqe_next;
        struct ks_eventhandler_entry **tqe_prev;
    } ee_link;
    int ee_priority;
    struct ks_eventhandler_entry_arg ee_arg;
};
_Static_assert(offsetof(struct ks_eventhandler_entry, ee_link) == 0x0, "ks_eventhandler_entry.ee_link offset");
_Static_assert(offsetof(struct ks_eventhandler_entry, ee_priority) == 0x10, "ks_eventhandler_entry.ee_priority offset");
_Static_assert(offsetof(struct ks_eventhandler_entry, ee_arg) == 0x14, "ks_eventhandler_entry.ee_arg offset");
_Static_assert(sizeof(struct ks_eventhandler_entry) == 0x38, "ks_eventhandler_entry size");

/* refs: 4 */
struct ks_eventhandler_list {
    char el_name[0x20];
    int el_flags;
    unsigned int el_runcount;
    struct ks_lck_mtx_s el_lock;
    struct {
        struct ks_eventhandler_list *tqe_next;
        struct ks_eventhandler_list **tqe_prev;
    } el_link;
    struct {
        struct ks_eventhandler_entry *tqh_first;
        struct ks_eventhandler_entry **tqh_last;
    } el_entries;
};
_Static_assert(offsetof(struct ks_eventhandler_list, el_name) == 0x0, "ks_eventhandler_list.el_name offset");
_Static_assert(offsetof(struct ks_eventhandler_list, el_flags) == 0x20, "ks_eventhandler_list.el_flags offset");
_Static_assert(offsetof(struct ks_eventhandler_list, el_runcount) == 0x24, "ks_eventhandler_list.el_runcount offset");
_Static_assert(offsetof(struct ks_eventhandler_list, el_lock) == 0x28, "ks_eventhandler_list.el_lock offset");
_Static_assert(offsetof(struct ks_eventhandler_list, el_link) == 0x38, "ks_eventhandler_list.el_link offset");
_Static_assert(offsetof(struct ks_eventhandler_list, el_entries) == 0x48, "ks_eventhandler_list.el_entries offset");
_Static_assert(sizeof(struct ks_eventhandler_list) == 0x58, "ks_eventhandler_list size");

/* refs: 1 */
struct ks_eventhandler_lists_ctxt {
    struct {
        struct ks_eventhandler_list *tqh_first;
        struct ks_eventhandler_list **tqh_last;
    } eventhandler_lists;
    int eventhandler_lists_initted;
    struct ks_lck_mtx_s eventhandler_mutex;
};
_Static_assert(offsetof(struct ks_eventhandler_lists_ctxt, eventhandler_lists) == 0x0, "ks_eventhandler_lists_ctxt.eventhandler_lists offset");
_Static_assert(offsetof(struct ks_eventhandler_lists_ctxt, eventhandler_lists_initted) == 0x10, "ks_eventhandler_lists_ctxt.eventhandler_lists_initted offset");
_Static_assert(offsetof(struct ks_eventhandler_lists_ctxt, eventhandler_mutex) == 0x18, "ks_eventhandler_lists_ctxt.eventhandler_mutex offset");
_Static_assert(sizeof(struct ks_eventhandler_lists_ctxt) == 0x28, "ks_eventhandler_lists_ctxt size");

/* refs: 2 */
struct ks_exception_action {
    struct ks_ipc_port *port;
    int flavor;
    int behavior;
    int privileged;
    int hardened;
    struct ks_label *label;
};
_Static_assert(offsetof(struct ks_exception_action, port) == 0x0, "ks_exception_action.port offset");
_Static_assert(offsetof(struct ks_exception_action, flavor) == 0x8, "ks_exception_action.flavor offset");
_Static_assert(offsetof(struct ks_exception_action, behavior) == 0xC, "ks_exception_action.behavior offset");
_Static_assert(offsetof(struct ks_exception_action, privileged) == 0x10, "ks_exception_action.privileged offset");
_Static_assert(offsetof(struct ks_exception_action, hardened) == 0x14, "ks_exception_action.hardened offset");
_Static_assert(offsetof(struct ks_exception_action, label) == 0x18, "ks_exception_action.label offset");
_Static_assert(sizeof(struct ks_exception_action) == 0x20, "ks_exception_action size");

/* refs: 1 */
struct ks_ext_ref {
    struct ks_mbuf *paired;
    unsigned short minref;
    unsigned short refcnt;
    unsigned short prefcnt;
    unsigned short flags;
    unsigned int priv;
};
_Static_assert(offsetof(struct ks_ext_ref, paired) == 0x0, "ks_ext_ref.paired offset");
_Static_assert(offsetof(struct ks_ext_ref, minref) == 0x8, "ks_ext_ref.minref offset");
_Static_assert(offsetof(struct ks_ext_ref, refcnt) == 0xA, "ks_ext_ref.refcnt offset");
_Static_assert(offsetof(struct ks_ext_ref, prefcnt) == 0xC, "ks_ext_ref.prefcnt offset");
_Static_assert(offsetof(struct ks_ext_ref, flags) == 0xE, "ks_ext_ref.flags offset");
_Static_assert(offsetof(struct ks_ext_ref, priv) == 0x10, "ks_ext_ref.priv offset");
_Static_assert(sizeof(struct ks_ext_ref) == 0x18, "ks_ext_ref size");

/* refs: 1 */
struct ks_fd_pcb_tree {
    struct ks_flow_divert_pcb *rbh_root;
};
_Static_assert(offsetof(struct ks_fd_pcb_tree, rbh_root) == 0x0, "ks_fd_pcb_tree.rbh_root offset");
_Static_assert(sizeof(struct ks_fd_pcb_tree) == 0x8, "ks_fd_pcb_tree size");

/* refs: 1 */
struct ks_fd_vn_data {
    struct ks_lck_mtx_s fv_lock;
    long long fv_offset;
    void *fv_dircookie;
    char *fv_buf;
    unsigned long fv_bufsiz;
    unsigned long fv_bufdone;
    unsigned long fv_bufallocsiz;
    long long fv_soff;
    long long fv_eoff;
    int fv_eofflag;
};
_Static_assert(offsetof(struct ks_fd_vn_data, fv_lock) == 0x0, "ks_fd_vn_data.fv_lock offset");
_Static_assert(offsetof(struct ks_fd_vn_data, fv_offset) == 0x10, "ks_fd_vn_data.fv_offset offset");
_Static_assert(offsetof(struct ks_fd_vn_data, fv_dircookie) == 0x18, "ks_fd_vn_data.fv_dircookie offset");
_Static_assert(offsetof(struct ks_fd_vn_data, fv_buf) == 0x20, "ks_fd_vn_data.fv_buf offset");
_Static_assert(offsetof(struct ks_fd_vn_data, fv_bufsiz) == 0x28, "ks_fd_vn_data.fv_bufsiz offset");
_Static_assert(offsetof(struct ks_fd_vn_data, fv_bufdone) == 0x30, "ks_fd_vn_data.fv_bufdone offset");
_Static_assert(offsetof(struct ks_fd_vn_data, fv_bufallocsiz) == 0x38, "ks_fd_vn_data.fv_bufallocsiz offset");
_Static_assert(offsetof(struct ks_fd_vn_data, fv_soff) == 0x40, "ks_fd_vn_data.fv_soff offset");
_Static_assert(offsetof(struct ks_fd_vn_data, fv_eoff) == 0x48, "ks_fd_vn_data.fv_eoff offset");
_Static_assert(offsetof(struct ks_fd_vn_data, fv_eofflag) == 0x50, "ks_fd_vn_data.fv_eofflag offset");
_Static_assert(sizeof(struct ks_fd_vn_data) == 0x58, "ks_fd_vn_data size");

/* refs: 1 */
struct ks_fifoinfo {
    unsigned int fi_flags;
    struct ks_socket *fi_readsock;
    struct ks_socket *fi_writesock;
    long fi_readers;
    long fi_writers;
    unsigned int fi_count;
};
_Static_assert(offsetof(struct ks_fifoinfo, fi_flags) == 0x0, "ks_fifoinfo.fi_flags offset");
_Static_assert(offsetof(struct ks_fifoinfo, fi_readsock) == 0x8, "ks_fifoinfo.fi_readsock offset");
_Static_assert(offsetof(struct ks_fifoinfo, fi_writesock) == 0x10, "ks_fifoinfo.fi_writesock offset");
_Static_assert(offsetof(struct ks_fifoinfo, fi_readers) == 0x18, "ks_fifoinfo.fi_readers offset");
_Static_assert(offsetof(struct ks_fifoinfo, fi_writers) == 0x20, "ks_fifoinfo.fi_writers offset");
_Static_assert(offsetof(struct ks_fifoinfo, fi_count) == 0x28, "ks_fifoinfo.fi_count offset");
_Static_assert(sizeof(struct ks_fifoinfo) == 0x30, "ks_fifoinfo size");

/* refs: 3 */
struct ks_file_lease {
    struct {
        struct ks_file_lease *le_next;
        struct ks_file_lease **le_prev;
    } fl_link;
    struct ks_fileglob *fl_fg;
    int fl_pid;
    int fl_type;
    unsigned int fl_flags;
    unsigned long long fl_release_start;
    unsigned long long fl_downgrade_start;
};
_Static_assert(offsetof(struct ks_file_lease, fl_link) == 0x0, "ks_file_lease.fl_link offset");
_Static_assert(offsetof(struct ks_file_lease, fl_fg) == 0x10, "ks_file_lease.fl_fg offset");
_Static_assert(offsetof(struct ks_file_lease, fl_pid) == 0x18, "ks_file_lease.fl_pid offset");
_Static_assert(offsetof(struct ks_file_lease, fl_type) == 0x1C, "ks_file_lease.fl_type offset");
_Static_assert(offsetof(struct ks_file_lease, fl_flags) == 0x20, "ks_file_lease.fl_flags offset");
_Static_assert(offsetof(struct ks_file_lease, fl_release_start) == 0x28, "ks_file_lease.fl_release_start offset");
_Static_assert(offsetof(struct ks_file_lease, fl_downgrade_start) == 0x30, "ks_file_lease.fl_downgrade_start offset");
_Static_assert(sizeof(struct ks_file_lease) == 0x38, "ks_file_lease size");

/* refs: 1 */
struct ks_filedesc {
    struct ks_lck_mtx_s fd_lock;
    unsigned char fd_fpdrainwait;
    unsigned char fd_flags;
    unsigned short fd_cmask;
    int fd_nfiles;
    int fd_afterlast;
    int fd_freefile;
    int fd_knlistsize;
    int unused_padding;
    struct ks_fileproc **fd_ofiles;
    char *fd_ofileflags;
    struct ks_klist *fd_knlist;
    struct ks_kqworkq *fd_wqkqueue;
    struct ks_vnode *fd_cdir;
    struct ks_vnode *fd_rdir;
    struct ks_lck_rw_s fd_dirs_lock;
    struct ks_lck_mtx_s fd_kqhashlock;
    unsigned long fd_kqhashmask;
    struct ks_kqwllist *fd_kqhash;
    struct ks_lck_mtx_s fd_knhashlock;
    unsigned long fd_knhashmask;
    struct ks_klist *fd_knhash;
};
_Static_assert(offsetof(struct ks_filedesc, fd_lock) == 0x0, "ks_filedesc.fd_lock offset");
_Static_assert(offsetof(struct ks_filedesc, fd_fpdrainwait) == 0x10, "ks_filedesc.fd_fpdrainwait offset");
_Static_assert(offsetof(struct ks_filedesc, fd_flags) == 0x11, "ks_filedesc.fd_flags offset");
_Static_assert(offsetof(struct ks_filedesc, fd_cmask) == 0x12, "ks_filedesc.fd_cmask offset");
_Static_assert(offsetof(struct ks_filedesc, fd_nfiles) == 0x14, "ks_filedesc.fd_nfiles offset");
_Static_assert(offsetof(struct ks_filedesc, fd_afterlast) == 0x18, "ks_filedesc.fd_afterlast offset");
_Static_assert(offsetof(struct ks_filedesc, fd_freefile) == 0x1C, "ks_filedesc.fd_freefile offset");
_Static_assert(offsetof(struct ks_filedesc, fd_knlistsize) == 0x20, "ks_filedesc.fd_knlistsize offset");
_Static_assert(offsetof(struct ks_filedesc, unused_padding) == 0x24, "ks_filedesc.unused_padding offset");
_Static_assert(offsetof(struct ks_filedesc, fd_ofiles) == 0x28, "ks_filedesc.fd_ofiles offset");
_Static_assert(offsetof(struct ks_filedesc, fd_ofileflags) == 0x30, "ks_filedesc.fd_ofileflags offset");
_Static_assert(offsetof(struct ks_filedesc, fd_knlist) == 0x38, "ks_filedesc.fd_knlist offset");
_Static_assert(offsetof(struct ks_filedesc, fd_wqkqueue) == 0x40, "ks_filedesc.fd_wqkqueue offset");
_Static_assert(offsetof(struct ks_filedesc, fd_cdir) == 0x48, "ks_filedesc.fd_cdir offset");
_Static_assert(offsetof(struct ks_filedesc, fd_rdir) == 0x50, "ks_filedesc.fd_rdir offset");
_Static_assert(offsetof(struct ks_filedesc, fd_dirs_lock) == 0x58, "ks_filedesc.fd_dirs_lock offset");
_Static_assert(offsetof(struct ks_filedesc, fd_kqhashlock) == 0x68, "ks_filedesc.fd_kqhashlock offset");
_Static_assert(offsetof(struct ks_filedesc, fd_kqhashmask) == 0x78, "ks_filedesc.fd_kqhashmask offset");
_Static_assert(offsetof(struct ks_filedesc, fd_kqhash) == 0x80, "ks_filedesc.fd_kqhash offset");
_Static_assert(offsetof(struct ks_filedesc, fd_knhashlock) == 0x88, "ks_filedesc.fd_knhashlock offset");
_Static_assert(offsetof(struct ks_filedesc, fd_knhashmask) == 0x98, "ks_filedesc.fd_knhashmask offset");
_Static_assert(offsetof(struct ks_filedesc, fd_knhash) == 0xA0, "ks_filedesc.fd_knhash offset");
_Static_assert(sizeof(struct ks_filedesc) == 0xA8, "ks_filedesc size");

/* refs: 4 */
struct ks_fileglob {
    struct {
        struct ks_fileglob *le_next;
        struct ks_fileglob **le_prev;
    } f_msglist;
    unsigned int fg_flag;
    unsigned int fg_count;
    unsigned int fg_msgcount;
    int fg_lflags;
    struct ks_ucred *fg_cred;
    const struct ks_fileops *fg_ops;
    long long fg_offset;
    unsigned long fg_data;
    struct ks_fd_vn_data *fg_vn_data;
    struct ks_lck_mtx_s fg_lock;
};
_Static_assert(offsetof(struct ks_fileglob, f_msglist) == 0x0, "ks_fileglob.f_msglist offset");
_Static_assert(offsetof(struct ks_fileglob, fg_flag) == 0x10, "ks_fileglob.fg_flag offset");
_Static_assert(offsetof(struct ks_fileglob, fg_count) == 0x14, "ks_fileglob.fg_count offset");
_Static_assert(offsetof(struct ks_fileglob, fg_msgcount) == 0x18, "ks_fileglob.fg_msgcount offset");
_Static_assert(offsetof(struct ks_fileglob, fg_lflags) == 0x1C, "ks_fileglob.fg_lflags offset");
_Static_assert(offsetof(struct ks_fileglob, fg_cred) == 0x20, "ks_fileglob.fg_cred offset");
_Static_assert(offsetof(struct ks_fileglob, fg_ops) == 0x28, "ks_fileglob.fg_ops offset");
_Static_assert(offsetof(struct ks_fileglob, fg_offset) == 0x30, "ks_fileglob.fg_offset offset");
_Static_assert(offsetof(struct ks_fileglob, fg_data) == 0x38, "ks_fileglob.fg_data offset");
_Static_assert(offsetof(struct ks_fileglob, fg_vn_data) == 0x40, "ks_fileglob.fg_vn_data offset");
_Static_assert(offsetof(struct ks_fileglob, fg_lock) == 0x48, "ks_fileglob.fg_lock offset");
_Static_assert(sizeof(struct ks_fileglob) == 0x58, "ks_fileglob size");

/* refs: 1 */
struct ks_fileops {
    unsigned int fo_type;
    int *fo_read;
    int *fo_write;
    int *fo_ioctl;
    int *fo_select;
    int *fo_close;
    int *fo_kqfilter;
    int *fo_drain;
};
_Static_assert(offsetof(struct ks_fileops, fo_type) == 0x0, "ks_fileops.fo_type offset");
_Static_assert(offsetof(struct ks_fileops, fo_read) == 0x8, "ks_fileops.fo_read offset");
_Static_assert(offsetof(struct ks_fileops, fo_write) == 0x10, "ks_fileops.fo_write offset");
_Static_assert(offsetof(struct ks_fileops, fo_ioctl) == 0x18, "ks_fileops.fo_ioctl offset");
_Static_assert(offsetof(struct ks_fileops, fo_select) == 0x20, "ks_fileops.fo_select offset");
_Static_assert(offsetof(struct ks_fileops, fo_close) == 0x28, "ks_fileops.fo_close offset");
_Static_assert(offsetof(struct ks_fileops, fo_kqfilter) == 0x30, "ks_fileops.fo_kqfilter offset");
_Static_assert(offsetof(struct ks_fileops, fo_drain) == 0x38, "ks_fileops.fo_drain offset");
_Static_assert(sizeof(struct ks_fileops) == 0x40, "ks_fileops size");

/* refs: 3 */
struct ks_fileproc {
    struct ks_os_refcnt fp_iocount;
    unsigned int fp_vflags;
    unsigned short fp_flags;
    unsigned short fp_guard_attrs;
    struct ks_fileglob *fp_glob;
    union {
        struct ks_select_set *fp_wset;
        struct ks_fileproc_guard *fp_guard;
    };
};
_Static_assert(offsetof(struct ks_fileproc, fp_iocount) == 0x0, "ks_fileproc.fp_iocount offset");
_Static_assert(offsetof(struct ks_fileproc, fp_vflags) == 0x4, "ks_fileproc.fp_vflags offset");
_Static_assert(offsetof(struct ks_fileproc, fp_flags) == 0x8, "ks_fileproc.fp_flags offset");
_Static_assert(offsetof(struct ks_fileproc, fp_guard_attrs) == 0xA, "ks_fileproc.fp_guard_attrs offset");
_Static_assert(offsetof(struct ks_fileproc, fp_glob) == 0x10, "ks_fileproc.fp_glob offset");
_Static_assert(sizeof(struct ks_fileproc) == 0x20, "ks_fileproc size");

/* refs: 1 */
struct ks_fileproc_guard {
    struct ks_select_set *fpg_wset;
    unsigned long long fpg_guard;
};
_Static_assert(offsetof(struct ks_fileproc_guard, fpg_wset) == 0x0, "ks_fileproc_guard.fpg_wset offset");
_Static_assert(offsetof(struct ks_fileproc_guard, fpg_guard) == 0x8, "ks_fileproc_guard.fpg_guard offset");
_Static_assert(sizeof(struct ks_fileproc_guard) == 0x10, "ks_fileproc_guard size");

/* refs: 1 */
struct ks_fl_head {
    struct ks_file_lease *lh_first;
};
_Static_assert(offsetof(struct ks_fl_head, lh_first) == 0x0, "ks_fl_head.lh_first offset");
_Static_assert(sizeof(struct ks_fl_head) == 0x8, "ks_fl_head size");

/* refs: 1 */
struct ks_flow_divert_trie {
    struct ks_flow_divert_trie_node *nodes;
    unsigned short *child_maps;
    unsigned char *bytes;
    void *memory;
    unsigned short nodes_count;
    unsigned short child_maps_count;
    unsigned short bytes_count;
    unsigned short nodes_free_next;
    unsigned short child_maps_free_next;
    unsigned short bytes_free_next;
    unsigned short root;
    unsigned long memory_size;
    unsigned long child_maps_size;
};
_Static_assert(offsetof(struct ks_flow_divert_trie, nodes) == 0x0, "ks_flow_divert_trie.nodes offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, child_maps) == 0x8, "ks_flow_divert_trie.child_maps offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, bytes) == 0x10, "ks_flow_divert_trie.bytes offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, memory) == 0x18, "ks_flow_divert_trie.memory offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, nodes_count) == 0x20, "ks_flow_divert_trie.nodes_count offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, child_maps_count) == 0x22, "ks_flow_divert_trie.child_maps_count offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, bytes_count) == 0x24, "ks_flow_divert_trie.bytes_count offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, nodes_free_next) == 0x26, "ks_flow_divert_trie.nodes_free_next offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, child_maps_free_next) == 0x28, "ks_flow_divert_trie.child_maps_free_next offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, bytes_free_next) == 0x2A, "ks_flow_divert_trie.bytes_free_next offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, root) == 0x2C, "ks_flow_divert_trie.root offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, memory_size) == 0x30, "ks_flow_divert_trie.memory_size offset");
_Static_assert(offsetof(struct ks_flow_divert_trie, child_maps_size) == 0x38, "ks_flow_divert_trie.child_maps_size offset");
_Static_assert(sizeof(struct ks_flow_divert_trie) == 0x40, "ks_flow_divert_trie size");

/* refs: 1 */
struct ks_send_queue_head {
    struct ks_mbuf *mq_first;
    struct ks_mbuf **mq_last;
};
_Static_assert(offsetof(struct ks_send_queue_head, mq_first) == 0x0, "ks_send_queue_head.mq_first offset");
_Static_assert(offsetof(struct ks_send_queue_head, mq_last) == 0x8, "ks_send_queue_head.mq_last offset");
_Static_assert(sizeof(struct ks_send_queue_head) == 0x10, "ks_send_queue_head size");

/* refs: 3 */
struct ks_flow_divert_group {
    struct ks_lck_rw_s lck;
    struct {
        struct ks_flow_divert_group *tqe_next;
        struct ks_flow_divert_group **tqe_prev;
    } chain;
    struct ks_fd_pcb_tree pcb_tree;
    unsigned int ctl_unit;
    unsigned char atomic_bits;
    struct ks_send_queue_head send_queue;
    unsigned char *token_key;
    unsigned long token_key_size;
    unsigned int flags;
    struct ks_flow_divert_trie signing_id_trie;
    int ref_count;
    int in_process_pid;
    int order;
};
_Static_assert(offsetof(struct ks_flow_divert_group, lck) == 0x0, "ks_flow_divert_group.lck offset");
_Static_assert(offsetof(struct ks_flow_divert_group, chain) == 0x10, "ks_flow_divert_group.chain offset");
_Static_assert(offsetof(struct ks_flow_divert_group, pcb_tree) == 0x20, "ks_flow_divert_group.pcb_tree offset");
_Static_assert(offsetof(struct ks_flow_divert_group, ctl_unit) == 0x28, "ks_flow_divert_group.ctl_unit offset");
_Static_assert(offsetof(struct ks_flow_divert_group, atomic_bits) == 0x2C, "ks_flow_divert_group.atomic_bits offset");
_Static_assert(offsetof(struct ks_flow_divert_group, send_queue) == 0x30, "ks_flow_divert_group.send_queue offset");
_Static_assert(offsetof(struct ks_flow_divert_group, token_key) == 0x40, "ks_flow_divert_group.token_key offset");
